gap> START_TEST("HyperCells: TGCellModelGraph.tst");

# Triangle group (2,8,8)
gap> sign := [ 2, 8, 8 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 6 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 5);;
gap> tmg := TessellationModelGraph(cg, false : simplify := 0);
TGCellModelGraph( TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^3*z^-1 ] ), center = 3, type = [ "TESS", [ 8, 8 ], [ "VEF", [ [ 2 ], [ 1 ], [ 3 ] ] ] ], vertices = [ \
[ 2, 1 ] ], edges = [ [ 1, 1, [ 1, [ 1, 1, 5 ] ], g4*g3^-1*g2 ], [ 1, 1, [ 1, [ 2, 4, 8 ] ], g1^-1*g2*g3^-1 ], [ 1, 1, [ 1, [ 3, 2, 6 ] ], g1^-1*g3*g4^-1 ], [ 1, 1, [ 1, [ 4, 3\
, 7 ] ], g4*g2^-1*g1 ] ], faces = [ [ [ 1, 1 ], [ 3, 1 ], [ 4, 1 ], [ 2, 1 ], [ 1, -1 ], [ 3, -1 ], [ 4, -1 ], [ 2, -1 ] ] ] )
gap> dtmg := TessellationModelGraph(cg, true : simplify := 5);
TGCellModelGraph( TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^3*z^-1 ] ), center = 3, type = [ "TESS", [ 8, 8 ], [ "VEF", [ [ 3 ], [ 1 ], [ 2 ] ] ] ], vertices = [ \
[ 3, 1 ] ], edges = [ [ 1, 1, [ 1, [ 1, 1, 5 ] ], g1 ], [ 1, 1, [ 1, [ 2, 4, 8 ] ], g4 ], [ 1, 1, [ 1, [ 3, 2, 6 ] ], g2 ], [ 1, 1, [ 1, [ 4, 3, 7 ] ], g3 ] ], faces = [ [ [ 1,\
 -1 ], [ 2, -1 ], [ 4, 1 ], [ 3, -1 ], [ 1, 1 ], [ 2, 1 ], [ 4, -1 ], [ 3, 1 ] ] ] )

gap> GetProperTriangleGroup(dtmg) = tg;
true
gap> CellRelators(dtmg);
[ x^2, x*y*z, x*z*y, y^3*z^-1 ]
gap> CellCenter(dtmg) = 3;
true
gap> GetTGCell(dtmg) = GetTGCell(cg);
true
gap> ModelType(dtmg);
[ "TESS", [ 8, 8 ], [ "VEF", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]
gap> ModelName(dtmg);
"{8,8}-tess"
gap> ModelType(tmg);
[ "TESS", [ 8, 8 ], [ "VEF", [ [ 2 ], [ 1 ], [ 3 ] ] ] ]
gap> ModelName(tmg);
"{8,8}-tess"

gap> CellVertices(dtmg);
[ [ 3, 1 ] ]
gap> CellVertexPositions(dtmg);
[ <identity ...> ]
gap> CellEdges(dtmg);
[ [ 1, 1, [ 1, [ 1, 1, 5 ] ], g1 ], [ 1, 1, [ 1, [ 2, 4, 8 ] ], g4 ], [ 1, 1, [ 1, [ 3, 2, 6 ] ], g2 ], [ 1, 1, [ 1, [ 4, 3, 7 ] ], g3 ] ]
gap> CellEdgeTranslations(dtmg);
[ g1, g4, g2, g3 ]
gap> CellFaces(dtmg);
[ [ [ 1, -1 ], [ 2, -1 ], [ 4, 1 ], [ 3, -1 ], [ 1, 1 ], [ 2, 1 ], [ 4, -1 ], [ 3, 1 ] ] ]

gap> ImportTGCellModelGraphFromString(ExportString(dtmg), tg) = dtmg;
true


# Triangle group (2,3,8)
gap> sign := [ 2, 3, 8 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 1 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 5);;
gap> tmg := TessellationModelGraph(cg, false : simplify := 5);
TGCellModelGraph( TGCell( ProperTriangleGroup(2, 3, 8), [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ] ), center = 3, type = [ "TESS", [ 8, 3 ], [ "VEF", [ [ 2 ], [ 1 ], [ 3 ] ] ] ], ve\
rtices = [ [ 2, 1 ], [ 2, 2 ], [ 2, 3 ], [ 2, 4 ], [ 2, 5 ], [ 2, 6 ], [ 2, 7 ], [ 2, 8 ], [ 2, 9 ], [ 2, 10 ], [ 2, 11 ], [ 2, 12 ], [ 2, 13 ], [ 2, 14 ], [ 2, 15 ], [ 2, 16 ]\
 ], edges = [ [ 1, 2, [ 1, [ 1, 1, 9 ] ], <identity ...> ], [ 3, 1, [ 1, [ 2, 8, 16 ] ], <identity ...> ], [ 1, 4, [ 1, [ 3, 17, 32 ] ], <identity ...> ], [ 2, 5, [ 1, [ 4, 2, \
10 ] ], <identity ...> ], [ 2, 6, [ 1, [ 5, 18, 25 ] ], <identity ...> ], [ 7, 3, [ 1, [ 6, 7, 15 ] ], <identity ...> ], [ 3, 8, [ 1, [ 7, 24, 31 ] ], <identity ...> ], [ 4, 9,\
 [ 1, [ 8, 33, 45 ] ], g1 ], [ 5, 10, [ 1, [ 9, 3, 11 ] ], <identity ...> ], [ 11, 4, [ 1, [ 10, 36, 48 ] ], g4 ], [ 5, 12, [ 1, [ 11, 19, 26 ] ], <identity ...> ], [ 13, 6, [ \
1, [ 12, 37, 41 ] ], g1^-1 ], [ 14, 7, [ 1, [ 13, 6, 14 ] ], <identity ...> ], [ 6, 15, [ 1, [ 14, 34, 46 ] ], g2 ], [ 7, 15, [ 1, [ 15, 23, 30 ] ], <identity ...> ], [ 8, 13, \
[ 1, [ 16, 40, 44 ] ], g4^-1 ], [ 14, 9, [ 1, [ 17, 22, 29 ] ], <identity ...> ], [ 10, 16, [ 1, [ 18, 4, 12 ] ], <identity ...> ], [ 12, 8, [ 1, [ 19, 35, 47 ] ], g3 ], [ 9, 1\
2, [ 1, [ 20, 38, 42 ] ], g2^-1 ], [ 10, 11, [ 1, [ 21, 20, 27 ] ], <identity ...> ], [ 16, 13, [ 1, [ 22, 21, 28 ] ], <identity ...> ], [ 16, 14, [ 1, [ 23, 5, 13 ] ], <identi\
ty ...> ], [ 15, 11, [ 1, [ 24, 39, 43 ] ], g3^-1 ] ], faces = [ [ [ 1, 1 ], [ 4, 1 ], [ 9, 1 ], [ 18, 1 ], [ 23, 1 ], [ 13, 1 ], [ 6, 1 ], [ 2, 1 ] ], [ [ 1, -1 ], [ 3, 1 ], [\
 8, 1 ], [ 17, -1 ], [ 23, -1 ], [ 22, 1 ], [ 12, 1 ], [ 5, -1 ] ], [ [ 18, -1 ], [ 21, 1 ], [ 10, 1 ], [ 3, -1 ], [ 2, -1 ], [ 7, 1 ], [ 16, 1 ], [ 22, -1 ] ], [ [ 4, -1 ], [ \
5, 1 ], [ 14, 1 ], [ 15, -1 ], [ 13, -1 ], [ 17, 1 ], [ 20, 1 ], [ 11, -1 ] ], [ [ 9, -1 ], [ 11, 1 ], [ 19, 1 ], [ 7, -1 ], [ 6, -1 ], [ 15, 1 ], [ 24, 1 ], [ 21, -1 ] ], [ [ \
12, -1 ], [ 16, -1 ], [ 19, -1 ], [ 20, -1 ], [ 8, -1 ], [ 10, -1 ], [ 24, -1 ], [ 14, -1 ] ] ] )

gap> GetProperTriangleGroup(tmg) = tg;
true
gap> CellRelators(tmg);
[ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ]
gap> CellCenter(tmg) = 3;
true
gap> GetTGCell(tmg) = GetTGCell(cg);
true
gap> ModelType(tmg);
[ "TESS", [ 8, 3 ], [ "VEF", [ [ 2 ], [ 1 ], [ 3 ] ] ] ]
gap> ModelName(tmg);
"{8,3}-tess"
gap> ModelType(tmg);
[ "TESS", [ 8, 3 ], [ "VEF", [ [ 2 ], [ 1 ], [ 3 ] ] ] ]
gap> ModelName(tmg);
"{8,3}-tess"

gap> CellVertices(tmg);
[ [ 2, 1 ], [ 2, 2 ], [ 2, 3 ], [ 2, 4 ], [ 2, 5 ], [ 2, 6 ], [ 2, 7 ], [ 2, 8 ], [ 2, 9 ], [ 2, 10 ], [ 2, 11 ], [ 2, 12 ], [ 2, 13 ], [ 2, 14 ], [ 2, 15 ], [ 2, 16 ] ]
gap> CellVertexPositions(tmg);
[ <identity ...>, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^4*x^-1, (y^-1*x^-1)^3, 
  x*y*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (y^-1*x^-1)^5, x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^4 ]
gap> CellEdges(tmg);
[ [ 1, 2, [ 1, [ 1, 1, 9 ] ], <identity ...> ], [ 3, 1, [ 1, [ 2, 8, 16 ] ], <identity ...> ], [ 1, 4, [ 1, [ 3, 17, 32 ] ], <identity ...> ], 
  [ 2, 5, [ 1, [ 4, 2, 10 ] ], <identity ...> ], [ 2, 6, [ 1, [ 5, 18, 25 ] ], <identity ...> ], [ 7, 3, [ 1, [ 6, 7, 15 ] ], <identity ...> ], 
  [ 3, 8, [ 1, [ 7, 24, 31 ] ], <identity ...> ], [ 4, 9, [ 1, [ 8, 33, 45 ] ], g1 ], [ 5, 10, [ 1, [ 9, 3, 11 ] ], <identity ...> ], [ 11, 4, [ 1, [ 10, 36, 48 ] ], g4 ], 
  [ 5, 12, [ 1, [ 11, 19, 26 ] ], <identity ...> ], [ 13, 6, [ 1, [ 12, 37, 41 ] ], g1^-1 ], [ 14, 7, [ 1, [ 13, 6, 14 ] ], <identity ...> ], 
  [ 6, 15, [ 1, [ 14, 34, 46 ] ], g2 ], [ 7, 15, [ 1, [ 15, 23, 30 ] ], <identity ...> ], [ 8, 13, [ 1, [ 16, 40, 44 ] ], g4^-1 ], 
  [ 14, 9, [ 1, [ 17, 22, 29 ] ], <identity ...> ], [ 10, 16, [ 1, [ 18, 4, 12 ] ], <identity ...> ], [ 12, 8, [ 1, [ 19, 35, 47 ] ], g3 ], 
  [ 9, 12, [ 1, [ 20, 38, 42 ] ], g2^-1 ], [ 10, 11, [ 1, [ 21, 20, 27 ] ], <identity ...> ], [ 16, 13, [ 1, [ 22, 21, 28 ] ], <identity ...> ], 
  [ 16, 14, [ 1, [ 23, 5, 13 ] ], <identity ...> ], [ 15, 11, [ 1, [ 24, 39, 43 ] ], g3^-1 ] ]
gap> CellEdgeTranslations(tmg);
[ <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, g1, <identity ...>, g4, <identity ...>, g1^-1, 
  <identity ...>, g2, <identity ...>, g4^-1, <identity ...>, <identity ...>, g3, g2^-1, <identity ...>, <identity ...>, <identity ...>, g3^-1 ]
gap> CellFaces(tmg);
[ [ [ 1, 1 ], [ 4, 1 ], [ 9, 1 ], [ 18, 1 ], [ 23, 1 ], [ 13, 1 ], [ 6, 1 ], [ 2, 1 ] ], 
  [ [ 1, -1 ], [ 3, 1 ], [ 8, 1 ], [ 17, -1 ], [ 23, -1 ], [ 22, 1 ], [ 12, 1 ], [ 5, -1 ] ], [ [ 18, -1 ], [ 21, 1 ], 
      [ 10, 1 ], [ 3, -1 ], [ 2, -1 ], [ 7, 1 ], [ 16, 1 ], [ 22, -1 ] ], [ [ 4, -1 ], [ 5, 1 ], [ 14, 1 ], [ 15, -1 ], [ 13, -1 ], [ 17, 1 ], [ 20, 1 ], [ 11, -1 ] ], 
  [ [ 9, -1 ], [ 11, 1 ], [ 19, 1 ], [ 7, -1 ], [ 6, -1 ], [ 15, 1 ], [ 24, 1 ], [ 21, -1 ] ], 
  [ [ 12, -1 ], [ 16, -1 ], [ 19, -1 ], [ 20, -1 ], [ 8, -1 ], [ 10, -1 ], [ 24, -1 ], [ 14, -1 ] ] ]

gap> ImportTGCellModelGraphFromString(ExportString(tmg), tg) = tmg;
true

gap> AddOrientedNNNEdgesToTessellationModelGraph(tmg);;
gap> CellEdges(tmg);
[ [ 1, 2, [ 1, [ 1, 1, 9 ] ], <identity ...> ], [ 3, 1, [ 1, [ 2, 8, 16 ] ], <identity ...> ], 
  [ 1, 4, [ 1, [ 3, 17, 32 ] ], <identity ...> ], [ 2, 5, [ 1, [ 4, 2, 10 ] ], <identity ...> ], 
  [ 2, 6, [ 1, [ 5, 18, 25 ] ], <identity ...> ], [ 7, 3, [ 1, [ 6, 7, 15 ] ], <identity ...> ], 
  [ 3, 8, [ 1, [ 7, 24, 31 ] ], <identity ...> ], [ 4, 9, [ 1, [ 8, 33, 45 ] ], g1 ], 
  [ 5, 10, [ 1, [ 9, 3, 11 ] ], <identity ...> ], [ 11, 4, [ 1, [ 10, 36, 48 ] ], g4 ], 
  [ 5, 12, [ 1, [ 11, 19, 26 ] ], <identity ...> ], [ 13, 6, [ 1, [ 12, 37, 41 ] ], g1^-1 ], 
  [ 14, 7, [ 1, [ 13, 6, 14 ] ], <identity ...> ], [ 6, 15, [ 1, [ 14, 34, 46 ] ], g2 ], 
  [ 7, 15, [ 1, [ 15, 23, 30 ] ], <identity ...> ], [ 8, 13, [ 1, [ 16, 40, 44 ] ], g4^-1 ], 
  [ 14, 9, [ 1, [ 17, 22, 29 ] ], <identity ...> ], [ 10, 16, [ 1, [ 18, 4, 12 ] ], <identity ...> ], 
  [ 12, 8, [ 1, [ 19, 35, 47 ] ], g3 ], [ 9, 12, [ 1, [ 20, 38, 42 ] ], g2^-1 ], 
  [ 10, 11, [ 1, [ 21, 20, 27 ] ], <identity ...> ], [ 16, 13, [ 1, [ 22, 21, 28 ] ], <identity ...> ], 
  [ 16, 14, [ 1, [ 23, 5, 13 ] ], <identity ...> ], [ 15, 11, [ 1, [ 24, 39, 43 ] ], g3^-1 ], 
  [ 1, 5, [ 2, [ 1, 1, 4 ] ], <identity ...> ], [ 2, 10, [ 2, [ 1, 4, 9 ] ], <identity ...> ], 
  [ 5, 16, [ 2, [ 1, 9, 18 ] ], <identity ...> ], [ 10, 14, [ 2, [ 1, 18, 23 ] ], <identity ...> ], 
  [ 16, 7, [ 2, [ 1, 23, 13 ] ], <identity ...> ], [ 14, 3, [ 2, [ 1, 13, 6 ] ], <identity ...> ], 
  [ 7, 1, [ 2, [ 1, 6, 2 ] ], <identity ...> ], [ 3, 2, [ 2, [ 1, 2, 1 ] ], <identity ...> ], 
  [ 2, 4, [ 2, [ 2, 1, 3 ] ], <identity ...> ], [ 1, 9, [ 2, [ 2, 3, 8 ] ], g1 ], 
  [ 4, 14, [ 2, [ 2, 8, 17 ] ], g1 ], [ 9, 16, [ 2, [ 2, 17, 23 ] ], <identity ...> ], 
  [ 14, 13, [ 2, [ 2, 23, 22 ] ], <identity ...> ], [ 16, 6, [ 2, [ 2, 22, 12 ] ], g1^-1 ], 
  [ 13, 2, [ 2, [ 2, 12, 5 ] ], g1^-1 ], [ 6, 1, [ 2, [ 2, 5, 1 ] ], <identity ...> ], 
  [ 16, 11, [ 2, [ 3, 18, 21 ] ], <identity ...> ], [ 10, 4, [ 2, [ 3, 21, 10 ] ], g4 ], 
  [ 11, 1, [ 2, [ 3, 10, 3 ] ], g4 ], [ 4, 3, [ 2, [ 3, 3, 2 ] ], <identity ...> ], 
  [ 1, 8, [ 2, [ 3, 2, 7 ] ], <identity ...> ], [ 3, 13, [ 2, [ 3, 7, 16 ] ], g4^-1 ], 
  [ 8, 16, [ 2, [ 3, 16, 22 ] ], g4^-1 ], [ 13, 10, [ 2, [ 3, 22, 18 ] ], <identity ...> ], 
  [ 5, 6, [ 2, [ 4, 4, 5 ] ], <identity ...> ], [ 2, 15, [ 2, [ 4, 5, 14 ] ], g2 ], 
  [ 6, 7, [ 2, [ 4, 14, 15 ] ], g2 ], [ 15, 14, [ 2, [ 4, 15, 13 ] ], <identity ...> ], 
  [ 7, 9, [ 2, [ 4, 13, 17 ] ], <identity ...> ], [ 14, 12, [ 2, [ 4, 17, 20 ] ], g2^-1 ], 
  [ 9, 5, [ 2, [ 4, 20, 11 ] ], g2^-1 ], [ 12, 2, [ 2, [ 4, 11, 4 ] ], <identity ...> ], 
  [ 10, 12, [ 2, [ 5, 9, 11 ] ], <identity ...> ], [ 5, 8, [ 2, [ 5, 11, 19 ] ], g3 ], 
  [ 12, 3, [ 2, [ 5, 19, 7 ] ], g3 ], [ 8, 7, [ 2, [ 5, 7, 6 ] ], <identity ...> ], 
  [ 3, 15, [ 2, [ 5, 6, 15 ] ], <identity ...> ], [ 7, 11, [ 2, [ 5, 15, 24 ] ], g3^-1 ], 
  [ 15, 10, [ 2, [ 5, 24, 21 ] ], g3^-1 ], [ 11, 5, [ 2, [ 5, 21, 9 ] ], <identity ...> ], 
  [ 6, 8, [ 2, [ 6, 12, 16 ] ], g4*g1 ], [ 13, 12, [ 2, [ 6, 16, 19 ] ], g3^-1*g4 ], 
  [ 8, 9, [ 2, [ 6, 19, 20 ] ], g2*g3^-1 ], [ 12, 4, [ 2, [ 6, 20, 8 ] ], g1^-1*g2 ], 
  [ 9, 11, [ 2, [ 6, 8, 10 ] ], g4^-1*g1^-1 ], [ 4, 15, [ 2, [ 6, 10, 24 ] ], g3*g4^-1 ], 
  [ 11, 6, [ 2, [ 6, 24, 14 ] ], g2^-1*g3 ], [ 15, 13, [ 2, [ 6, 14, 12 ] ], g1*g2^-1 ] ]

gap> kmg := KagomeModelGraph(cg : simplify := 5);
TGCellModelGraph( TGCell( ProperTriangleGroup(2, 3, 8), [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ] ), center = 3, type = [ "KAGOME", 8, [ "VEF", [ [ 1 ], [ 2 ], [ 2, 3 ] ] ] ], vert\
ices = [ [ 1, 1 ], [ 1, 2 ], [ 1, 3 ], [ 1, 4 ], [ 1, 5 ], [ 1, 6 ], [ 1, 7 ], [ 1, 8 ], [ 1, 9 ], [ 1, 10 ], [ 1, 11 ], [ 1, 12 ], [ 1, 13 ], [ 1, 14 ], [ 1, 15 ], [ 1, 16 ], \
[ 1, 17 ], [ 1, 18 ], [ 1, 19 ], [ 1, 20 ], [ 1, 21 ], [ 1, 22 ], [ 1, 23 ], [ 1, 24 ] ], edges = [ [ 1, 2, [ 1, [ 1, 1, 16 ] ], <identity ...> ], [ 1, 3, [ 1, [ 1, 1, 17 ] ], \
<identity ...> ], [ 2, 3, [ 1, [ 1, 16, 17 ] ], <identity ...> ], [ 4, 1, [ 1, [ 2, 2, 9 ] ], <identity ...> ], [ 4, 5, [ 1, [ 2, 2, 18 ] ], <identity ...> ], [ 1, 5, [ 1, [ 2,\
 9, 18 ] ], <identity ...> ], [ 2, 6, [ 1, [ 3, 8, 15 ] ], <identity ...> ], [ 2, 7, [ 1, [ 3, 8, 24 ] ], <identity ...> ], [ 6, 7, [ 1, [ 3, 15, 24 ] ], <identity ...> ], [ 3,\
 8, [ 1, [ 4, 32, 33 ] ], <identity ...> ], [ 3, 10, [ 1, [ 4, 32, 48 ] ], g4^-1 ], [ 8, 10, [ 1, [ 4, 33, 48 ] ], g4^-1 ], [ 9, 4, [ 1, [ 5, 3, 10 ] ], <identity ...> ], [ 9, \
11, [ 1, [ 5, 3, 19 ] ], <identity ...> ], [ 4, 11, [ 1, [ 5, 10, 19 ] ], <identity ...> ], [ 5, 14, [ 1, [ 6, 25, 34 ] ], <identity ...> ], [ 5, 12, [ 1, [ 6, 25, 41 ] ], g1 ]\
, [ 14, 12, [ 1, [ 6, 34, 41 ] ], g1 ], [ 6, 13, [ 1, [ 7, 7, 14 ] ], <identity ...> ], [ 6, 15, [ 1, [ 7, 7, 23 ] ], <identity ...> ], [ 13, 15, [ 1, [ 7, 14, 23 ] ], <identit\
y ...> ], [ 7, 16, [ 1, [ 8, 31, 40 ] ], <identity ...> ], [ 7, 19, [ 1, [ 8, 31, 47 ] ], g3^-1 ], [ 16, 19, [ 1, [ 8, 40, 47 ] ], g3^-1 ], [ 17, 20, [ 1, [ 9, 29, 38 ] ], <ide\
ntity ...> ], [ 17, 8, [ 1, [ 9, 29, 45 ] ], g1^-1 ], [ 20, 8, [ 1, [ 9, 38, 45 ] ], g1^-1 ], [ 18, 9, [ 1, [ 10, 4, 11 ] ], <identity ...> ], [ 18, 21, [ 1, [ 10, 4, 20 ] ], <\
identity ...> ], [ 9, 21, [ 1, [ 10, 11, 20 ] ], <identity ...> ], [ 21, 10, [ 1, [ 11, 27, 36 ] ], <identity ...> ], [ 21, 24, [ 1, [ 11, 27, 43 ] ], g3 ], [ 10, 24, [ 1, [ 11\
, 36, 43 ] ], g3 ], [ 11, 19, [ 1, [ 12, 26, 35 ] ], <identity ...> ], [ 11, 20, [ 1, [ 12, 26, 42 ] ], g2 ], [ 19, 20, [ 1, [ 12, 35, 42 ] ], g2 ], [ 22, 12, [ 1, [ 13, 28, 37\
 ] ], <identity ...> ], [ 22, 16, [ 1, [ 13, 28, 44 ] ], g4 ], [ 12, 16, [ 1, [ 13, 37, 44 ] ], g4 ], [ 13, 23, [ 1, [ 14, 6, 13 ] ], <identity ...> ], [ 13, 17, [ 1, [ 14, 6, \
22 ] ], <identity ...> ], [ 23, 17, [ 1, [ 14, 13, 22 ] ], <identity ...> ], [ 15, 24, [ 1, [ 15, 30, 39 ] ], <identity ...> ], [ 15, 14, [ 1, [ 15, 30, 46 ] ], g2^-1 ], [ 24, \
14, [ 1, [ 15, 39, 46 ] ], g2^-1 ], [ 23, 18, [ 1, [ 16, 5, 12 ] ], <identity ...> ], [ 23, 22, [ 1, [ 16, 5, 21 ] ], <identity ...> ], [ 18, 22, [ 1, [ 16, 12, 21 ] ], <identi\
ty ...> ] ], faces = [ [ [ 1, 1 ], [ 3, 1 ], [ 2, -1 ] ], [ [ 4, 1 ], [ 6, 1 ], [ 5, -1 ] ], [ [ 7, 1 ], [ 9, 1 ], [ 8, -1 ] ], [ [ 11, 1 ], [ 12, -1 ], [ 10, -1 ] ], [ [ 13, 1\
 ], [ 15, 1 ], [ 14, -1 ] ], [ [ 17, 1 ], [ 18, -1 ], [ 16, -1 ] ], [ [ 19, 1 ], [ 21, 1 ], [ 20, -1 ] ], [ [ 23, 1 ], [ 24, -1 ], [ 22, -1 ] ], [ [ 26, 1 ], [ 27, -1 ], [ 25, \
-1 ] ], [ [ 28, 1 ], [ 30, 1 ], [ 29, -1 ] ], [ [ 32, 1 ], [ 33, -1 ], [ 31, -1 ] ], [ [ 35, 1 ], [ 36, -1 ], [ 34, -1 ] ], [ [ 38, 1 ], [ 39, -1 ], [ 37, -1 ] ], [ [ 40, 1 ], \
[ 42, 1 ], [ 41, -1 ] ], [ [ 44, 1 ], [ 45, -1 ], [ 43, -1 ] ], [ [ 46, 1 ], [ 48, 1 ], [ 47, -1 ] ], [ [ 1, -1 ], [ 4, -1 ], [ 13, -1 ], [ 28, -1 ], [ 46, -1 ], [ 40, -1 ], [ \
19, -1 ], [ 7, -1 ] ], [ [ 6, -1 ], [ 2, 1 ], [ 10, 1 ], [ 26, -1 ], [ 42, -1 ], [ 47, 1 ], [ 37, 1 ], [ 17, -1 ] ], [ [ 48, -1 ], [ 29, 1 ], [ 31, 1 ], [ 11, -1 ], [ 3, -1 ], \
[ 8, 1 ], [ 22, 1 ], [ 38, -1 ] ], [ [ 15, -1 ], [ 5, 1 ], [ 16, 1 ], [ 44, -1 ], [ 21, -1 ], [ 41, 1 ], [ 25, 1 ], [ 35, -1 ] ], [ [ 30, -1 ], [ 14, 1 ], [ 34, 1 ], [ 23, -1 ]\
, [ 9, -1 ], [ 20, 1 ], [ 43, 1 ], [ 32, -1 ] ], [ [ 18, 1 ], [ 39, 1 ], [ 24, 1 ], [ 36, 1 ], [ 27, 1 ], [ 12, 1 ], [ 33, 1 ], [ 45, 1 ] ] ] )
gap> 
gap> GetProperTriangleGroup(kmg) = tg;
true
gap> CellRelators(kmg);
[ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ]
gap> CellCenter(kmg) = 3;
true
gap> GetTGCell(kmg) = GetTGCell(cg);
true
gap> ModelType(kmg);
[ "KAGOME", 8, [ "VEF", [ [ 1 ], [ 2 ], [ 2, 3 ] ] ] ]
gap> ModelName(kmg);
"8-kagome"
gap> ModelType(kmg);
[ "KAGOME", 8, [ "VEF", [ [ 1 ], [ 2 ], [ 2, 3 ] ] ] ]
gap> ModelName(kmg);
"8-kagome"

gap> CellVertices(kmg);
[ [ 1, 1 ], [ 1, 2 ], [ 1, 3 ], [ 1, 4 ], [ 1, 5 ], [ 1, 6 ], [ 1, 7 ], [ 1, 8 ], [ 1, 9 ], [ 1, 10 ], [ 1, 11 ], [ 1, 12 ], [ 1, 13 ], 
  [ 1, 14 ], [ 1, 15 ], [ 1, 16 ], [ 1, 17 ], [ 1, 18 ], [ 1, 19 ], [ 1, 20 ], [ 1, 21 ], [ 1, 22 ], [ 1, 23 ], [ 1, 24 ] ]
gap> CellVertexPositions(kmg);
[ <identity ...>, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, 
  y^-1*(y^-1*x^-1)^2, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3, 
  (y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^6 ]
gap> CellEdges(kmg);
[ [ 1, 2, [ 1, [ 1, 1, 16 ] ], <identity ...> ], [ 1, 3, [ 1, [ 1, 1, 17 ] ], <identity ...> ], [ 2, 3, [ 1, [ 1, 16, 17 ] ], <identity ...> ], 
  [ 4, 1, [ 1, [ 2, 2, 9 ] ], <identity ...> ], [ 4, 5, [ 1, [ 2, 2, 18 ] ], <identity ...> ], [ 1, 5, [ 1, [ 2, 9, 18 ] ], <identity ...> ], 
  [ 2, 6, [ 1, [ 3, 8, 15 ] ], <identity ...> ], [ 2, 7, [ 1, [ 3, 8, 24 ] ], <identity ...> ], [ 6, 7, [ 1, [ 3, 15, 24 ] ], <identity ...> ], 
  [ 3, 8, [ 1, [ 4, 32, 33 ] ], <identity ...> ], [ 3, 10, [ 1, [ 4, 32, 48 ] ], g4^-1 ], [ 8, 10, [ 1, [ 4, 33, 48 ] ], g4^-1 ], [ 9, 4, [ 1, [ 5, 3, 10 ] ], <identity ...> ],
  [ 9, 11, [ 1, [ 5, 3, 19 ] ], <identity ...> ], [ 4, 11, [ 1, [ 5, 10, 19 ] ], <identity ...> ], [ 5, 14, [ 1, [ 6, 25, 34 ] ], <identity ...> ], 
  [ 5, 12, [ 1, [ 6, 25, 41 ] ], g1 ], [ 14, 12, [ 1, [ 6, 34, 41 ] ], g1 ], [ 6, 13, [ 1, [ 7, 7, 14 ] ], <identity ...> ], [ 6, 15, [ 1, [ 7, 7, 23 ] ], <identity ...> ], 
  [ 13, 15, [ 1, [ 7, 14, 23 ] ], <identity ...> ], [ 7, 16, [ 1, [ 8, 31, 40 ] ], <identity ...> ], [ 7, 19, [ 1, [ 8, 31, 47 ] ], g3^-1 ], 
  [ 16, 19, [ 1, [ 8, 40, 47 ] ], g3^-1 ], [ 17, 20, [ 1, [ 9, 29, 38 ] ], <identity ...> ], [ 17, 8, [ 1, [ 9, 29, 45 ] ], g1^-1 ], [ 20, 8, [ 1, [ 9, 38, 45 ] ], g1^-1 ], 
  [ 18, 9, [ 1, [ 10, 4, 11 ] ], <identity ...> ], [ 18, 21, [ 1, [ 10, 4, 20 ] ], <identity ...> ], [ 9, 21, [ 1, [ 10, 11, 20 ] ], <identity ...> ], 
  [ 21, 10, [ 1, [ 11, 27, 36 ] ], <identity ...> ], [ 21, 24, [ 1, [ 11, 27, 43 ] ], g3 ], [ 10, 24, [ 1, [ 11, 36, 43 ] ], g3 ], 
  [ 11, 19, [ 1, [ 12, 26, 35 ] ], <identity ...> ], [ 11, 20, [ 1, [ 12, 26, 42 ] ], g2 ], [ 19, 20, [ 1, [ 12, 35, 42 ] ], g2 ], 
  [ 22, 12, [ 1, [ 13, 28, 37 ] ], <identity ...> ], [ 22, 16, [ 1, [ 13, 28, 44 ] ], g4 ], [ 12, 16, [ 1, [ 13, 37, 44 ] ], g4 ], 
  [ 13, 23, [ 1, [ 14, 6, 13 ] ], <identity ...> ], [ 13, 17, [ 1, [ 14, 6, 22 ] ], <identity ...> ], [ 23, 17, [ 1, [ 14, 13, 22 ] ], <identity ...> ], 
  [ 15, 24, [ 1, [ 15, 30, 39 ] ], <identity ...> ], [ 15, 14, [ 1, [ 15, 30, 46 ] ], g2^-1 ], [ 24, 14, [ 1, [ 15, 39, 46 ] ], g2^-1 ], 
  [ 23, 18, [ 1, [ 16, 5, 12 ] ], <identity ...> ], [ 23, 22, [ 1, [ 16, 5, 21 ] ], <identity ...> ], [ 18, 22, [ 1, [ 16, 12, 21 ] ], <identity ...> ] ]
gap> CellEdgeTranslations(kmg);
[ <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, <identity ...>, g4^-1, g4^-1, 
  <identity ...>, <identity ...>, <identity ...>, <identity ...>, g1, g1, <identity ...>, <identity ...>, <identity ...>, <identity ...>, g3^-1, g3^-1, <identity ...>, g1^-1, 
  g1^-1, <identity ...>, <identity ...>, <identity ...>, <identity ...>, g3, g3, <identity ...>, g2, g2, <identity ...>, g4, g4, <identity ...>, <identity ...>, 
  <identity ...>, <identity ...>, g2^-1, g2^-1, <identity ...>, <identity ...>, <identity ...> ]
gap> CellFaces(kmg);
[ [ [ 1, 1 ], [ 3, 1 ], [ 2, -1 ] ], [ [ 4, 1 ], [ 6, 1 ], [ 5, -1 ] ], [ [ 7, 1 ], [ 9, 1 ], [ 8, -1 ] ], [ [ 11, 1 ], [ 12, -1 ], [ 10, -1 ] ], 
  [ [ 13, 1 ], [ 15, 1 ], [ 14, -1 ] ], [ [ 17, 1 ], [ 18, -1 ], [ 16, -1 ] ], [ [ 19, 1 ], [ 21, 1 ], [ 20, -1 ] ], [ [ 23, 1 ], [ 24, -1 ], [ 22, -1 ] ], 
  [ [ 26, 1 ], [ 27, -1 ], [ 25, -1 ] ], [ [ 28, 1 ], [ 30, 1 ], [ 29, -1 ] ], [ [ 32, 1 ], [ 33, -1 ], [ 31, -1 ] ], [ [ 35, 1 ], [ 36, -1 ], [ 34, -1 ] ], 
  [ [ 38, 1 ], [ 39, -1 ], [ 37, -1 ] ], [ [ 40, 1 ], [ 42, 1 ], [ 41, -1 ] ], [ [ 44, 1 ], [ 45, -1 ], [ 43, -1 ] ], [ [ 46, 1 ], [ 48, 1 ], [ 47, -1 ] ], 
  [ [ 1, -1 ], [ 4, -1 ], [ 13, -1 ], [ 28, -1 ], [ 46, -1 ], [ 40, -1 ], [ 19, -1 ], [ 7, -1 ] ], [ [ 6, -1 ], [ 2, 1 ], [ 10, 1 ], [ 26, -1 ], [ 42, -1 ], [ 47, 1 ], 
      [ 37, 1 ], [ 17, -1 ] ], [ [ 48, -1 ], [ 29, 1 ], [ 31, 1 ], [ 11, -1 ], [ 3, -1 ], [ 8, 1 ], [ 22, 1 ], [ 38, -1 ] ], 
  [ [ 15, -1 ], [ 5, 1 ], [ 16, 1 ], [ 44, -1 ], [ 21, -1 ], [ 41, 1 ], [ 25, 1 ], [ 35, -1 ] ], 
  [ [ 30, -1 ], [ 14, 1 ], [ 34, 1 ], [ 23, -1 ], [ 9, -1 ], [ 20, 1 ], [ 43, 1 ], [ 32, -1 ] ], [ [ 18, 1 ], 
      [ 39, 1 ], [ 24, 1 ], [ 36, 1 ], [ 27, 1 ], [ 12, 1 ], [ 33, 1 ], [ 45, 1 ] ] ]

gap> ImportTGCellModelGraphFromString(ExportString(kmg), tg) = kmg;
true

gap> sign := [ 2, 4, 6 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 2 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 0);;
gap> tmg := TessellationModelGraph(cg, false : simplify := 0);;
gap> AddOrientedNNNEdgesToTessellationModelGraph(tmg);;
gap> CellEdges(tmg);
[ [ 1, 2, [ 1, [ 1, 1, 7 ] ], <identity ...> ], 
  [ 3, 1, [ 1, [ 2, 6, 12 ] ], <identity ...> ], [ 1, 3, [ 1, [ 3, 13, 23 ] ], g1 ], 
  [ 2, 4, [ 1, [ 4, 2, 8 ] ], <identity ...> ], [ 4, 2, [ 1, [ 5, 15, 19 ] ], g3 ], 
  [ 2, 1, [ 1, [ 6, 14, 24 ] ], g2 ], [ 5, 3, [ 1, [ 7, 5, 11 ] ], <identity ...> ], 
  [ 3, 5, [ 1, [ 8, 18, 22 ] ], g4^-1*g2^-1 ], [ 4, 6, [ 1, [ 9, 3, 9 ] ], <identity ...> ],
  [ 6, 4, [ 1, [ 10, 16, 20 ] ], g4 ], [ 6, 5, [ 1, [ 11, 4, 10 ] ], <identity ...> ], 
  [ 5, 6, [ 1, [ 12, 17, 21 ] ], g3^-1*g1^-1 ], [ 1, 4, [ 2, [ 1, 1, 4 ] ], <identity ...> ]
    , [ 2, 6, [ 2, [ 1, 4, 9 ] ], <identity ...> ], 
  [ 4, 5, [ 2, [ 1, 9, 11 ] ], <identity ...> ], 
  [ 6, 3, [ 2, [ 1, 11, 7 ] ], <identity ...> ], 
  [ 5, 1, [ 2, [ 1, 7, 2 ] ], <identity ...> ], [ 3, 2, [ 2, [ 1, 2, 1 ] ], <identity ...> ]
    , [ 2, 3, [ 2, [ 2, 1, 3 ] ], g1 ], [ 1, 5, [ 2, [ 2, 3, 7 ] ], g1 ], 
  [ 3, 6, [ 2, [ 2, 7, 12 ] ], g3^-1*g1^-1 ], [ 5, 4, [ 2, [ 2, 12, 9 ] ], g3^-1*g1^-1 ], 
  [ 6, 2, [ 2, [ 2, 9, 5 ] ], g3 ], [ 4, 1, [ 2, [ 2, 5, 1 ] ], g3 ], 
  [ 4, 1, [ 2, [ 3, 4, 6 ] ], g2 ], [ 2, 3, [ 2, [ 3, 6, 2 ] ], g2 ], 
  [ 1, 5, [ 2, [ 3, 2, 8 ] ], g4^-1*g2^-1 ], [ 3, 6, [ 2, [ 3, 8, 11 ] ], g4^-1*g2^-1 ], 
  [ 5, 4, [ 2, [ 3, 11, 10 ] ], g4 ], [ 6, 2, [ 2, [ 3, 10, 4 ] ], g4 ], 
  [ 2, 6, [ 2, [ 4, 5, 10 ] ], g4^-1*g3^-1 ], [ 4, 5, [ 2, [ 4, 10, 12 ] ], g1*g3*g4^-1 ], 
  [ 6, 3, [ 2, [ 4, 12, 8 ] ], g2*g4*g1*g3 ], [ 5, 1, [ 2, [ 4, 8, 3 ] ], g1^-1*g2*g4 ], 
  [ 3, 2, [ 2, [ 4, 3, 6 ] ], g2^-1*g1^-1 ], [ 1, 4, [ 2, [ 4, 6, 5 ] ], g3^-1*g2^-1 ] ]

# Additional models
gap> ExportString(TessellationModelGraph(TGCellGraph(ProperTriangleGroup([ 2, 8, 8 ]), TGQuotient([ 3, 11 ]), 3 : simplify := 0), true : simplify := 0));
"[ 2, 8, 8 ]\n[ [ x^2, x*y*z, x*z*y, y^-8 ], 3 ]\n[ g1, g2, g3, g4, g5, g6 ] -> [ z*y*x^-1, y*x*z, (z^-1*x^-1)^2*y^-1*x*z, z^-1*x^-1*y^2*x*z*y^-1*x*z, z^-1*x^-1*y*(x*z)^2*x*y^-\
3*z^-1*y*z*y*z^-1, z^-1*x^-1*y*z^-1*x^-1*y^-4*z*y*z^-1 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y\
^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1*x^-1, (y^-1*x^-1)\
^6, (y^-1*x^-1)^2, (y^-1*x^-1)^5, (y^-1*x^-1)^3, (y^-1*x^-1)^4 ], [ 1, y^-1*x^-1 ], [ 1, x^-1 ] ]\n[ \"TESS\", [ 8, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1 ], [ 3\
, 2 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 9 ] ] ], [ 1, 2, [ 1, [ 2, 8, 16 ] ] ], [ 1, 2, [ 1, [ 3, 2, 10 ] ] ], [ 1, 2, [ 1, [ 4, 7, 15 ] ] ], [ 1, 2, [ 1, [ 5, 3, 11 ] ] ], [ 1, 2, [ 1\
, [ 6, 6, 14 ] ] ], [ 1, 2, [ 1, [ 7, 4, 12 ] ] ], [ 1, 2, [ 1, [ 8, 5, 13 ] ] ] ]\n[ 1, g1^-1, g2, g1^-1*g2*g4*g5^-1*g4^-1*g3^-1*g2^-1*g1^-1*g2*g4*g6*g1*g3*g5, g2*g3, g1^-1*g2\
*g4*g6*g1*g3*g5, g2*g3*g4, g2*g3*g4*g5 ]\n[ [ [ 1, -1 ], [ 2, 1 ], [ 4, -1 ], [ 6, 1 ], [ 8, -1 ], [ 7, 1 ], [ 5, -1 ], [ 3, 1 ] ], [ [ 3, -1 ], [ 1, 1 ], [ 2, -1 ], [ 4, 1 ], \
[ 6, -1 ], [ 8, 1 ], [ 7, -1 ], [ 5, 1 ] ] ]"

gap> ExportString(TessellationModelGraph(TGCellGraph(ProperTriangleGroup([ 2, 8, 8 ]), TGQuotient([ 5, 13 ]), 3 : simplify := 0), true : simplify := 0));
"[ 2, 8, 8 ]\n[ [ x^2, x*y*z, x*y^-2*z^-1*y, x*z*y^-1*z^-2, y^8 ], 3 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ z^-2*x^-1*z*y^-1, z^-2*x^-1*y*x^-1*y^-1*x*y^-1*z, z^-2*\
x^-1*y*x^-1*y^-5*z*y^2*z*y*z^-1*x^-1*y*z^-1*x*z^2, z^2*y^-1*z^-4*(x^-1*y)^2*x*y^-1*x*z^2, z*y^-2*z^-1*y^5*x*y^-1*x*z^2, y^-1*z^2*y*z^-2, z^2*y^-1*z^-1*y^2*x^-1, z^2*y*(z^-1*y^-\
1*z^-1)^2*x^-1*z, y^-1*z^-1*y*x^-1*z^-1*x*z^2, y^3*x*y^-1*x*z^2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-\
1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, \
y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y*x^-1, y*x^-1*y^-1*x^-1, y*(x^-1*y^-1)^2*x^-1, y*(x^-1*y^-1)^3*x^-1, y*(x^-\
1*y^-1)^4*x^-1, y*(x^-1*y^-1)^5*x^-1, y*(x^-1*y^-1)^6*x^-1, y*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^6\
, y^-2*x^-1, y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^2, (y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^3 ], [ 1, y^-1*x^-1, (y^-1\
*x^-1)^3, (y^-1*x^-1)^2 ], [ 1, x^-1, x^-1*y^-1*x^-1, y*x^-1 ] ]\n[ \"TESS\", [ 8, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1 ], [ 3, 2 ], [ 3, 3 ], [ 3, 4 ] ]\n[ [ \
1, 2, [ 1, [ 1, 1, 9 ] ] ], [ 1, 3, [ 1, [ 2, 8, 16 ] ] ], [ 2, 4, [ 1, [ 3, 17, 27 ] ] ], [ 1, 3, [ 1, [ 4, 2, 10 ] ] ], [ 2, 4, [ 1, [ 5, 23, 25 ] ] ], [ 3, 4, [ 1, [ 6, 22, \
32 ] ] ], [ 1, 2, [ 1, [ 7, 7, 15 ] ] ], [ 3, 4, [ 1, [ 8, 18, 28 ] ] ], [ 3, 4, [ 1, [ 9, 24, 26 ] ] ], [ 1, 2, [ 1, [ 10, 3, 11 ] ] ], [ 2, 4, [ 1, [ 11, 21, 31 ] ] ], [ 1, 3\
, [ 1, [ 12, 6, 14 ] ] ], [ 1, 3, [ 1, [ 13, 4, 12 ] ] ], [ 2, 4, [ 1, [ 14, 19, 29 ] ] ], [ 1, 2, [ 1, [ 15, 5, 13 ] ] ], [ 3, 4, [ 1, [ 16, 20, 30 ] ] ] ]\n[ 1, g2^-1*g4^-1*g\
6^-1, g1^-1*g3^-1*g5^-1*g8*g2^-1*g4^-1*g6^-1*g9*g1, 1, 1, g7^-1*g4*g2, g1^-1*g3^-1*g5^-1, g1^-1*g3^-1*g5^-1*g8*g2^-1*g4^-1*g6^-1*g9*g1*g10*g2, g1^-1*g3^-1*g5^-1*g8, g1^-1, g7^-\
1*g6^-1*g10*g3*g1, g2^-1*g4^-1, g2^-1, g7^-1*g6^-1*g10*g5^-1*g9*g4^-1*g8*g1, g1^-1*g8^-1*g4*g9^-1*g5*g10^-1*g6*g7*g1^-1*g3^-1*g5^-1*g8*g2^-1*g4^-1*g6^-1*g9*g1*g10*g2*g7^-1, g7^\
-1*g6^-1*g10*g5^-1*g9*g2 ]\n[ [ [ 1, -1 ], [ 2, 1 ], [ 6, 1 ], [ 11, -1 ], [ 15, -1 ], [ 13, 1 ], [ 8, 1 ], [ 3, -1 ] ], [ [ 4, -1 ], [ 1, 1 ], [ 5, 1 ], [ 6, -1 ], [ 12, -1 ],\
 [ 15, 1 ], [ 14, 1 ], [ 8, -1 ] ], [ [ 13, -1 ], [ 10, 1 ], [ 3, 1 ], [ 9, -1 ], [ 2, -1 ], [ 7, 1 ], [ 11, 1 ], [ 16, -1 ] ], [ [ 10, -1 ], [ 4, 1 ], [ 9, 1 ], [ 5, -1 ], [ 7\
, -1 ], [ 12, 1 ], [ 16, 1 ], [ 14, -1 ] ] ]"

gap> ExportString(TessellationModelGraph(TGCellGraph(ProperTriangleGroup([ 2, 3, 8 ]), TGQuotient([ 3, 2 ]), 3 : simplify := 0), false : simplify := 0));
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z^-4*x*y*z^-3, z*y*x*(z*y^-1)^2*z^-1*x ], 3 ]\n[ g1, g2, g3, g4, g5, g6 ] -> [ z*y^-1*z^-1*x*z*y*x^-1*z*y^-1, y^-1*z^-1*x*(z*y*x^-1)^2, y*x*y\
^-1*z^-1*x*z*y*x^-1*z, x*z*y^-1*z^-1*x*z*y*x^-1*z^2, z^-1*x*y^-1*z^-1*x^-1*z*y*x^-1*z^-1*x*y^-1*z^-1*x^-1*z^-2*x*z^2*y*z^-1*y^-1*z^-1*x*z*y*x^-1*z^2, z^-1*x*y^-1*z^-1*x^-1*z*y*\
z*y^-1*z^-1*x*z*y*x^-1*z*x*y^-1*z^-1*x^-1*z*y*z^-1 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*\
x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^\
-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y\
^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*\
x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^2*(x^-\
1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^\
-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*\
y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^\
-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1,\
 ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^3\
*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)\
^3*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x\
^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1\
, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*\
x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y\
)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-\
1)^5*x^-1, y^-1*(y^-1*x^-1)^3, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, (x*y)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, (y^-1*x^-1)^4, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^\
2*x^-1*y^-1*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*x*y*(x^-1*y^-1)^4*x\
^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y^\
-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1\
*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y\
^-1*x^-1 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^3, x*\
y*x*y*(x^-1*y^-1)^7*x^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5\
*x^-1, (y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^2*(x^-\
1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1 ]\
, [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4\
*x^-1, (y*x)^3*y*x^-1 ] ]\n[ \"TESS\", [ 8, 3 ], [ \"VEF\", [ [ 2 ], [ 1 ], [ 3 ] ] ] ]\n[ [ 2, 1 ], [ 2, 2 ], [ 2, 3 ], [ 2, 4 ], [ 2, 5 ], [ 2, 6 ], [ 2, 7 ], [ 2, 8 ], [ 2, \
9 ], [ 2, 10 ], [ 2, 11 ], [ 2, 12 ], [ 2, 13 ], [ 2, 14 ], [ 2, 15 ], [ 2, 16 ], [ 2, 17 ], [ 2, 18 ], [ 2, 19 ], [ 2, 20 ], [ 2, 21 ], [ 2, 22 ], [ 2, 23 ], [ 2, 24 ], [ 2, 2\
5 ], [ 2, 26 ], [ 2, 27 ], [ 2, 28 ], [ 2, 29 ], [ 2, 30 ], [ 2, 31 ], [ 2, 32 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 9 ] ] ], [ 3, 1, [ 1, [ 2, 8, 16 ] ] ], [ 1, 4, [ 1, [ 3, 17, 32 ] ] \
], [ 2, 5, [ 1, [ 4, 2, 10 ] ] ], [ 2, 6, [ 1, [ 5, 18, 25 ] ] ], [ 7, 3, [ 1, [ 6, 7, 15 ] ] ], [ 3, 8, [ 1, [ 7, 24, 31 ] ] ], [ 4, 9, [ 1, [ 8, 33, 57 ] ] ], [ 5, 10, [ 1, [\
 9, 3, 11 ] ] ], [ 11, 4, [ 1, [ 10, 48, 56 ] ] ], [ 5, 12, [ 1, [ 11, 19, 26 ] ] ], [ 13, 6, [ 1, [ 12, 41, 49 ] ] ], [ 14, 7, [ 1, [ 13, 6, 14 ] ] ], [ 6, 15, [ 1, [ 14, 34, \
58 ] ] ], [ 7, 16, [ 1, [ 15, 23, 30 ] ] ], [ 8, 17, [ 1, [ 16, 40, 64 ] ] ], [ 9, 18, [ 1, [ 17, 65, 78 ] ] ], [ 10, 19, [ 1, [ 18, 4, 12 ] ] ], [ 15, 8, [ 1, [ 19, 47, 55 ] ]\
 ], [ 9, 16, [ 1, [ 20, 46, 54 ] ] ], [ 10, 20, [ 1, [ 21, 20, 27 ] ] ], [ 11, 21, [ 1, [ 22, 67, 80 ] ] ], [ 22, 12, [ 1, [ 23, 42, 50 ] ] ], [ 13, 23, [ 1, [ 24, 68, 73 ] ] ]\
, [ 19, 14, [ 1, [ 25, 5, 13 ] ] ], [ 12, 11, [ 1, [ 26, 35, 59 ] ] ], [ 20, 13, [ 1, [ 27, 36, 60 ] ] ], [ 14, 24, [ 1, [ 28, 22, 29 ] ] ], [ 15, 25, [ 1, [ 29, 66, 79 ] ] ], \
[ 16, 26, [ 1, [ 30, 39, 63 ] ] ], [ 17, 27, [ 1, [ 31, 72, 77 ] ] ], [ 18, 23, [ 1, [ 32, 81, 89 ] ] ], [ 17, 24, [ 1, [ 33, 45, 53 ] ] ], [ 28, 18, [ 1, [ 34, 86, 94 ] ] ], [\
 19, 29, [ 1, [ 35, 21, 28 ] ] ], [ 30, 20, [ 1, [ 36, 43, 51 ] ] ], [ 27, 21, [ 1, [ 37, 88, 96 ] ] ], [ 22, 31, [ 1, [ 38, 69, 74 ] ] ], [ 21, 28, [ 1, [ 39, 83, 91 ] ] ], [ \
29, 22, [ 1, [ 40, 37, 61 ] ] ], [ 23, 32, [ 1, [ 41, 84, 92 ] ] ], [ 24, 30, [ 1, [ 42, 38, 62 ] ] ], [ 25, 31, [ 1, [ 43, 82, 90 ] ] ], [ 26, 32, [ 1, [ 44, 71, 76 ] ] ], [ 3\
2, 25, [ 1, [ 45, 87, 95 ] ] ], [ 26, 29, [ 1, [ 46, 44, 52 ] ] ], [ 31, 27, [ 1, [ 47, 85, 93 ] ] ], [ 30, 28, [ 1, [ 48, 70, 75 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, g1, 1, 1, 1, 1\
, 1, g2, 1, g6^-1*g4^-1*g2^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g3, g4, 1, 1, g5^-1*g3^-1*g1^-1, 1, g1^-1, 1, g6^-1, 1, 1, g2*g4*g6, 1, g3^-1, g5, g4^-1, g6, g2^-1, 1, g1*g3*g5, 1, g\
5^-1, 1 ]\n[ [ [ 1, 1 ], [ 4, 1 ], [ 9, 1 ], [ 18, 1 ], [ 25, 1 ], [ 13, 1 ], [ 6, 1 ], [ 2, 1 ] ], [ [ 1, -1 ], [ 3, 1 ], [ 8, 1 ], [ 17, 1 ], [ 32, 1 ], [ 24, -1 ], [ 12, 1 ]\
, [ 5, -1 ] ], [ [ 2, -1 ], [ 7, 1 ], [ 16, 1 ], [ 31, 1 ], [ 37, 1 ], [ 22, -1 ], [ 10, 1 ], [ 3, -1 ] ], [ [ 4, -1 ], [ 5, 1 ], [ 14, 1 ], [ 29, 1 ], [ 43, 1 ], [ 38, -1 ], [\
 23, 1 ], [ 11, -1 ] ], [ [ 6, -1 ], [ 15, 1 ], [ 30, 1 ], [ 44, 1 ], [ 45, 1 ], [ 29, -1 ], [ 19, 1 ], [ 7, -1 ] ], [ [ 23, -1 ], [ 40, -1 ], [ 46, -1 ], [ 30, -1 ], [ 20, -1 \
], [ 8, -1 ], [ 10, -1 ], [ 26, -1 ] ], [ [ 9, -1 ], [ 11, 1 ], [ 26, 1 ], [ 22, 1 ], [ 39, 1 ], [ 48, -1 ], [ 36, 1 ], [ 21, -1 ] ], [ [ 12, -1 ], [ 27, -1 ], [ 36, -1 ], [ 42\
, -1 ], [ 33, -1 ], [ 16, -1 ], [ 19, -1 ], [ 14, -1 ] ], [ [ 13, -1 ], [ 28, 1 ], [ 42, 1 ], [ 48, 1 ], [ 34, 1 ], [ 17, -1 ], [ 20, 1 ], [ 15, -1 ] ], [ [ 18, -1 ], [ 21, 1 ]\
, [ 27, 1 ], [ 24, 1 ], [ 41, 1 ], [ 44, -1 ], [ 46, 1 ], [ 35, -1 ] ], [ [ 25, -1 ], [ 35, 1 ], [ 40, 1 ], [ 38, 1 ], [ 47, 1 ], [ 31, -1 ], [ 33, 1 ], [ 28, -1 ] ], [ [ 32, -\
1 ], [ 34, -1 ], [ 39, -1 ], [ 37, -1 ], [ 47, -1 ], [ 43, -1 ], [ 45, -1 ], [ 41, -1 ] ] ]"

gap> ExportString(TessellationModelGraph(TGCellGraph(ProperTriangleGroup([ 2, 3, 8 ]), TGQuotient([ 5, 1 ]), 3 : simplify := 0), false : simplify := 0));
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z^8, z^3*y*z^-1*x*z*y^-1*x*y^-1*z^-2*x ], 3 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ z^-3*x*z*y^-1*z^-3*x^-1*z*y^-1, z^2*y^-1*z^-2\
*x*z^3*y*z^-1*x^-1, z*y^-1*z^-2*x*z^3*y*z^-1*x^-1*z, y^-1*z^-2*x*z^3*y*z^-1*x^-1*z^2, z*y^-1*z^-3*x*z^2*y*z^-2*x^-1, y^-1*z^-3*x*z^2*y*z^-2*x^-1*z, y*z^-2*x*z^2*y*z^-2*x^-1*z^2\
, x*y^-1*z^-2*x*z*(z^2*y)^2*z^-1*x^-1*z^3, z^-2*x*z^2*y^-1*z^-2*x^-1*z^2*y^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y*z^-1*y^-1*z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*x^-1*z^-1*x*z^3*y*z^-1*x^-1*z^3\
, z^-3*x*z*(y^-1*z^-2)^2*z^-1*x^-1*z^2*y*x^-1*z^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y^2*x*z*y^-1*z^-2*(z^-1*x^-1)^2*z^2*y*z^-2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^\
-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x\
^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^\
-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^\
-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^\
-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*\
(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1\
)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1\
*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x\
^-1, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1\
*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(x*y)^2*x^-1, y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y\
^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (x*y)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3\
*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^2*y*x^-1,\
 (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1,\
 (y*x)^2*y*(x^-1*y^-1)^7*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*(\
y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^2, y*(x^-1*y^-1)^2*y^-1*x^-1, y*x^-1*(y^-1*x^-1*y\
^-1)^2*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y*x^-1*y^-\
1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^\
-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x\
^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^\
-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*x^-1, x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1\
)^3*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^3*x\
^-1, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)\
^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^\
-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*x^-1, y^-1*x*y*(x^-1*y^-1)^2, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*x*y*x^-1*(y\
^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x*y*(x^-1*y^-1)^2*(y^-1\
*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^3, y*(x^-1*y^-1)^3*y^-1*x^-1, y*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x^-1\
*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, y*(x^-1*y^-1)^3*(y^-1*x^-1)^6, y*(x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*x^\
-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1\
*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, y^-1*x^-1*y^-1*x*y*(x^-1\
*y^-1)^2*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, \
y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*x*y*x^-1*y^-1*(x*y)^2*x^-1, y*\
x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y*x*y*\
x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1\
, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1\
*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, y^-1*(y^-1*x^-1)^3, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^\
2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, (y^-1*x^-1)^4, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^\
-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-\
1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*\
x^-1, (x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*x*y*(x^-1*y^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^2*x^-1*y^-\
1*x^-1, y^-1*(x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2\
*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)\
^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^\
2*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*(x*y)^2*(x\
^-1*y^-1)^5*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-\
1*y^-1)^3*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1\
*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, ((y^-1*x^-\
1)^2*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x*y)^3*(x^-1*y^-1\
)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*x^\
-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1\
 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^2, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^7*x\
^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, (x^-1*y^-1)^2*y^-1*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (y^-1*x^-1)^4, x*y*x*y*\
(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x^-1*(y^-1*x^-\
1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*(x^-1*y^-1\
)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^2*(x^-1*y^-1)^\
3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y\
^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*(y^-1*\
x^-1*y^-1)^2*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x*y*(x^-1*y^-1\
)^4*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^\
2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x\
*y)^2*(x^-1*y^-1)^5*x^-1 ], [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, y*x\
*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1*y^-1*x^-1, (y*x)^2*y*x^-1, (x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1\
*y^-1)^3*x^-1, (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^3*y*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, y*x\
*y*x^-1*y^-1*(x*y)^2*x^-1 ] ]\n[ \"TESS\", [ 8, 3 ], [ \"VEF\", [ [ 2 ], [ 1 ], [ 3 ] ] ] ]\n[ [ 2, 1 ], [ 2, 2 ], [ 2, 3 ], [ 2, 4 ], [ 2, 5 ], [ 2, 6 ], [ 2, 7 ], [ 2, 8 ], [\
 2, 9 ], [ 2, 10 ], [ 2, 11 ], [ 2, 12 ], [ 2, 13 ], [ 2, 14 ], [ 2, 15 ], [ 2, 16 ], [ 2, 17 ], [ 2, 18 ], [ 2, 19 ], [ 2, 20 ], [ 2, 21 ], [ 2, 22 ], [ 2, 23 ], [ 2, 24 ], [ \
2, 25 ], [ 2, 26 ], [ 2, 27 ], [ 2, 28 ], [ 2, 29 ], [ 2, 30 ], [ 2, 31 ], [ 2, 32 ], [ 2, 33 ], [ 2, 34 ], [ 2, 35 ], [ 2, 36 ], [ 2, 37 ], [ 2, 38 ], [ 2, 39 ], [ 2, 40 ], [ \
2, 41 ], [ 2, 42 ], [ 2, 43 ], [ 2, 44 ], [ 2, 45 ], [ 2, 46 ], [ 2, 47 ], [ 2, 48 ], [ 2, 49 ], [ 2, 50 ], [ 2, 51 ], [ 2, 52 ], [ 2, 53 ], [ 2, 54 ], [ 2, 55 ], [ 2, 56 ], [ \
2, 57 ], [ 2, 58 ], [ 2, 59 ], [ 2, 60 ], [ 2, 61 ], [ 2, 62 ], [ 2, 63 ], [ 2, 64 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 9 ] ] ], [ 3, 1, [ 1, [ 2, 8, 16 ] ] ], [ 1, 4, [ 1, [ 3, 17, 32 \
] ] ], [ 2, 5, [ 1, [ 4, 2, 10 ] ] ], [ 2, 6, [ 1, [ 5, 18, 25 ] ] ], [ 7, 3, [ 1, [ 6, 7, 15 ] ] ], [ 3, 8, [ 1, [ 7, 24, 31 ] ] ], [ 4, 9, [ 1, [ 8, 33, 57 ] ] ], [ 5, 10, [ \
1, [ 9, 3, 11 ] ] ], [ 11, 4, [ 1, [ 10, 48, 56 ] ] ], [ 5, 12, [ 1, [ 11, 19, 26 ] ] ], [ 13, 6, [ 1, [ 12, 41, 49 ] ] ], [ 14, 7, [ 1, [ 13, 6, 14 ] ] ], [ 6, 15, [ 1, [ 14, \
34, 58 ] ] ], [ 7, 16, [ 1, [ 15, 23, 30 ] ] ], [ 8, 17, [ 1, [ 16, 40, 64 ] ] ], [ 9, 18, [ 1, [ 17, 65, 113 ] ] ], [ 10, 19, [ 1, [ 18, 4, 12 ] ] ], [ 20, 8, [ 1, [ 19, 47, 5\
5 ] ] ], [ 21, 9, [ 1, [ 20, 97, 105 ] ] ], [ 10, 22, [ 1, [ 21, 20, 27 ] ] ], [ 23, 11, [ 1, [ 22, 88, 96 ] ] ], [ 24, 12, [ 1, [ 23, 42, 50 ] ] ], [ 25, 13, [ 1, [ 24, 81, 89\
 ] ] ], [ 19, 14, [ 1, [ 25, 5, 13 ] ] ], [ 11, 26, [ 1, [ 26, 80, 136 ] ] ], [ 12, 27, [ 1, [ 27, 35, 59 ] ] ], [ 13, 28, [ 1, [ 28, 73, 129 ] ] ], [ 14, 29, [ 1, [ 29, 22, 29\
 ] ] ], [ 15, 30, [ 1, [ 30, 66, 114 ] ] ], [ 16, 31, [ 1, [ 31, 39, 63 ] ] ], [ 17, 32, [ 1, [ 32, 72, 120 ] ] ], [ 18, 25, [ 1, [ 33, 121, 145 ] ] ], [ 33, 15, [ 1, [ 34, 98,\
 106 ] ] ], [ 34, 16, [ 1, [ 35, 46, 54 ] ] ], [ 35, 17, [ 1, [ 36, 104, 112 ] ] ], [ 36, 18, [ 1, [ 37, 139, 161 ] ] ], [ 19, 37, [ 1, [ 38, 21, 28 ] ] ], [ 38, 20, [ 1, [ 39,\
 87, 95 ] ] ], [ 39, 21, [ 1, [ 40, 76, 132 ] ] ], [ 40, 22, [ 1, [ 41, 43, 51 ] ] ], [ 32, 23, [ 1, [ 42, 128, 152 ] ] ], [ 41, 24, [ 1, [ 43, 82, 90 ] ] ], [ 20, 42, [ 1, [ 4\
4, 79, 135 ] ] ], [ 21, 43, [ 1, [ 45, 153, 172 ] ] ], [ 22, 44, [ 1, [ 46, 36, 60 ] ] ], [ 23, 45, [ 1, [ 47, 144, 166 ] ] ], [ 24, 46, [ 1, [ 48, 74, 130 ] ] ], [ 25, 47, [ 1\
, [ 49, 137, 167 ] ] ], [ 26, 48, [ 1, [ 50, 101, 109 ] ] ], [ 27, 49, [ 1, [ 51, 67, 115 ] ] ], [ 28, 50, [ 1, [ 52, 102, 110 ] ] ], [ 29, 50, [ 1, [ 53, 38, 62 ] ] ], [ 30, 4\
1, [ 1, [ 54, 122, 146 ] ] ], [ 31, 47, [ 1, [ 55, 71, 119 ] ] ], [ 26, 51, [ 1, [ 56, 157, 176 ] ] ], [ 52, 27, [ 1, [ 57, 99, 107 ] ] ], [ 28, 53, [ 1, [ 58, 158, 169 ] ] ], \
[ 54, 29, [ 1, [ 59, 45, 53 ] ] ], [ 55, 30, [ 1, [ 60, 140, 162 ] ] ], [ 46, 31, [ 1, [ 61, 103, 111 ] ] ], [ 41, 32, [ 1, [ 62, 138, 168 ] ] ], [ 54, 33, [ 1, [ 63, 77, 133 ]\
 ] ], [ 56, 34, [ 1, [ 64, 86, 94 ] ] ], [ 40, 35, [ 1, [ 65, 75, 131 ] ] ], [ 36, 40, [ 1, [ 66, 83, 91 ] ] ], [ 39, 37, [ 1, [ 67, 44, 52 ] ] ], [ 47, 38, [ 1, [ 68, 127, 151\
 ] ] ], [ 33, 57, [ 1, [ 69, 154, 173 ] ] ], [ 34, 52, [ 1, [ 70, 78, 134 ] ] ], [ 35, 58, [ 1, [ 71, 160, 171 ] ] ], [ 49, 36, [ 1, [ 72, 123, 147 ] ] ], [ 37, 48, [ 1, [ 73, \
37, 61 ] ] ], [ 38, 59, [ 1, [ 74, 143, 165 ] ] ], [ 55, 39, [ 1, [ 75, 84, 92 ] ] ], [ 42, 44, [ 1, [ 76, 100, 108 ] ] ], [ 43, 58, [ 1, [ 77, 177, 187 ] ] ], [ 44, 60, [ 1, [\
 78, 68, 116 ] ] ], [ 50, 45, [ 1, [ 79, 70, 118 ] ] ], [ 42, 61, [ 1, [ 80, 156, 175 ] ] ], [ 57, 43, [ 1, [ 81, 178, 188 ] ] ], [ 45, 56, [ 1, [ 82, 126, 150 ] ] ], [ 46, 62,\
 [ 1, [ 83, 159, 170 ] ] ], [ 48, 59, [ 1, [ 84, 69, 117 ] ] ], [ 63, 49, [ 1, [ 85, 141, 163 ] ] ], [ 53, 51, [ 1, [ 86, 182, 192 ] ] ], [ 62, 53, [ 1, [ 87, 183, 185 ] ] ], [\
 63, 54, [ 1, [ 88, 85, 93 ] ] ], [ 51, 61, [ 1, [ 89, 181, 191 ] ] ], [ 52, 64, [ 1, [ 90, 155, 174 ] ] ], [ 60, 55, [ 1, [ 91, 124, 148 ] ] ], [ 56, 60, [ 1, [ 92, 142, 164 ]\
 ] ], [ 58, 62, [ 1, [ 93, 184, 186 ] ] ], [ 64, 57, [ 1, [ 94, 179, 189 ] ] ], [ 59, 63, [ 1, [ 95, 125, 149 ] ] ], [ 61, 64, [ 1, [ 96, 180, 190 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, \
1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g1, 1, g2, 1, 1, 1, 1, 1, 1, 1, 1, g7, 1, 1, g1^-1, 1, 1, 1, g4^-1, g1, 1, g10^-1*g8^-1*g6^-1, g3, g5, 1, 1, 1, 1, 1, 1\
, g1^-1, 1, g2^-1, 1, g8, 1, g6, g2^-1, 1, g4, 1, 1, 1, g2, g3^-1, g4^-1, 1, 1, g9^-1*g7^-1*g5^-1, 1, 1, g7^-1*g1^-1, 1, 1, g4, g8^-1*g2^-1, 1, g3^-1, 1, g9, g6*g8*g10*g2, g5^-\
1*g3, 1, g5*g7*g9*g1, g3, 1, g10, g6^-1*g4, g9^-1*g3^-1, 1, g10^-1*g4^-1 ]\n[ [ [ 1, 1 ], [ 4, 1 ], [ 9, 1 ], [ 18, 1 ], [ 25, 1 ], [ 13, 1 ], [ 6, 1 ], [ 2, 1 ] ], [ [ 1, -1 ]\
, [ 3, 1 ], [ 8, 1 ], [ 17, 1 ], [ 33, 1 ], [ 24, 1 ], [ 12, 1 ], [ 5, -1 ] ], [ [ 2, -1 ], [ 7, 1 ], [ 16, 1 ], [ 32, 1 ], [ 42, 1 ], [ 22, 1 ], [ 10, 1 ], [ 3, -1 ] ], [ [ 4,\
 -1 ], [ 5, 1 ], [ 14, 1 ], [ 30, 1 ], [ 54, 1 ], [ 43, 1 ], [ 23, 1 ], [ 11, -1 ] ], [ [ 6, -1 ], [ 15, 1 ], [ 31, 1 ], [ 55, 1 ], [ 68, 1 ], [ 39, 1 ], [ 19, 1 ], [ 7, -1 ] ]\
, [ [ 67, -1 ], [ 40, 1 ], [ 20, 1 ], [ 8, -1 ], [ 10, -1 ], [ 26, 1 ], [ 50, 1 ], [ 73, -1 ] ], [ [ 9, -1 ], [ 11, 1 ], [ 27, 1 ], [ 51, 1 ], [ 72, 1 ], [ 66, 1 ], [ 41, 1 ], \
[ 21, -1 ] ], [ [ 12, -1 ], [ 28, 1 ], [ 52, 1 ], [ 53, -1 ], [ 59, -1 ], [ 63, 1 ], [ 34, 1 ], [ 14, -1 ] ], [ [ 13, -1 ], [ 29, 1 ], [ 53, 1 ], [ 79, 1 ], [ 82, 1 ], [ 64, 1 \
], [ 35, 1 ], [ 15, -1 ] ], [ [ 41, -1 ], [ 65, 1 ], [ 36, 1 ], [ 16, -1 ], [ 19, -1 ], [ 44, 1 ], [ 76, 1 ], [ 46, -1 ] ], [ [ 66, -1 ], [ 37, 1 ], [ 17, -1 ], [ 20, -1 ], [ 4\
5, 1 ], [ 77, 1 ], [ 71, -1 ], [ 65, -1 ] ], [ [ 18, -1 ], [ 21, 1 ], [ 46, 1 ], [ 78, 1 ], [ 91, 1 ], [ 75, 1 ], [ 67, 1 ], [ 38, -1 ] ], [ [ 22, -1 ], [ 47, 1 ], [ 79, -1 ], \
[ 52, -1 ], [ 58, 1 ], [ 86, 1 ], [ 56, -1 ], [ 26, -1 ] ], [ [ 23, -1 ], [ 48, 1 ], [ 61, 1 ], [ 31, -1 ], [ 35, -1 ], [ 70, 1 ], [ 57, 1 ], [ 27, -1 ] ], [ [ 24, -1 ], [ 49, \
1 ], [ 55, -1 ], [ 61, -1 ], [ 83, 1 ], [ 87, 1 ], [ 58, -1 ], [ 28, -1 ] ], [ [ 25, -1 ], [ 38, 1 ], [ 73, 1 ], [ 84, 1 ], [ 95, 1 ], [ 88, 1 ], [ 59, 1 ], [ 29, -1 ] ], [ [ 7\
5, -1 ], [ 60, 1 ], [ 30, -1 ], [ 34, -1 ], [ 69, 1 ], [ 81, 1 ], [ 45, -1 ], [ 40, -1 ] ], [ [ 43, -1 ], [ 62, 1 ], [ 32, -1 ], [ 36, -1 ], [ 71, 1 ], [ 93, 1 ], [ 83, -1 ], [\
 48, -1 ] ], [ [ 33, -1 ], [ 37, -1 ], [ 72, -1 ], [ 85, -1 ], [ 95, -1 ], [ 74, -1 ], [ 68, -1 ], [ 49, -1 ] ], [ [ 39, -1 ], [ 74, 1 ], [ 84, -1 ], [ 50, -1 ], [ 56, 1 ], [ 8\
9, 1 ], [ 80, -1 ], [ 44, -1 ] ], [ [ 54, -1 ], [ 60, -1 ], [ 91, -1 ], [ 92, -1 ], [ 82, -1 ], [ 47, -1 ], [ 42, -1 ], [ 62, -1 ] ], [ [ 88, -1 ], [ 85, 1 ], [ 51, -1 ], [ 57,\
 -1 ], [ 90, 1 ], [ 94, 1 ], [ 69, -1 ], [ 63, -1 ] ], [ [ 64, -1 ], [ 92, 1 ], [ 78, -1 ], [ 76, -1 ], [ 80, 1 ], [ 96, 1 ], [ 90, -1 ], [ 70, -1 ] ], [ [ 87, -1 ], [ 93, -1 ]\
, [ 77, -1 ], [ 81, -1 ], [ 94, -1 ], [ 96, -1 ], [ 89, -1 ], [ 86, -1 ] ] ]"

gap> ExportString(KagomeModelGraph(TGCellGraph(ProperTriangleGroup([ 2, 3, 8 ]), TGQuotient([ 3, 2 ]), 3 : simplify := 0) : simplify := 0));
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z^-4*x*y*z^-3, z*y*x*(z*y^-1)^2*z^-1*x ], 3 ]\n[ g1, g2, g3, g4, g5, g6 ] -> [ z*y^-1*z^-1*x*z*y*x^-1*z*y^-1, y^-1*z^-1*x*(z*y*x^-1)^2, y*x*y\
^-1*z^-1*x*z*y*x^-1*z, x*z*y^-1*z^-1*x*z*y*x^-1*z^2, z^-1*x*y^-1*z^-1*x^-1*z*y*x^-1*z^-1*x*y^-1*z^-1*x^-1*z^-2*x*z^2*y*z^-1*y^-1*z^-1*x*z*y*x^-1*z^2, z^-1*x*y^-1*z^-1*x^-1*z*y*\
z*y^-1*z^-1*x*z*y*x^-1*z*x*y^-1*z^-1*x^-1*z*y*z^-1 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*\
x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^\
-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y\
^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*\
x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^2*(x^-\
1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^\
-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*\
y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^\
-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1,\
 ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^3\
*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)\
^3*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x\
^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1\
, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*\
x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y\
)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-\
1)^5*x^-1, y^-1*(y^-1*x^-1)^3, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, (x*y)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, (y^-1*x^-1)^4, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^\
2*x^-1*y^-1*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*x*y*(x^-1*y^-1)^4*x\
^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y^\
-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1\
*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y\
^-1*x^-1 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^3, x*\
y*x*y*(x^-1*y^-1)^7*x^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5\
*x^-1, (y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^2*(x^-\
1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1 ]\
, [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4\
*x^-1, (y*x)^3*y*x^-1 ] ]\n[ \"KAGOME\", 8, [ \"VEF\", [ [ 1 ], [ 2 ], [ 2, 3 ] ] ] ]\n[ [ 1, 1 ], [ 1, 2 ], [ 1, 3 ], [ 1, 4 ], [ 1, 5 ], [ 1, 6 ], [ 1, 7 ], [ 1, 8 ], [ 1, 9 \
], [ 1, 10 ], [ 1, 11 ], [ 1, 12 ], [ 1, 13 ], [ 1, 14 ], [ 1, 15 ], [ 1, 16 ], [ 1, 17 ], [ 1, 18 ], [ 1, 19 ], [ 1, 20 ], [ 1, 21 ], [ 1, 22 ], [ 1, 23 ], [ 1, 24 ], [ 1, 25 \
], [ 1, 26 ], [ 1, 27 ], [ 1, 28 ], [ 1, 29 ], [ 1, 30 ], [ 1, 31 ], [ 1, 32 ], [ 1, 33 ], [ 1, 34 ], [ 1, 35 ], [ 1, 36 ], [ 1, 37 ], [ 1, 38 ], [ 1, 39 ], [ 1, 40 ], [ 1, 41 \
], [ 1, 42 ], [ 1, 43 ], [ 1, 44 ], [ 1, 45 ], [ 1, 46 ], [ 1, 47 ], [ 1, 48 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 16 ] ] ], [ 1, 3, [ 1, [ 1, 1, 17 ] ] ], [ 2, 3, [ 1, [ 1, 16, 17 ] ] ]\
, [ 4, 1, [ 1, [ 2, 2, 9 ] ] ], [ 4, 5, [ 1, [ 2, 2, 18 ] ] ], [ 1, 5, [ 1, [ 2, 9, 18 ] ] ], [ 2, 6, [ 1, [ 3, 8, 15 ] ] ], [ 2, 7, [ 1, [ 3, 8, 24 ] ] ], [ 6, 7, [ 1, [ 3, 15\
, 24 ] ] ], [ 3, 8, [ 1, [ 4, 32, 33 ] ] ], [ 3, 10, [ 1, [ 4, 32, 56 ] ] ], [ 8, 10, [ 1, [ 4, 33, 56 ] ] ], [ 9, 4, [ 1, [ 5, 3, 10 ] ] ], [ 9, 11, [ 1, [ 5, 3, 19 ] ] ], [ 4\
, 11, [ 1, [ 5, 10, 19 ] ] ], [ 5, 14, [ 1, [ 6, 25, 34 ] ] ], [ 5, 12, [ 1, [ 6, 25, 49 ] ] ], [ 14, 12, [ 1, [ 6, 34, 49 ] ] ], [ 6, 13, [ 1, [ 7, 7, 14 ] ] ], [ 6, 15, [ 1, \
[ 7, 7, 23 ] ] ], [ 13, 15, [ 1, [ 7, 14, 23 ] ] ], [ 7, 16, [ 1, [ 8, 31, 40 ] ] ], [ 7, 19, [ 1, [ 8, 31, 55 ] ] ], [ 16, 19, [ 1, [ 8, 40, 55 ] ] ], [ 20, 8, [ 1, [ 9, 46, 5\
7 ] ] ], [ 20, 17, [ 1, [ 9, 46, 65 ] ] ], [ 8, 17, [ 1, [ 9, 57, 65 ] ] ], [ 18, 9, [ 1, [ 10, 4, 11 ] ] ], [ 18, 21, [ 1, [ 10, 4, 20 ] ] ], [ 9, 21, [ 1, [ 10, 11, 20 ] ] ],\
 [ 10, 26, [ 1, [ 11, 48, 59 ] ] ], [ 10, 22, [ 1, [ 11, 48, 67 ] ] ], [ 26, 22, [ 1, [ 11, 59, 67 ] ] ], [ 11, 26, [ 1, [ 12, 26, 35 ] ] ], [ 11, 23, [ 1, [ 12, 26, 50 ] ] ], \
[ 26, 23, [ 1, [ 12, 35, 50 ] ] ], [ 12, 27, [ 1, [ 13, 41, 60 ] ] ], [ 12, 24, [ 1, [ 13, 41, 68 ] ] ], [ 27, 24, [ 1, [ 13, 60, 68 ] ] ], [ 13, 25, [ 1, [ 14, 6, 13 ] ] ], [ \
13, 28, [ 1, [ 14, 6, 22 ] ] ], [ 25, 28, [ 1, [ 14, 13, 22 ] ] ], [ 19, 14, [ 1, [ 15, 47, 58 ] ] ], [ 19, 29, [ 1, [ 15, 47, 66 ] ] ], [ 14, 29, [ 1, [ 15, 58, 66 ] ] ], [ 15\
, 30, [ 1, [ 16, 30, 39 ] ] ], [ 15, 20, [ 1, [ 16, 30, 54 ] ] ], [ 30, 20, [ 1, [ 16, 39, 54 ] ] ], [ 33, 16, [ 1, [ 17, 45, 64 ] ] ], [ 33, 31, [ 1, [ 17, 45, 72 ] ] ], [ 16,\
 31, [ 1, [ 17, 64, 72 ] ] ], [ 17, 32, [ 1, [ 18, 78, 81 ] ] ], [ 17, 34, [ 1, [ 18, 78, 94 ] ] ], [ 32, 34, [ 1, [ 18, 81, 94 ] ] ], [ 25, 18, [ 1, [ 19, 5, 12 ] ] ], [ 25, 3\
5, [ 1, [ 19, 5, 21 ] ] ], [ 18, 35, [ 1, [ 19, 12, 21 ] ] ], [ 21, 27, [ 1, [ 20, 27, 36 ] ] ], [ 21, 36, [ 1, [ 20, 27, 51 ] ] ], [ 27, 36, [ 1, [ 20, 36, 51 ] ] ], [ 22, 39,\
 [ 1, [ 21, 80, 83 ] ] ], [ 22, 37, [ 1, [ 21, 80, 96 ] ] ], [ 39, 37, [ 1, [ 21, 83, 96 ] ] ], [ 23, 40, [ 1, [ 22, 42, 61 ] ] ], [ 23, 38, [ 1, [ 22, 42, 69 ] ] ], [ 40, 38, \
[ 1, [ 22, 61, 69 ] ] ], [ 24, 41, [ 1, [ 23, 73, 84 ] ] ], [ 24, 32, [ 1, [ 23, 73, 89 ] ] ], [ 41, 32, [ 1, [ 23, 84, 89 ] ] ], [ 28, 42, [ 1, [ 24, 29, 38 ] ] ], [ 28, 33, [\
 1, [ 24, 29, 53 ] ] ], [ 42, 33, [ 1, [ 24, 38, 53 ] ] ], [ 29, 43, [ 1, [ 25, 79, 82 ] ] ], [ 29, 45, [ 1, [ 25, 79, 95 ] ] ], [ 43, 45, [ 1, [ 25, 82, 95 ] ] ], [ 46, 30, [ \
1, [ 26, 44, 63 ] ] ], [ 46, 44, [ 1, [ 26, 44, 71 ] ] ], [ 30, 44, [ 1, [ 26, 63, 71 ] ] ], [ 31, 37, [ 1, [ 27, 77, 88 ] ] ], [ 31, 47, [ 1, [ 27, 77, 93 ] ] ], [ 37, 47, [ 1\
, [ 27, 88, 93 ] ] ], [ 48, 34, [ 1, [ 28, 75, 86 ] ] ], [ 48, 39, [ 1, [ 28, 75, 91 ] ] ], [ 34, 39, [ 1, [ 28, 86, 91 ] ] ], [ 35, 40, [ 1, [ 29, 28, 37 ] ] ], [ 35, 46, [ 1,\
 [ 29, 28, 52 ] ] ], [ 40, 46, [ 1, [ 29, 37, 52 ] ] ], [ 36, 42, [ 1, [ 30, 43, 62 ] ] ], [ 36, 48, [ 1, [ 30, 43, 70 ] ] ], [ 42, 48, [ 1, [ 30, 62, 70 ] ] ], [ 38, 47, [ 1, \
[ 31, 74, 85 ] ] ], [ 38, 43, [ 1, [ 31, 74, 90 ] ] ], [ 47, 43, [ 1, [ 31, 85, 90 ] ] ], [ 44, 45, [ 1, [ 32, 76, 87 ] ] ], [ 44, 41, [ 1, [ 32, 76, 92 ] ] ], [ 45, 41, [ 1, [\
 32, 87, 92 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g1^-1, g1^-1, 1, 1, 1, 1, g3^-1, g3^-1, 1, 1, 1, 1, g4^-1, g4^-1, 1, 1, 1, 1, g2^\
-1, g2^-1, 1, 1, 1, 1, g2*g4*g6, g2*g4*g6, 1, 1, g1, g1, 1, 1, 1, 1, 1, 1, 1, g3, g3, g5^-1, g5^-1, 1, 1, g4, g4, 1, 1, 1, 1, g2, g2, g1*g3*g5, g1*g3*g5, 1, 1, g6^-1*g4^-1*g2^-\
1, g6^-1*g4^-1*g2^-1, 1, g6, g6, 1, 1, 1, g6^-1, g6^-1, 1, 1, g5, g5, 1, g5^-1*g3^-1*g1^-1, g5^-1*g3^-1*g1^-1 ]\n[ [ [ 1, 1 ], [ 3, 1 ], [ 2, -1 ] ], [ [ 4, 1 ], [ 6, 1 ], [ 5,\
 -1 ] ], [ [ 7, 1 ], [ 9, 1 ], [ 8, -1 ] ], [ [ 11, 1 ], [ 12, -1 ], [ 10, -1 ] ], [ [ 13, 1 ], [ 15, 1 ], [ 14, -1 ] ], [ [ 17, 1 ], [ 18, -1 ], [ 16, -1 ] ], [ [ 19, 1 ], [ 2\
1, 1 ], [ 20, -1 ] ], [ [ 23, 1 ], [ 24, -1 ], [ 22, -1 ] ], [ [ 26, 1 ], [ 27, -1 ], [ 25, -1 ] ], [ [ 28, 1 ], [ 30, 1 ], [ 29, -1 ] ], [ [ 32, 1 ], [ 33, -1 ], [ 31, -1 ] ],\
 [ [ 35, 1 ], [ 36, -1 ], [ 34, -1 ] ], [ [ 38, 1 ], [ 39, -1 ], [ 37, -1 ] ], [ [ 40, 1 ], [ 42, 1 ], [ 41, -1 ] ], [ [ 44, 1 ], [ 45, -1 ], [ 43, -1 ] ], [ [ 47, 1 ], [ 48, -\
1 ], [ 46, -1 ] ], [ [ 50, 1 ], [ 51, -1 ], [ 49, -1 ] ], [ [ 53, 1 ], [ 54, -1 ], [ 52, -1 ] ], [ [ 55, 1 ], [ 57, 1 ], [ 56, -1 ] ], [ [ 59, 1 ], [ 60, -1 ], [ 58, -1 ] ], [ \
[ 62, 1 ], [ 63, -1 ], [ 61, -1 ] ], [ [ 65, 1 ], [ 66, -1 ], [ 64, -1 ] ], [ [ 68, 1 ], [ 69, -1 ], [ 67, -1 ] ], [ [ 71, 1 ], [ 72, -1 ], [ 70, -1 ] ], [ [ 74, 1 ], [ 75, -1 \
], [ 73, -1 ] ], [ [ 77, 1 ], [ 78, -1 ], [ 76, -1 ] ], [ [ 80, 1 ], [ 81, -1 ], [ 79, -1 ] ], [ [ 83, 1 ], [ 84, -1 ], [ 82, -1 ] ], [ [ 86, 1 ], [ 87, -1 ], [ 85, -1 ] ], [ [\
 89, 1 ], [ 90, -1 ], [ 88, -1 ] ], [ [ 92, 1 ], [ 93, -1 ], [ 91, -1 ] ], [ [ 95, 1 ], [ 96, -1 ], [ 94, -1 ] ], [ [ 1, -1 ], [ 4, -1 ], [ 13, -1 ], [ 28, -1 ], [ 55, -1 ], [ \
40, -1 ], [ 19, -1 ], [ 7, -1 ] ], [ [ 6, -1 ], [ 2, 1 ], [ 10, 1 ], [ 27, 1 ], [ 52, 1 ], [ 68, -1 ], [ 38, -1 ], [ 17, -1 ] ], [ [ 3, -1 ], [ 8, 1 ], [ 22, 1 ], [ 51, 1 ], [ \
79, 1 ], [ 62, -1 ], [ 32, -1 ], [ 11, -1 ] ], [ [ 15, -1 ], [ 5, 1 ], [ 16, 1 ], [ 45, 1 ], [ 73, 1 ], [ 92, -1 ], [ 65, -1 ], [ 35, -1 ] ], [ [ 9, -1 ], [ 20, 1 ], [ 46, 1 ],\
 [ 78, 1 ], [ 94, 1 ], [ 74, -1 ], [ 44, -1 ], [ 23, -1 ] ], [ [ 36, 1 ], [ 64, 1 ], [ 87, 1 ], [ 76, 1 ], [ 48, 1 ], [ 25, 1 ], [ 12, 1 ], [ 31, 1 ] ], [ [ 30, -1 ], [ 14, 1 ]\
, [ 34, 1 ], [ 33, 1 ], [ 61, 1 ], [ 83, -1 ], [ 89, -1 ], [ 59, -1 ] ], [ [ 18, 1 ], [ 37, 1 ], [ 60, 1 ], [ 88, 1 ], [ 72, 1 ], [ 49, 1 ], [ 24, 1 ], [ 43, 1 ] ], [ [ 21, -1 \
], [ 41, 1 ], [ 70, 1 ], [ 90, 1 ], [ 82, 1 ], [ 53, -1 ], [ 26, -1 ], [ 47, -1 ] ], [ [ 57, -1 ], [ 29, 1 ], [ 58, 1 ], [ 39, 1 ], [ 67, 1 ], [ 95, -1 ], [ 77, -1 ], [ 86, -1 \
] ], [ [ 42, -1 ], [ 56, 1 ], [ 85, 1 ], [ 66, 1 ], [ 91, 1 ], [ 80, -1 ], [ 50, -1 ], [ 71, -1 ] ], [ [ 69, 1 ], [ 54, 1 ], [ 84, 1 ], [ 63, 1 ], [ 81, 1 ], [ 93, 1 ], [ 75, 1\
 ], [ 96, 1 ] ] ]"

gap> ExportString(KagomeModelGraph(TGCellGraph(ProperTriangleGroup([ 2, 3, 8 ]), TGQuotient([ 5, 1 ]), 3 : simplify := 0) : simplify := 0));
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z^8, z^3*y*z^-1*x*z*y^-1*x*y^-1*z^-2*x ], 3 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ z^-3*x*z*y^-1*z^-3*x^-1*z*y^-1, z^2*y^-1*z^-2\
*x*z^3*y*z^-1*x^-1, z*y^-1*z^-2*x*z^3*y*z^-1*x^-1*z, y^-1*z^-2*x*z^3*y*z^-1*x^-1*z^2, z*y^-1*z^-3*x*z^2*y*z^-2*x^-1, y^-1*z^-3*x*z^2*y*z^-2*x^-1*z, y*z^-2*x*z^2*y*z^-2*x^-1*z^2\
, x*y^-1*z^-2*x*z*(z^2*y)^2*z^-1*x^-1*z^3, z^-2*x*z^2*y^-1*z^-2*x^-1*z^2*y^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y*z^-1*y^-1*z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*x^-1*z^-1*x*z^3*y*z^-1*x^-1*z^3\
, z^-3*x*z*(y^-1*z^-2)^2*z^-1*x^-1*z^2*y*x^-1*z^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y^2*x*z*y^-1*z^-2*(z^-1*x^-1)^2*z^2*y*z^-2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^\
-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x\
^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^\
-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^\
-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^\
-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*\
(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1\
)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1\
*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x\
^-1, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1\
*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(x*y)^2*x^-1, y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y\
^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (x*y)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3\
*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^2*y*x^-1,\
 (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1,\
 (y*x)^2*y*(x^-1*y^-1)^7*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*(\
y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^2, y*(x^-1*y^-1)^2*y^-1*x^-1, y*x^-1*(y^-1*x^-1*y\
^-1)^2*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y*x^-1*y^-\
1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^\
-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x\
^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^\
-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*x^-1, x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1\
)^3*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^3*x\
^-1, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)\
^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^\
-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*x^-1, y^-1*x*y*(x^-1*y^-1)^2, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*x*y*x^-1*(y\
^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x*y*(x^-1*y^-1)^2*(y^-1\
*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^3, y*(x^-1*y^-1)^3*y^-1*x^-1, y*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x^-1\
*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, y*(x^-1*y^-1)^3*(y^-1*x^-1)^6, y*(x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*x^\
-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1\
*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, y^-1*x^-1*y^-1*x*y*(x^-1\
*y^-1)^2*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, \
y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*x*y*x^-1*y^-1*(x*y)^2*x^-1, y*\
x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y*x*y*\
x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1\
, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1\
*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, y^-1*(y^-1*x^-1)^3, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^\
2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, (y^-1*x^-1)^4, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^\
-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-\
1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*\
x^-1, (x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*x*y*(x^-1*y^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^2*x^-1*y^-\
1*x^-1, y^-1*(x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2\
*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)\
^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^\
2*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*(x*y)^2*(x\
^-1*y^-1)^5*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-\
1*y^-1)^3*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1\
*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, ((y^-1*x^-\
1)^2*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x*y)^3*(x^-1*y^-1\
)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*x^\
-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1\
 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^2, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^7*x\
^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, (x^-1*y^-1)^2*y^-1*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (y^-1*x^-1)^4, x*y*x*y*\
(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x^-1*(y^-1*x^-\
1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*(x^-1*y^-1\
)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^2*(x^-1*y^-1)^\
3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y\
^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*(y^-1*\
x^-1*y^-1)^2*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x*y*(x^-1*y^-1\
)^4*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^\
2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x\
*y)^2*(x^-1*y^-1)^5*x^-1 ], [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, y*x\
*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1*y^-1*x^-1, (y*x)^2*y*x^-1, (x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1\
*y^-1)^3*x^-1, (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^3*y*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, y*x\
*y*x^-1*y^-1*(x*y)^2*x^-1 ] ]\n[ \"KAGOME\", 8, [ \"VEF\", [ [ 1 ], [ 2 ], [ 2, 3 ] ] ] ]\n[ [ 1, 1 ], [ 1, 2 ], [ 1, 3 ], [ 1, 4 ], [ 1, 5 ], [ 1, 6 ], [ 1, 7 ], [ 1, 8 ], [ 1\
, 9 ], [ 1, 10 ], [ 1, 11 ], [ 1, 12 ], [ 1, 13 ], [ 1, 14 ], [ 1, 15 ], [ 1, 16 ], [ 1, 17 ], [ 1, 18 ], [ 1, 19 ], [ 1, 20 ], [ 1, 21 ], [ 1, 22 ], [ 1, 23 ], [ 1, 24 ], [ 1,\
 25 ], [ 1, 26 ], [ 1, 27 ], [ 1, 28 ], [ 1, 29 ], [ 1, 30 ], [ 1, 31 ], [ 1, 32 ], [ 1, 33 ], [ 1, 34 ], [ 1, 35 ], [ 1, 36 ], [ 1, 37 ], [ 1, 38 ], [ 1, 39 ], [ 1, 40 ], [ 1,\
 41 ], [ 1, 42 ], [ 1, 43 ], [ 1, 44 ], [ 1, 45 ], [ 1, 46 ], [ 1, 47 ], [ 1, 48 ], [ 1, 49 ], [ 1, 50 ], [ 1, 51 ], [ 1, 52 ], [ 1, 53 ], [ 1, 54 ], [ 1, 55 ], [ 1, 56 ], [ 1,\
 57 ], [ 1, 58 ], [ 1, 59 ], [ 1, 60 ], [ 1, 61 ], [ 1, 62 ], [ 1, 63 ], [ 1, 64 ], [ 1, 65 ], [ 1, 66 ], [ 1, 67 ], [ 1, 68 ], [ 1, 69 ], [ 1, 70 ], [ 1, 71 ], [ 1, 72 ], [ 1,\
 73 ], [ 1, 74 ], [ 1, 75 ], [ 1, 76 ], [ 1, 77 ], [ 1, 78 ], [ 1, 79 ], [ 1, 80 ], [ 1, 81 ], [ 1, 82 ], [ 1, 83 ], [ 1, 84 ], [ 1, 85 ], [ 1, 86 ], [ 1, 87 ], [ 1, 88 ], [ 1,\
 89 ], [ 1, 90 ], [ 1, 91 ], [ 1, 92 ], [ 1, 93 ], [ 1, 94 ], [ 1, 95 ], [ 1, 96 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 16 ] ] ], [ 1, 3, [ 1, [ 1, 1, 17 ] ] ], [ 2, 3, [ 1, [ 1, 16, 17 ]\
 ] ], [ 4, 1, [ 1, [ 2, 2, 9 ] ] ], [ 4, 5, [ 1, [ 2, 2, 18 ] ] ], [ 1, 5, [ 1, [ 2, 9, 18 ] ] ], [ 2, 6, [ 1, [ 3, 8, 15 ] ] ], [ 2, 7, [ 1, [ 3, 8, 24 ] ] ], [ 6, 7, [ 1, [ 3\
, 15, 24 ] ] ], [ 3, 8, [ 1, [ 4, 32, 33 ] ] ], [ 3, 10, [ 1, [ 4, 32, 56 ] ] ], [ 8, 10, [ 1, [ 4, 33, 56 ] ] ], [ 9, 4, [ 1, [ 5, 3, 10 ] ] ], [ 9, 11, [ 1, [ 5, 3, 19 ] ] ],\
 [ 4, 11, [ 1, [ 5, 10, 19 ] ] ], [ 5, 14, [ 1, [ 6, 25, 34 ] ] ], [ 5, 12, [ 1, [ 6, 25, 49 ] ] ], [ 14, 12, [ 1, [ 6, 34, 49 ] ] ], [ 6, 13, [ 1, [ 7, 7, 14 ] ] ], [ 6, 15, [\
 1, [ 7, 7, 23 ] ] ], [ 13, 15, [ 1, [ 7, 14, 23 ] ] ], [ 7, 16, [ 1, [ 8, 31, 40 ] ] ], [ 7, 19, [ 1, [ 8, 31, 55 ] ] ], [ 16, 19, [ 1, [ 8, 40, 55 ] ] ], [ 8, 17, [ 1, [ 9, 5\
7, 65 ] ] ], [ 8, 20, [ 1, [ 9, 57, 105 ] ] ], [ 17, 20, [ 1, [ 9, 65, 105 ] ] ], [ 18, 9, [ 1, [ 10, 4, 11 ] ] ], [ 18, 21, [ 1, [ 10, 4, 20 ] ] ], [ 9, 21, [ 1, [ 10, 11, 20 \
] ] ], [ 10, 26, [ 1, [ 11, 48, 80 ] ] ], [ 10, 22, [ 1, [ 11, 48, 96 ] ] ], [ 26, 22, [ 1, [ 11, 80, 96 ] ] ], [ 11, 27, [ 1, [ 12, 26, 35 ] ] ], [ 11, 23, [ 1, [ 12, 26, 50 ]\
 ] ], [ 27, 23, [ 1, [ 12, 35, 50 ] ] ], [ 12, 28, [ 1, [ 13, 41, 73 ] ] ], [ 12, 24, [ 1, [ 13, 41, 89 ] ] ], [ 28, 24, [ 1, [ 13, 73, 89 ] ] ], [ 13, 25, [ 1, [ 14, 6, 13 ] ]\
 ], [ 13, 29, [ 1, [ 14, 6, 22 ] ] ], [ 25, 29, [ 1, [ 14, 13, 22 ] ] ], [ 14, 30, [ 1, [ 15, 58, 66 ] ] ], [ 14, 34, [ 1, [ 15, 58, 106 ] ] ], [ 30, 34, [ 1, [ 15, 66, 106 ] ]\
 ], [ 15, 31, [ 1, [ 16, 30, 39 ] ] ], [ 15, 35, [ 1, [ 16, 30, 54 ] ] ], [ 31, 35, [ 1, [ 16, 39, 54 ] ] ], [ 16, 32, [ 1, [ 17, 64, 72 ] ] ], [ 16, 36, [ 1, [ 17, 64, 112 ] ]\
 ], [ 32, 36, [ 1, [ 17, 72, 112 ] ] ], [ 17, 33, [ 1, [ 18, 113, 121 ] ] ], [ 17, 37, [ 1, [ 18, 113, 161 ] ] ], [ 33, 37, [ 1, [ 18, 121, 161 ] ] ], [ 25, 18, [ 1, [ 19, 5, 1\
2 ] ] ], [ 25, 38, [ 1, [ 19, 5, 21 ] ] ], [ 18, 38, [ 1, [ 19, 12, 21 ] ] ], [ 19, 44, [ 1, [ 20, 47, 79 ] ] ], [ 19, 39, [ 1, [ 20, 47, 95 ] ] ], [ 44, 39, [ 1, [ 20, 79, 95 \
] ] ], [ 20, 40, [ 1, [ 21, 97, 132 ] ] ], [ 20, 45, [ 1, [ 21, 97, 153 ] ] ], [ 40, 45, [ 1, [ 21, 132, 153 ] ] ], [ 21, 46, [ 1, [ 22, 27, 36 ] ] ], [ 21, 41, [ 1, [ 22, 27, \
51 ] ] ], [ 46, 41, [ 1, [ 22, 36, 51 ] ] ], [ 22, 47, [ 1, [ 23, 88, 144 ] ] ], [ 22, 42, [ 1, [ 23, 88, 152 ] ] ], [ 47, 42, [ 1, [ 23, 144, 152 ] ] ], [ 23, 48, [ 1, [ 24, 4\
2, 74 ] ] ], [ 23, 43, [ 1, [ 24, 42, 90 ] ] ], [ 48, 43, [ 1, [ 24, 74, 90 ] ] ], [ 24, 49, [ 1, [ 25, 81, 137 ] ] ], [ 24, 33, [ 1, [ 25, 81, 145 ] ] ], [ 49, 33, [ 1, [ 25, \
137, 145 ] ] ], [ 50, 26, [ 1, [ 26, 101, 136 ] ] ], [ 50, 56, [ 1, [ 26, 101, 157 ] ] ], [ 26, 56, [ 1, [ 26, 136, 157 ] ] ], [ 27, 51, [ 1, [ 27, 59, 67 ] ] ], [ 27, 57, [ 1,\
 [ 27, 59, 107 ] ] ], [ 51, 57, [ 1, [ 27, 67, 107 ] ] ], [ 52, 28, [ 1, [ 28, 102, 129 ] ] ], [ 52, 58, [ 1, [ 28, 102, 158 ] ] ], [ 28, 58, [ 1, [ 28, 129, 158 ] ] ], [ 29, 5\
3, [ 1, [ 29, 29, 38 ] ] ], [ 29, 59, [ 1, [ 29, 29, 53 ] ] ], [ 53, 59, [ 1, [ 29, 38, 53 ] ] ], [ 30, 54, [ 1, [ 30, 114, 122 ] ] ], [ 30, 60, [ 1, [ 30, 114, 162 ] ] ], [ 54\
, 60, [ 1, [ 30, 122, 162 ] ] ], [ 31, 55, [ 1, [ 31, 63, 71 ] ] ], [ 31, 61, [ 1, [ 31, 63, 111 ] ] ], [ 55, 61, [ 1, [ 31, 71, 111 ] ] ], [ 32, 42, [ 1, [ 32, 120, 128 ] ] ],\
 [ 32, 62, [ 1, [ 32, 120, 168 ] ] ], [ 42, 62, [ 1, [ 32, 128, 168 ] ] ], [ 34, 63, [ 1, [ 33, 98, 133 ] ] ], [ 34, 69, [ 1, [ 33, 98, 154 ] ] ], [ 63, 69, [ 1, [ 33, 133, 154\
 ] ] ], [ 35, 70, [ 1, [ 34, 46, 78 ] ] ], [ 35, 64, [ 1, [ 34, 46, 94 ] ] ], [ 70, 64, [ 1, [ 34, 78, 94 ] ] ], [ 36, 65, [ 1, [ 35, 104, 131 ] ] ], [ 36, 71, [ 1, [ 35, 104, \
160 ] ] ], [ 65, 71, [ 1, [ 35, 131, 160 ] ] ], [ 66, 37, [ 1, [ 36, 83, 139 ] ] ], [ 66, 72, [ 1, [ 36, 83, 147 ] ] ], [ 37, 72, [ 1, [ 36, 139, 147 ] ] ], [ 38, 73, [ 1, [ 37\
, 28, 37 ] ] ], [ 38, 67, [ 1, [ 37, 28, 52 ] ] ], [ 73, 67, [ 1, [ 37, 37, 52 ] ] ], [ 39, 74, [ 1, [ 38, 87, 143 ] ] ], [ 39, 68, [ 1, [ 38, 87, 151 ] ] ], [ 74, 68, [ 1, [ 3\
8, 143, 151 ] ] ], [ 67, 40, [ 1, [ 39, 44, 76 ] ] ], [ 67, 75, [ 1, [ 39, 44, 92 ] ] ], [ 40, 75, [ 1, [ 39, 76, 92 ] ] ], [ 41, 65, [ 1, [ 40, 43, 75 ] ] ], [ 41, 66, [ 1, [ \
40, 43, 91 ] ] ], [ 65, 66, [ 1, [ 40, 75, 91 ] ] ], [ 43, 62, [ 1, [ 41, 82, 138 ] ] ], [ 43, 54, [ 1, [ 41, 82, 146 ] ] ], [ 62, 54, [ 1, [ 41, 138, 146 ] ] ], [ 76, 44, [ 1,\
 [ 42, 100, 135 ] ] ], [ 76, 80, [ 1, [ 42, 100, 156 ] ] ], [ 44, 80, [ 1, [ 42, 135, 156 ] ] ], [ 45, 77, [ 1, [ 43, 172, 177 ] ] ], [ 45, 81, [ 1, [ 43, 172, 188 ] ] ], [ 77,\
 81, [ 1, [ 43, 177, 188 ] ] ], [ 46, 78, [ 1, [ 44, 60, 68 ] ] ], [ 46, 76, [ 1, [ 44, 60, 108 ] ] ], [ 78, 76, [ 1, [ 44, 68, 108 ] ] ], [ 79, 82, [ 1, [ 45, 118, 126 ] ] ], \
[ 79, 47, [ 1, [ 45, 118, 166 ] ] ], [ 82, 47, [ 1, [ 45, 126, 166 ] ] ], [ 61, 48, [ 1, [ 46, 103, 130 ] ] ], [ 61, 83, [ 1, [ 46, 103, 159 ] ] ], [ 48, 83, [ 1, [ 46, 130, 15\
9 ] ] ], [ 55, 68, [ 1, [ 47, 119, 127 ] ] ], [ 55, 49, [ 1, [ 47, 119, 167 ] ] ], [ 68, 49, [ 1, [ 47, 127, 167 ] ] ], [ 73, 84, [ 1, [ 48, 61, 69 ] ] ], [ 73, 50, [ 1, [ 48, \
61, 109 ] ] ], [ 84, 50, [ 1, [ 48, 69, 109 ] ] ], [ 51, 72, [ 1, [ 49, 115, 123 ] ] ], [ 51, 85, [ 1, [ 49, 115, 163 ] ] ], [ 72, 85, [ 1, [ 49, 123, 163 ] ] ], [ 53, 79, [ 1,\
 [ 50, 62, 70 ] ] ], [ 53, 52, [ 1, [ 50, 62, 110 ] ] ], [ 79, 52, [ 1, [ 50, 70, 110 ] ] ], [ 56, 89, [ 1, [ 51, 176, 181 ] ] ], [ 56, 86, [ 1, [ 51, 176, 192 ] ] ], [ 89, 86,\
 [ 1, [ 51, 181, 192 ] ] ], [ 57, 70, [ 1, [ 52, 99, 134 ] ] ], [ 57, 90, [ 1, [ 52, 99, 155 ] ] ], [ 70, 90, [ 1, [ 52, 134, 155 ] ] ], [ 58, 86, [ 1, [ 53, 169, 182 ] ] ], [ \
58, 87, [ 1, [ 53, 169, 185 ] ] ], [ 86, 87, [ 1, [ 53, 182, 185 ] ] ], [ 59, 63, [ 1, [ 54, 45, 77 ] ] ], [ 59, 88, [ 1, [ 54, 45, 93 ] ] ], [ 63, 88, [ 1, [ 54, 77, 93 ] ] ],\
 [ 75, 60, [ 1, [ 55, 84, 140 ] ] ], [ 75, 91, [ 1, [ 55, 84, 148 ] ] ], [ 60, 91, [ 1, [ 55, 140, 148 ] ] ], [ 64, 92, [ 1, [ 56, 86, 142 ] ] ], [ 64, 82, [ 1, [ 56, 86, 150 ]\
 ] ], [ 92, 82, [ 1, [ 56, 142, 150 ] ] ], [ 69, 81, [ 1, [ 57, 173, 178 ] ] ], [ 69, 94, [ 1, [ 57, 173, 189 ] ] ], [ 81, 94, [ 1, [ 57, 178, 189 ] ] ], [ 71, 93, [ 1, [ 58, 1\
71, 184 ] ] ], [ 71, 77, [ 1, [ 58, 171, 187 ] ] ], [ 93, 77, [ 1, [ 58, 184, 187 ] ] ], [ 84, 95, [ 1, [ 59, 117, 125 ] ] ], [ 84, 74, [ 1, [ 59, 117, 165 ] ] ], [ 95, 74, [ 1\
, [ 59, 125, 165 ] ] ], [ 78, 91, [ 1, [ 60, 116, 124 ] ] ], [ 78, 92, [ 1, [ 60, 116, 164 ] ] ], [ 91, 92, [ 1, [ 60, 124, 164 ] ] ], [ 80, 96, [ 1, [ 61, 175, 180 ] ] ], [ 80\
, 89, [ 1, [ 61, 175, 191 ] ] ], [ 96, 89, [ 1, [ 61, 180, 191 ] ] ], [ 83, 87, [ 1, [ 62, 170, 183 ] ] ], [ 83, 93, [ 1, [ 62, 170, 186 ] ] ], [ 87, 93, [ 1, [ 62, 183, 186 ] \
] ], [ 88, 85, [ 1, [ 63, 85, 141 ] ] ], [ 88, 95, [ 1, [ 63, 85, 149 ] ] ], [ 85, 95, [ 1, [ 63, 141, 149 ] ] ], [ 90, 94, [ 1, [ 64, 174, 179 ] ] ], [ 90, 96, [ 1, [ 64, 174,\
 190 ] ] ], [ 94, 96, [ 1, [ 64, 179, 190 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, \
1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g7^-1, g7^-1, 1, 1, 1, 1, 1, 1, g1, 1, g1^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g1^-1, 1, g1, 1, 1, 1, g2^-1, 1, g2, 1, 1, 1, 1, g8^-1, g8^-1\
, 1, 1, 1, 1, g6^-1, g6^-1, g2, 1, g2^-1, 1, 1, 1, g4^-1, 1, g4, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g4, 1, g4^-1, 1, g8*g1, g8*g1, 1, 1, 1, 1, g6*g8*g10, g6*\
g8*g10, g3^-1, 1, g3, 1, g5^-1, g5^-1, 1, 1, 1, 1, g9^-1, g9^-1, 1, 1, 1, 1, g10^-1*g8^-1*g6^-1*g1^-1, g10^-1*g8^-1*g6^-1*g1^-1, g3, 1, g3^-1, 1, g5*g2^-1, g5*g2^-1, 1, 1, 1, 1\
, 1, 1, 1, 1, 1, 1, g9*g2, g9*g2, 1, g7*g4^-1, g7*g4^-1, 1, g5*g7*g9, g5*g7*g9, 1, g10^-1, g10^-1, 1, g9^-1*g7^-1*g5^-1*g4, g9^-1*g7^-1*g5^-1*g4, 1, g6*g3^-1, g6*g3^-1, 1, 1, 1\
, 1, g10*g3, g10*g3 ]\n[ [ [ 1, 1 ], [ 3, 1 ], [ 2, -1 ] ], [ [ 4, 1 ], [ 6, 1 ], [ 5, -1 ] ], [ [ 7, 1 ], [ 9, 1 ], [ 8, -1 ] ], [ [ 11, 1 ], [ 12, -1 ], [ 10, -1 ] ], [ [ 13,\
 1 ], [ 15, 1 ], [ 14, -1 ] ], [ [ 17, 1 ], [ 18, -1 ], [ 16, -1 ] ], [ [ 19, 1 ], [ 21, 1 ], [ 20, -1 ] ], [ [ 23, 1 ], [ 24, -1 ], [ 22, -1 ] ], [ [ 26, 1 ], [ 27, -1 ], [ 25\
, -1 ] ], [ [ 28, 1 ], [ 30, 1 ], [ 29, -1 ] ], [ [ 32, 1 ], [ 33, -1 ], [ 31, -1 ] ], [ [ 35, 1 ], [ 36, -1 ], [ 34, -1 ] ], [ [ 38, 1 ], [ 39, -1 ], [ 37, -1 ] ], [ [ 40, 1 ]\
, [ 42, 1 ], [ 41, -1 ] ], [ [ 44, 1 ], [ 45, -1 ], [ 43, -1 ] ], [ [ 47, 1 ], [ 48, -1 ], [ 46, -1 ] ], [ [ 50, 1 ], [ 51, -1 ], [ 49, -1 ] ], [ [ 53, 1 ], [ 54, -1 ], [ 52, -\
1 ] ], [ [ 55, 1 ], [ 57, 1 ], [ 56, -1 ] ], [ [ 59, 1 ], [ 60, -1 ], [ 58, -1 ] ], [ [ 61, 1 ], [ 63, 1 ], [ 62, -1 ] ], [ [ 65, 1 ], [ 66, -1 ], [ 64, -1 ] ], [ [ 68, 1 ], [ \
69, -1 ], [ 67, -1 ] ], [ [ 71, 1 ], [ 72, -1 ], [ 70, -1 ] ], [ [ 74, 1 ], [ 75, -1 ], [ 73, -1 ] ], [ [ 76, 1 ], [ 78, 1 ], [ 77, -1 ] ], [ [ 80, 1 ], [ 81, -1 ], [ 79, -1 ] \
], [ [ 82, 1 ], [ 84, 1 ], [ 83, -1 ] ], [ [ 86, 1 ], [ 87, -1 ], [ 85, -1 ] ], [ [ 89, 1 ], [ 90, -1 ], [ 88, -1 ] ], [ [ 92, 1 ], [ 93, -1 ], [ 91, -1 ] ], [ [ 95, 1 ], [ 96,\
 -1 ], [ 94, -1 ] ], [ [ 97, 1 ], [ 99, 1 ], [ 98, -1 ] ], [ [ 101, 1 ], [ 102, -1 ], [ 100, -1 ] ], [ [ 103, 1 ], [ 105, 1 ], [ 104, -1 ] ], [ [ 107, 1 ], [ 108, -1 ], [ 106, \
-1 ] ], [ [ 110, 1 ], [ 111, -1 ], [ 109, -1 ] ], [ [ 113, 1 ], [ 114, -1 ], [ 112, -1 ] ], [ [ 116, 1 ], [ 117, -1 ], [ 115, -1 ] ], [ [ 119, 1 ], [ 120, -1 ], [ 118, -1 ] ], \
[ [ 122, 1 ], [ 123, -1 ], [ 121, -1 ] ], [ [ 124, 1 ], [ 126, 1 ], [ 125, -1 ] ], [ [ 128, 1 ], [ 129, -1 ], [ 127, -1 ] ], [ [ 131, 1 ], [ 132, -1 ], [ 130, -1 ] ], [ [ 134, \
1 ], [ 135, -1 ], [ 133, -1 ] ], [ [ 136, 1 ], [ 138, 1 ], [ 137, -1 ] ], [ [ 140, 1 ], [ 141, -1 ], [ 139, -1 ] ], [ [ 143, 1 ], [ 144, -1 ], [ 142, -1 ] ], [ [ 146, 1 ], [ 14\
7, -1 ], [ 145, -1 ] ], [ [ 149, 1 ], [ 150, -1 ], [ 148, -1 ] ], [ [ 152, 1 ], [ 153, -1 ], [ 151, -1 ] ], [ [ 154, 1 ], [ 156, 1 ], [ 155, -1 ] ], [ [ 158, 1 ], [ 159, -1 ], \
[ 157, -1 ] ], [ [ 161, 1 ], [ 162, -1 ], [ 160, -1 ] ], [ [ 164, 1 ], [ 165, -1 ], [ 163, -1 ] ], [ [ 167, 1 ], [ 168, -1 ], [ 166, -1 ] ], [ [ 170, 1 ], [ 171, -1 ], [ 169, -\
1 ] ], [ [ 173, 1 ], [ 174, -1 ], [ 172, -1 ] ], [ [ 176, 1 ], [ 177, -1 ], [ 175, -1 ] ], [ [ 179, 1 ], [ 180, -1 ], [ 178, -1 ] ], [ [ 182, 1 ], [ 183, -1 ], [ 181, -1 ] ], [\
 [ 185, 1 ], [ 186, -1 ], [ 184, -1 ] ], [ [ 188, 1 ], [ 189, -1 ], [ 187, -1 ] ], [ [ 191, 1 ], [ 192, -1 ], [ 190, -1 ] ], [ [ 1, -1 ], [ 4, -1 ], [ 13, -1 ], [ 28, -1 ], [ 5\
5, -1 ], [ 40, -1 ], [ 19, -1 ], [ 7, -1 ] ], [ [ 6, -1 ], [ 2, 1 ], [ 10, 1 ], [ 25, 1 ], [ 52, 1 ], [ 74, -1 ], [ 38, -1 ], [ 17, -1 ] ], [ [ 3, -1 ], [ 8, 1 ], [ 22, 1 ], [ \
49, 1 ], [ 94, 1 ], [ 68, -1 ], [ 32, -1 ], [ 11, -1 ] ], [ [ 15, -1 ], [ 5, 1 ], [ 16, 1 ], [ 43, 1 ], [ 88, 1 ], [ 122, -1 ], [ 71, -1 ], [ 35, -1 ] ], [ [ 9, -1 ], [ 20, 1 ]\
, [ 46, 1 ], [ 91, 1 ], [ 139, 1 ], [ 113, -1 ], [ 59, -1 ], [ 23, -1 ] ], [ [ 111, 1 ], [ 115, 1 ], [ 61, -1 ], [ 26, -1 ], [ 12, 1 ], [ 31, 1 ], [ 76, -1 ], [ 143, -1 ] ], [ \
[ 30, -1 ], [ 14, 1 ], [ 34, 1 ], [ 79, 1 ], [ 145, 1 ], [ 107, -1 ], [ 119, -1 ], [ 65, -1 ] ], [ [ 18, 1 ], [ 37, 1 ], [ 82, -1 ], [ 149, -1 ], [ 87, 1 ], [ 160, 1 ], [ 97, -\
1 ], [ 44, -1 ] ], [ [ 21, -1 ], [ 41, 1 ], [ 85, 1 ], [ 148, 1 ], [ 133, 1 ], [ 167, -1 ], [ 101, -1 ], [ 47, -1 ] ], [ [ 66, 1 ], [ 118, 1 ], [ 103, -1 ], [ 50, -1 ], [ 24, 1\
 ], [ 58, 1 ], [ 124, -1 ], [ 131, -1 ] ], [ [ 120, 1 ], [ 106, 1 ], [ 53, -1 ], [ 27, 1 ], [ 62, 1 ], [ 127, 1 ], [ 173, -1 ], [ 105, -1 ] ], [ [ 57, -1 ], [ 29, 1 ], [ 64, 1 \
], [ 130, 1 ], [ 178, 1 ], [ 164, -1 ], [ 116, -1 ], [ 110, -1 ] ], [ [ 33, 1 ], [ 67, 1 ], [ 134, -1 ], [ 150, 1 ], [ 83, 1 ], [ 157, 1 ], [ 152, -1 ], [ 78, -1 ] ], [ [ 36, 1\
 ], [ 70, 1 ], [ 136, -1 ], [ 92, -1 ], [ 48, 1 ], [ 100, 1 ], [ 154, -1 ], [ 80, -1 ] ], [ [ 39, 1 ], [ 73, 1 ], [ 140, -1 ], [ 93, 1 ], [ 137, 1 ], [ 184, 1 ], [ 158, -1 ], [\
 84, -1 ] ], [ [ 42, -1 ], [ 56, 1 ], [ 109, 1 ], [ 142, 1 ], [ 175, 1 ], [ 188, -1 ], [ 161, -1 ], [ 86, -1 ] ], [ [ 117, 1 ], [ 163, 1 ], [ 89, -1 ], [ 45, 1 ], [ 98, 1 ], [ \
169, 1 ], [ 128, -1 ], [ 63, -1 ] ], [ [ 72, 1 ], [ 121, 1 ], [ 95, -1 ], [ 51, 1 ], [ 104, 1 ], [ 172, 1 ], [ 185, -1 ], [ 138, -1 ] ], [ [ 75, 1 ], [ 54, 1 ], [ 108, 1 ], [ 1\
47, 1 ], [ 189, 1 ], [ 177, 1 ], [ 114, 1 ], [ 141, 1 ] ], [ [ 60, 1 ], [ 112, 1 ], [ 176, -1 ], [ 144, 1 ], [ 77, 1 ], [ 151, 1 ], [ 182, -1 ], [ 126, -1 ] ], [ [ 123, 1 ], [ \
90, 1 ], [ 165, 1 ], [ 180, 1 ], [ 168, 1 ], [ 135, 1 ], [ 69, 1 ], [ 96, 1 ] ], [ [ 162, 1 ], [ 187, 1 ], [ 146, -1 ], [ 81, 1 ], [ 155, 1 ], [ 190, 1 ], [ 170, -1 ], [ 99, -1\
 ] ], [ [ 102, 1 ], [ 166, 1 ], [ 179, -1 ], [ 132, 1 ], [ 125, 1 ], [ 181, 1 ], [ 191, -1 ], [ 156, -1 ] ], [ [ 159, 1 ], [ 186, 1 ], [ 174, 1 ], [ 129, 1 ], [ 171, 1 ], [ 192\
, 1 ], [ 183, 1 ], [ 153, 1 ] ] ]"

# Dual graphs
gap> sign := [ 2, 3, 8 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 1 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 0);;
gap> tmg := TessellationModelGraph(cg, true : simplify := 0);;
gap> ExportString(tmg);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^2*y^-1*z^-1*x^-1*z^2*y^-1, z*y^-1*z^-1*x*z^2*y*x^-1, y^-1*z^-1*x*z^2*y*x^-1*z, y*z^-2\
*x*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1*z^-1*x*y^-1*z^-2*x^-1*z^-1*x*z*y*z^-1*y^-1*z^-2*x^-1*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1*z ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1\
*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1,\
 (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1\
*y^-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1\
*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1\
*y^-1*(y^-1*x^-1)^7, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)\
^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1\
*y^-1*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(y^-1*x^-1)^5, (y^-1*x^\
-1)^3, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^6 ], [ 1, y^-1*x^-1, (y^-1*x^-1)\
^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^4*x^-1, (y^-1*x^-1)^3, x*y*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*x^-1, x\
*y*(x^-1*y^-1)^3*x^-1, (y^-1*x^-1)^5, x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^4 ], [ 1, x^-1, (x^-1*y^-1)^3*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1 ] ]\n[ \"TESS\", [ \
3, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1 ], [ 3, 2 ], [ 3, 3 ], [ 3, 4 ], [ 3, 5 ], [ 3, 6 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 9 ] ] ], [ 1, 3, [ 1, [ 2, 8, 16 ] ] ], [\
 2, 3, [ 1, [ 3, 17, 32 ] ] ], [ 1, 4, [ 1, [ 4, 2, 10 ] ] ], [ 4, 2, [ 1, [ 5, 18, 25 ] ] ], [ 1, 5, [ 1, [ 6, 7, 15 ] ] ], [ 3, 5, [ 1, [ 7, 24, 31 ] ] ], [ 2, 6, [ 1, [ 8, 3\
3, 45 ] ] ], [ 1, 5, [ 1, [ 9, 3, 11 ] ] ], [ 3, 6, [ 1, [ 10, 36, 48 ] ] ], [ 5, 4, [ 1, [ 11, 19, 26 ] ] ], [ 2, 6, [ 1, [ 12, 37, 41 ] ] ], [ 1, 4, [ 1, [ 13, 6, 14 ] ] ], [\
 4, 6, [ 1, [ 14, 34, 46 ] ] ], [ 5, 4, [ 1, [ 15, 23, 30 ] ] ], [ 3, 6, [ 1, [ 16, 40, 44 ] ] ], [ 4, 2, [ 1, [ 17, 22, 29 ] ] ], [ 1, 3, [ 1, [ 18, 4, 12 ] ] ], [ 5, 6, [ 1, \
[ 19, 35, 47 ] ] ], [ 4, 6, [ 1, [ 20, 38, 42 ] ] ], [ 3, 5, [ 1, [ 21, 20, 27 ] ] ], [ 2, 3, [ 1, [ 22, 21, 28 ] ] ], [ 1, 2, [ 1, [ 23, 5, 13 ] ] ], [ 5, 6, [ 1, [ 24, 39, 43\
 ] ] ] ]\n[ 1, g4^-1, g4^-1, 1, 1, g3^-1, g3^-1*g4, g2^-1*g3*g4^-1, 1, g2^-1*g3, 1, 1, g2^-1, 1, g2^-1*g3, g2^-1*g3*g4^-1*g1^-1*g2*g3^-1*g1*g2^-1*g3*g4^-1*g1^-1*g2*g3^-1*g4^2, \
g1^-1*g2, 1, g2^-1*g3*g4^-1*g1^-1*g2, (g2^-1*g3*g4^-1)^2*g1^-1*g2*g3^-1*g4*g2, 1, g1, g1^-1, g2^-1*g3 ]\n[ [ [ 1, -1 ], [ 2, 1 ], [ 3, -1 ] ], [ [ 4, -1 ], [ 1, 1 ], [ 5, -1 ] \
], [ [ 2, -1 ], [ 6, 1 ], [ 7, -1 ] ], [ [ 3, 1 ], [ 10, 1 ], [ 8, -1 ] ], [ [ 9, -1 ], [ 4, 1 ], [ 11, -1 ] ], [ [ 5, 1 ], [ 12, 1 ], [ 14, -1 ] ], [ [ 6, -1 ], [ 13, 1 ], [ 1\
5, -1 ] ], [ [ 7, 1 ], [ 19, 1 ], [ 16, -1 ] ], [ [ 17, 1 ], [ 8, 1 ], [ 20, -1 ] ], [ [ 18, -1 ], [ 9, 1 ], [ 21, -1 ] ], [ [ 21, 1 ], [ 24, 1 ], [ 10, -1 ] ], [ [ 11, 1 ], [ \
20, 1 ], [ 19, -1 ] ], [ [ 22, 1 ], [ 16, 1 ], [ 12, -1 ] ], [ [ 13, -1 ], [ 23, 1 ], [ 17, -1 ] ], [ [ 15, 1 ], [ 14, 1 ], [ 24, -1 ] ], [ [ 23, -1 ], [ 18, 1 ], [ 22, -1 ] ] \
]"

gap> q := TGQuotient( [ 5, 1 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 0);;
gap> tmg := TessellationModelGraph(cg, true : simplify := 0);;
gap> ExportString(tmg);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z^8, z^3*y*z^-1*x*z*y^-1*x*y^-1*z^-2*x ], 3 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ z^-3*x*z*y^-1*z^-3*x^-1*z*y^-1, z^2*y^-1*z^-2\
*x*z^3*y*z^-1*x^-1, z*y^-1*z^-2*x*z^3*y*z^-1*x^-1*z, y^-1*z^-2*x*z^3*y*z^-1*x^-1*z^2, z*y^-1*z^-3*x*z^2*y*z^-2*x^-1, y^-1*z^-3*x*z^2*y*z^-2*x^-1*z, y*z^-2*x*z^2*y*z^-2*x^-1*z^2\
, x*y^-1*z^-2*x*z*(z^2*y)^2*z^-1*x^-1*z^3, z^-2*x*z^2*y^-1*z^-2*x^-1*z^2*y^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y*z^-1*y^-1*z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*x^-1*z^-1*x*z^3*y*z^-1*x^-1*z^3\
, z^-3*x*z*(y^-1*z^-2)^2*z^-1*x^-1*z^2*y*x^-1*z^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y^2*x*z*y^-1*z^-2*(z^-1*x^-1)^2*z^2*y*z^-2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^\
-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x\
^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^\
-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^\
-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^\
-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*\
(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1\
)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1\
*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x\
^-1, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1\
*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(x*y)^2*x^-1, y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y\
^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (x*y)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3\
*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^2*y*x^-1,\
 (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1,\
 (y*x)^2*y*(x^-1*y^-1)^7*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*(\
y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^2, y*(x^-1*y^-1)^2*y^-1*x^-1, y*x^-1*(y^-1*x^-1*y\
^-1)^2*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y*x^-1*y^-\
1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^\
-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x\
^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^\
-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*x^-1, x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1\
)^3*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^3*x\
^-1, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)\
^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^\
-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*x^-1, y^-1*x*y*(x^-1*y^-1)^2, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*x*y*x^-1*(y\
^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x*y*(x^-1*y^-1)^2*(y^-1\
*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^3, y*(x^-1*y^-1)^3*y^-1*x^-1, y*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x^-1\
*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, y*(x^-1*y^-1)^3*(y^-1*x^-1)^6, y*(x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*x^\
-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1\
*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, y^-1*x^-1*y^-1*x*y*(x^-1\
*y^-1)^2*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, \
y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*x*y*x^-1*y^-1*(x*y)^2*x^-1, y*\
x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y*x*y*\
x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1\
, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1\
*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, y^-1*(y^-1*x^-1)^3, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^\
2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, (y^-1*x^-1)^4, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^\
-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-\
1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*\
x^-1, (x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*x*y*(x^-1*y^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^2*x^-1*y^-\
1*x^-1, y^-1*(x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2\
*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)\
^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^\
2*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*(x*y)^2*(x\
^-1*y^-1)^5*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-\
1*y^-1)^3*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1\
*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, ((y^-1*x^-\
1)^2*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x*y)^3*(x^-1*y^-1\
)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*x^\
-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1\
 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^2, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^7*x\
^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, (x^-1*y^-1)^2*y^-1*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (y^-1*x^-1)^4, x*y*x*y*\
(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x^-1*(y^-1*x^-\
1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*(x^-1*y^-1\
)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^2*(x^-1*y^-1)^\
3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y\
^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*(y^-1*\
x^-1*y^-1)^2*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x*y*(x^-1*y^-1\
)^4*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^\
2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x\
*y)^2*(x^-1*y^-1)^5*x^-1 ], [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, y*x\
*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1*y^-1*x^-1, (y*x)^2*y*x^-1, (x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1\
*y^-1)^3*x^-1, (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^3*y*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, y*x\
*y*x^-1*y^-1*(x*y)^2*x^-1 ] ]\n[ \"TESS\", [ 3, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1 ], [ 3, 2 ], [ 3, 3 ], [ 3, 4 ], [ 3, 5 ], [ 3, 6 ], [ 3, 7 ], [ 3, 8 ], [\
 3, 9 ], [ 3, 10 ], [ 3, 11 ], [ 3, 12 ], [ 3, 13 ], [ 3, 14 ], [ 3, 15 ], [ 3, 16 ], [ 3, 17 ], [ 3, 18 ], [ 3, 19 ], [ 3, 20 ], [ 3, 21 ], [ 3, 22 ], [ 3, 23 ], [ 3, 24 ] ]\n\
[ [ 1, 2, [ 1, [ 1, 1, 9 ] ] ], [ 1, 3, [ 1, [ 2, 8, 16 ] ] ], [ 2, 3, [ 1, [ 3, 17, 32 ] ] ], [ 1, 4, [ 1, [ 4, 2, 10 ] ] ], [ 4, 2, [ 1, [ 5, 18, 25 ] ] ], [ 1, 5, [ 1, [ 6, \
7, 15 ] ] ], [ 3, 5, [ 1, [ 7, 24, 31 ] ] ], [ 2, 6, [ 1, [ 8, 33, 57 ] ] ], [ 1, 7, [ 1, [ 9, 3, 11 ] ] ], [ 3, 6, [ 1, [ 10, 48, 56 ] ] ], [ 7, 4, [ 1, [ 11, 19, 26 ] ] ], [ \
2, 8, [ 1, [ 12, 41, 49 ] ] ], [ 1, 9, [ 1, [ 13, 6, 14 ] ] ], [ 4, 8, [ 1, [ 14, 34, 58 ] ] ], [ 5, 9, [ 1, [ 15, 23, 30 ] ] ], [ 3, 10, [ 1, [ 16, 40, 64 ] ] ], [ 2, 11, [ 1,\
 [ 17, 65, 113 ] ] ], [ 1, 12, [ 1, [ 18, 4, 12 ] ] ], [ 5, 10, [ 1, [ 19, 47, 55 ] ] ], [ 6, 11, [ 1, [ 20, 97, 105 ] ] ], [ 12, 7, [ 1, [ 21, 20, 27 ] ] ], [ 3, 13, [ 1, [ 22\
, 88, 96 ] ] ], [ 4, 14, [ 1, [ 23, 42, 50 ] ] ], [ 2, 15, [ 1, [ 24, 81, 89 ] ] ], [ 1, 16, [ 1, [ 25, 5, 13 ] ] ], [ 6, 13, [ 1, [ 26, 80, 136 ] ] ], [ 7, 14, [ 1, [ 27, 35, \
59 ] ] ], [ 8, 15, [ 1, [ 28, 73, 129 ] ] ], [ 9, 16, [ 1, [ 29, 22, 29 ] ] ], [ 4, 17, [ 1, [ 30, 66, 114 ] ] ], [ 5, 14, [ 1, [ 31, 39, 63 ] ] ], [ 3, 18, [ 1, [ 32, 72, 120 \
] ] ], [ 2, 19, [ 1, [ 33, 121, 145 ] ] ], [ 8, 17, [ 1, [ 34, 98, 106 ] ] ], [ 9, 14, [ 1, [ 35, 46, 54 ] ] ], [ 10, 18, [ 1, [ 36, 104, 112 ] ] ], [ 11, 19, [ 1, [ 37, 139, 1\
61 ] ] ], [ 16, 12, [ 1, [ 38, 21, 28 ] ] ], [ 5, 20, [ 1, [ 39, 87, 95 ] ] ], [ 6, 17, [ 1, [ 40, 76, 132 ] ] ], [ 7, 10, [ 1, [ 41, 43, 51 ] ] ], [ 3, 21, [ 1, [ 42, 128, 152\
 ] ] ], [ 4, 18, [ 1, [ 43, 82, 90 ] ] ], [ 10, 20, [ 1, [ 44, 79, 135 ] ] ], [ 11, 17, [ 1, [ 45, 153, 172 ] ] ], [ 12, 10, [ 1, [ 46, 36, 60 ] ] ], [ 13, 21, [ 1, [ 47, 144, \
166 ] ] ], [ 14, 18, [ 1, [ 48, 74, 130 ] ] ], [ 15, 19, [ 1, [ 49, 137, 167 ] ] ], [ 6, 20, [ 1, [ 50, 101, 109 ] ] ], [ 7, 22, [ 1, [ 51, 67, 115 ] ] ], [ 8, 13, [ 1, [ 52, 1\
02, 110 ] ] ], [ 9, 8, [ 1, [ 53, 38, 62 ] ] ], [ 4, 21, [ 1, [ 54, 122, 146 ] ] ], [ 5, 15, [ 1, [ 55, 71, 119 ] ] ], [ 20, 13, [ 1, [ 56, 157, 176 ] ] ], [ 14, 22, [ 1, [ 57,\
 99, 107 ] ] ], [ 13, 15, [ 1, [ 58, 158, 169 ] ] ], [ 16, 8, [ 1, [ 59, 45, 53 ] ] ], [ 17, 21, [ 1, [ 60, 140, 162 ] ] ], [ 14, 15, [ 1, [ 61, 103, 111 ] ] ], [ 18, 21, [ 1, \
[ 62, 138, 168 ] ] ], [ 8, 22, [ 1, [ 63, 77, 133 ] ] ], [ 9, 23, [ 1, [ 64, 86, 94 ] ] ], [ 10, 11, [ 1, [ 65, 75, 131 ] ] ], [ 7, 11, [ 1, [ 66, 83, 91 ] ] ], [ 12, 6, [ 1, [\
 67, 44, 52 ] ] ], [ 5, 19, [ 1, [ 68, 127, 151 ] ] ], [ 17, 22, [ 1, [ 69, 154, 173 ] ] ], [ 14, 23, [ 1, [ 70, 78, 134 ] ] ], [ 18, 11, [ 1, [ 71, 160, 171 ] ] ], [ 7, 19, [ \
1, [ 72, 123, 147 ] ] ], [ 16, 6, [ 1, [ 73, 37, 61 ] ] ], [ 20, 19, [ 1, [ 74, 143, 165 ] ] ], [ 12, 17, [ 1, [ 75, 84, 92 ] ] ], [ 10, 23, [ 1, [ 76, 100, 108 ] ] ], [ 11, 24\
, [ 1, [ 77, 177, 187 ] ] ], [ 12, 23, [ 1, [ 78, 68, 116 ] ] ], [ 9, 13, [ 1, [ 79, 70, 118 ] ] ], [ 23, 20, [ 1, [ 80, 156, 175 ] ] ], [ 17, 24, [ 1, [ 81, 178, 188 ] ] ], [ \
9, 21, [ 1, [ 82, 126, 150 ] ] ], [ 15, 18, [ 1, [ 83, 159, 170 ] ] ], [ 16, 20, [ 1, [ 84, 69, 117 ] ] ], [ 22, 19, [ 1, [ 85, 141, 163 ] ] ], [ 13, 24, [ 1, [ 86, 182, 192 ] \
] ], [ 15, 24, [ 1, [ 87, 183, 185 ] ] ], [ 16, 22, [ 1, [ 88, 85, 93 ] ] ], [ 20, 24, [ 1, [ 89, 181, 191 ] ] ], [ 22, 23, [ 1, [ 90, 155, 174 ] ] ], [ 12, 21, [ 1, [ 91, 124,\
 148 ] ] ], [ 23, 21, [ 1, [ 92, 142, 164 ] ] ], [ 18, 24, [ 1, [ 93, 184, 186 ] ] ], [ 22, 24, [ 1, [ 94, 179, 189 ] ] ], [ 16, 19, [ 1, [ 95, 125, 149 ] ] ], [ 23, 24, [ 1, [\
 96, 180, 190 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, g1, 1, g1, 1, 1, 1, 1, 1, g4^-1, g7^-1, 1, g4^-1, g7^-1*g1^-1, 1, 1, 1, 1, 1, g1^-1, 1, 1, 1, g8^-1, g3^-1, g6^-1, 1, g8^-1, g3^-1\
, g6^-1*g4, g7, 1, 1, 1, 1, g6^-1, 1, g4, g1*g7, 1, g6^-1, 1, 1, g5*g7*g9, g9^-1, g6*g8*g10*g2, g2^-1, 1, g5^-1, g1^-1*g9^-1*g7^-1*g5^-1, g9^-1, g2^-1*g10^-1*g8^-1*g6^-1, g2^-1\
, g8, g5^-1*g3, 1, g2, 1, 1, 1, 1, g5^-1, g2*g8, g3, g4^-1*g6, g7, 1, g5^-1, 1, g10^-1, g5^-1*g3*g6^-1*g4, g10^-1, g6*g8*g10, g4*g10, g5^-1*g3*g6^-1*g4*g7^-1*g1^-1, g8*g10, g3^\
-1*g5, g5*g7*g9, g7*g9, g2^-1*g10^-1*g8^-1*g6^-1, 1, 1, g2^-1*g10^-1*g8^-1*g6^-1*g1^-1*g9^-1*g7^-1*g5^-1, g3*g9, g8, g8*g10, g5^-1*g3, g5^-1*g3*g6^-1*g4*g7^-1*g1^-1*g8^-1*g2^-1\
, g7*g9, g5^-1*g3*g6^-1*g4*g7^-1*g1^-1*g8^-1*g2^-1*g9^-1*g3^-1 ]\n[ [ [ 1, -1 ], [ 2, 1 ], [ 3, -1 ] ], [ [ 4, -1 ], [ 1, 1 ], [ 5, -1 ] ], [ [ 2, -1 ], [ 6, 1 ], [ 7, -1 ] ], \
[ [ 3, 1 ], [ 10, 1 ], [ 8, -1 ] ], [ [ 9, -1 ], [ 4, 1 ], [ 11, -1 ] ], [ [ 5, 1 ], [ 12, 1 ], [ 14, -1 ] ], [ [ 6, -1 ], [ 13, 1 ], [ 15, -1 ] ], [ [ 7, 1 ], [ 19, 1 ], [ 16,\
 -1 ] ], [ [ 8, 1 ], [ 20, 1 ], [ 17, -1 ] ], [ [ 18, -1 ], [ 9, 1 ], [ 21, -1 ] ], [ [ 10, -1 ], [ 22, 1 ], [ 26, -1 ] ], [ [ 11, 1 ], [ 23, 1 ], [ 27, -1 ] ], [ [ 12, -1 ], [\
 24, 1 ], [ 28, -1 ] ], [ [ 13, -1 ], [ 25, 1 ], [ 29, -1 ] ], [ [ 14, 1 ], [ 34, 1 ], [ 30, -1 ] ], [ [ 15, 1 ], [ 35, 1 ], [ 31, -1 ] ], [ [ 16, 1 ], [ 36, 1 ], [ 32, -1 ] ],\
 [ [ 17, 1 ], [ 37, 1 ], [ 33, -1 ] ], [ [ 25, -1 ], [ 18, 1 ], [ 38, -1 ] ], [ [ 19, -1 ], [ 39, 1 ], [ 44, -1 ] ], [ [ 20, -1 ], [ 40, 1 ], [ 45, -1 ] ], [ [ 21, 1 ], [ 41, 1\
 ], [ 46, -1 ] ], [ [ 22, -1 ], [ 42, 1 ], [ 47, -1 ] ], [ [ 23, -1 ], [ 43, 1 ], [ 48, -1 ] ], [ [ 24, -1 ], [ 33, 1 ], [ 49, -1 ] ], [ [ 50, -1 ], [ 26, 1 ], [ 56, -1 ] ], [ \
[ 27, 1 ], [ 57, 1 ], [ 51, -1 ] ], [ [ 52, -1 ], [ 28, 1 ], [ 58, -1 ] ], [ [ 29, 1 ], [ 59, 1 ], [ 53, -1 ] ], [ [ 30, 1 ], [ 60, 1 ], [ 54, -1 ] ], [ [ 31, 1 ], [ 61, 1 ], [\
 55, -1 ] ], [ [ 32, 1 ], [ 62, 1 ], [ 42, -1 ] ], [ [ 34, -1 ], [ 63, 1 ], [ 69, -1 ] ], [ [ 35, -1 ], [ 64, 1 ], [ 70, -1 ] ], [ [ 36, -1 ], [ 65, 1 ], [ 71, -1 ] ], [ [ 66, \
-1 ], [ 72, 1 ], [ 37, -1 ] ], [ [ 38, 1 ], [ 67, 1 ], [ 73, -1 ] ], [ [ 39, -1 ], [ 68, 1 ], [ 74, -1 ] ], [ [ 67, -1 ], [ 75, 1 ], [ 40, -1 ] ], [ [ 41, -1 ], [ 66, 1 ], [ 65\
, -1 ] ], [ [ 43, -1 ], [ 54, 1 ], [ 62, -1 ] ], [ [ 76, -1 ], [ 44, 1 ], [ 80, -1 ] ], [ [ 45, 1 ], [ 81, 1 ], [ 77, -1 ] ], [ [ 46, 1 ], [ 76, 1 ], [ 78, -1 ] ], [ [ 79, 1 ],\
 [ 47, 1 ], [ 82, -1 ] ], [ [ 61, -1 ], [ 48, 1 ], [ 83, -1 ] ], [ [ 55, 1 ], [ 49, 1 ], [ 68, -1 ] ], [ [ 73, 1 ], [ 50, 1 ], [ 84, -1 ] ], [ [ 51, 1 ], [ 85, 1 ], [ 72, -1 ] \
], [ [ 53, 1 ], [ 52, 1 ], [ 79, -1 ] ], [ [ 56, 1 ], [ 86, 1 ], [ 89, -1 ] ], [ [ 57, -1 ], [ 70, 1 ], [ 90, -1 ] ], [ [ 58, 1 ], [ 87, 1 ], [ 86, -1 ] ], [ [ 59, -1 ], [ 88, \
1 ], [ 63, -1 ] ], [ [ 75, -1 ], [ 91, 1 ], [ 60, -1 ] ], [ [ 64, -1 ], [ 82, 1 ], [ 92, -1 ] ], [ [ 69, 1 ], [ 94, 1 ], [ 81, -1 ] ], [ [ 71, 1 ], [ 77, 1 ], [ 93, -1 ] ], [ [\
 84, 1 ], [ 74, 1 ], [ 95, -1 ] ], [ [ 78, 1 ], [ 92, 1 ], [ 91, -1 ] ], [ [ 80, 1 ], [ 89, 1 ], [ 96, -1 ] ], [ [ 83, 1 ], [ 93, 1 ], [ 87, -1 ] ], [ [ 88, -1 ], [ 95, 1 ], [ \
85, -1 ] ], [ [ 90, 1 ], [ 96, 1 ], [ 94, -1 ] ] ]"

gap> sign := [ 2, 4, 6 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 2 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 0);;
gap> tmg := TessellationModelGraph(cg, true : simplify := 0);;
gap> ExportString(tmg);
"[ 2, 4, 6 ]\n[ [ x^2, x*y*z, y^4, (y*z^-1)^2, z^6 ], 3 ]\n[ g1, g2, g3, g4 ] -> [ (z*y^-1)^2, (y^-1*z)^2, x*z*y^-1*z^2, (z^-1*y*z^-2)^2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1\
*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^\
2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y*x^-1, y*x^-1*y^-1*x^-1, y*(x^-1*y^-1)^2*x^-1, y*(x^-1*y^-1)^3*x^-1, y*(x^-1*y^-1)^4*x^-1, y*(x^-1*y^-1)^5*x^-1 \
]\n[ [ 1, (y^-1*x^-1)^5, y^-1, y^-1*x^-1, y^-1*(y^-1*x^-1)^2, y^-2*x^-1, (y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, (y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4\
 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^5, (y^-1*x^-1)^2, (y^-1*x^-1)^4, (y^-1*x^-1)^3 ], [ 1, x^-1, x^-1*y^-1*x^-1, y*x^-1 ] ]\n[ \"TESS\", [ 4, 6 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] \
] ] ]\n[ [ 3, 1 ], [ 3, 2 ], [ 3, 3 ], [ 3, 4 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 7 ] ] ], [ 1, 3, [ 1, [ 2, 6, 12 ] ] ], [ 2, 4, [ 1, [ 3, 13, 23 ] ] ], [ 1, 3, [ 1, [ 4, 2, 8 ] ] ], \
[ 2, 4, [ 1, [ 5, 15, 19 ] ] ], [ 3, 4, [ 1, [ 6, 14, 24 ] ] ], [ 1, 2, [ 1, [ 7, 5, 11 ] ] ], [ 3, 4, [ 1, [ 8, 18, 22 ] ] ], [ 1, 2, [ 1, [ 9, 3, 9 ] ] ], [ 3, 4, [ 1, [ 10, \
16, 20 ] ] ], [ 1, 3, [ 1, [ 11, 4, 10 ] ] ], [ 2, 4, [ 1, [ 12, 17, 21 ] ] ] ]\n[ 1, g2^-1, g2^-1, 1, 1, 1, g1^-1, g3*g4*g3^-1*g1^-1*g4^-1, g3, g3, g4, g3*g4*g3^-1 ]\n[ [ [ 1,\
 -1 ], [ 2, 1 ], [ 6, 1 ], [ 3, -1 ] ], [ [ 4, -1 ], [ 1, 1 ], [ 5, 1 ], [ 6, -1 ] ], [ [ 2, -1 ], [ 7, 1 ], [ 3, 1 ], [ 8, -1 ] ], [ [ 9, -1 ], [ 4, 1 ], [ 10, 1 ], [ 5, -1 ] \
], [ [ 7, -1 ], [ 11, 1 ], [ 8, 1 ], [ 12, -1 ] ], [ [ 11, -1 ], [ 9, 1 ], [ 12, 1 ], [ 10, -1 ] ] ]"


# Shifted cell center
gap> sign := [ 2, 3, 8 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 1 ] );;
gap> cg := TGCellGraph(tg, q, 2 : simplify := 0);;
gap> tmg := TessellationModelGraph(cg, false : simplify := 0);;
gap> ExportString(tmg);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ], 2 ]\n[ g1, g2, g3, g4 ] -> [ y*z^-2*x*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1, z^-1*x*y^-1*z^-2*x^-1*z*y, y*z^-2*x*z*y*z^-1*\
y^-1*z^-1*x*z^2*y*x^-1*z^-1*x*y^-1*z^-2*x^-1*z^-1*x*z*y*z^-1*y^-1*z^-2*x^-1*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1*z, x*z*y^-1*z^-1*x^-1*z^2*y ]\n[ 1, y, y^2, x*y, x*y^2, x*y^3, y^-1*\
x^-1, y^-1*x^-1*y, y^-1*x^-1*y^2, (x*y)^2, (x*y)^2*y, (x*y)^2*y^2, y*x*y, y*x*y^2, y*x*y^3, x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y, x^-1*y^-1*x^-1*y^2, (y^-1*x^-1)^2, (y^-1*x^-1)^2*y\
, (y^-1*x^-1)^2*y^2, y^-1*(x*y)^2, y^-1*(x*y)^2*y, y^-1*(x*y)^2*y^2, (x*y)^3, (x*y)^3*y, (x*y)^3*y^2, (y*x)^2*y, (y*x)^2*y^2, (y*x)^2*y^3, x*y*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*x^-\
1*y, x*y*x^-1*y^-1*x^-1*y^2, y*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y, y*x^-1*y^-1*x^-1*y^2, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^2*x^-1*y, (x^-1*y^-1)^2*x^-1*y^2, (y^-1*x^-1)^3, (y^-1*\
x^-1)^3*y, (y^-1*x^-1)^3*y^2, x^-1*y^-1*(x*y)^2, x^-1*y^-1*(x*y)^2*y, x^-1*y^-1*(x*y)^2*y^2, (x*y)^4, (x*y)^4*y, (x*y)^4*y^2 ]\n[ [ 1, y, y^2, y^-1*x^-1, (x*y)^2*y^2, (x*y)^2, \
y^-1*x^-1*y, y^-1*x^-1*y^2, (y^-1*x^-1)^2, (x*y)^2*y, x*y*x^-1*y^-1*x^-1, (x*y)^3*y^2, (x*y)^3, y^-1*(x*y)^2*y^2, y^-1*(x*y)^2, (y^-1*x^-1)^2*y, (y^-1*x^-1)^2*y^2, (y^-1*x^-1)^\
3, x*y*x^-1*y^-1*x^-1*y, x*y*x^-1*y^-1*x^-1*y^2, (x*y)^3*y, (y^-1*x^-1)^3*y, (y^-1*x^-1)^3*y^2, y^-1*(x*y)^2*y ], [ 1, x*y^3, x*y, x*y^2, x^-1*y^-1*x^-1, (x*y)^2*y^2, (x*y)^2, \
x^-1*y^-1*x^-1*y, x^-1*y^-1*x^-1*y^2, (x*y)^3*y, (x*y)^2*y, x*y*x^-1*y^-1*x^-1, (x*y)^3*y^2, (x*y)^3, x^-1*y^-1*(x*y)^2, (x*y)^4 ], [ 1, y^2, y, y*x*y^3, y*x*y, y*x*y^2 ] ]\n[ \
\"TESS\", [ 8, 3 ], [ \"VEF\", [ [ 2 ], [ 1 ], [ 3 ] ] ] ]\n[ [ 2, 1 ], [ 2, 2 ], [ 2, 3 ], [ 2, 4 ], [ 2, 5 ], [ 2, 6 ], [ 2, 7 ], [ 2, 8 ], [ 2, 9 ], [ 2, 10 ], [ 2, 11 ], [ \
2, 12 ], [ 2, 13 ], [ 2, 14 ], [ 2, 15 ], [ 2, 16 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 6 ] ] ], [ 1, 3, [ 1, [ 2, 2, 4 ] ] ], [ 1, 4, [ 1, [ 3, 3, 5 ] ] ], [ 2, 5, [ 1, [ 4, 7, 16 ] ] ]\
, [ 6, 2, [ 1, [ 5, 12, 15 ] ] ], [ 7, 3, [ 1, [ 6, 10, 13 ] ] ], [ 3, 8, [ 1, [ 7, 8, 17 ] ] ], [ 4, 9, [ 1, [ 8, 9, 18 ] ] ], [ 5, 10, [ 1, [ 9, 19, 37 ] ] ], [ 11, 4, [ 1, [\
 10, 11, 14 ] ] ], [ 12, 5, [ 1, [ 11, 31, 34 ] ] ], [ 13, 6, [ 1, [ 12, 27, 30 ] ] ], [ 14, 7, [ 1, [ 13, 25, 28 ] ] ], [ 6, 15, [ 1, [ 14, 24, 45 ] ] ], [ 7, 15, [ 1, [ 15, 2\
2, 43 ] ] ], [ 8, 13, [ 1, [ 16, 20, 38 ] ] ], [ 9, 14, [ 1, [ 17, 21, 39 ] ] ], [ 10, 16, [ 1, [ 18, 40, 47 ] ] ], [ 12, 8, [ 1, [ 19, 32, 35 ] ] ], [ 12, 9, [ 1, [ 20, 33, 36\
 ] ] ], [ 10, 11, [ 1, [ 21, 26, 29 ] ] ], [ 13, 16, [ 1, [ 22, 41, 48 ] ] ], [ 14, 16, [ 1, [ 23, 42, 46 ] ] ], [ 11, 15, [ 1, [ 24, 23, 44 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, 1, \
g3, 1, 1, 1, 1, g2^-1*g3^-1*g1*g2*g4^-1, 1, g4, g2^-1*g3^-1*g1*g2*g4^-1*g1^-1, g3^-1, g2^-1, g1, 1, g3^-1*g4^-1, 1, g2^-1*g3^-1 ]\n[ [ [ 1, 1 ], [ 4, 1 ], [ 9, 1 ], [ 18, 1 ], \
[ 23, -1 ], [ 13, 1 ], [ 6, 1 ], [ 2, -1 ] ], [ [ 3, 1 ], [ 8, 1 ], [ 17, 1 ], [ 23, 1 ], [ 22, -1 ], [ 12, 1 ], [ 5, 1 ], [ 1, -1 ] ], [ [ 2, 1 ], [ 7, 1 ], [ 16, 1 ], [ 22, 1\
 ], [ 18, -1 ], [ 21, 1 ], [ 10, 1 ], [ 3, -1 ] ], [ [ 5, -1 ], [ 14, 1 ], [ 15, -1 ], [ 13, -1 ], [ 17, -1 ], [ 20, -1 ], [ 11, 1 ], [ 4, -1 ] ], [ [ 6, -1 ], [ 15, 1 ], [ 24,\
 -1 ], [ 21, -1 ], [ 9, -1 ], [ 11, -1 ], [ 19, 1 ], [ 7, -1 ] ], [ [ 10, -1 ], [ 24, 1 ], [ 14, -1 ], [ 12, -1 ], [ 16, -1 ], [ 19, -1 ], [ 20, 1 ], [ 8, -1 ] ] ]"
gap> tmg := TessellationModelGraph(cg, true : simplify := 0);;
gap> ExportString(tmg);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ], 2 ]\n[ g1, g2, g3, g4 ] -> [ y*z^-2*x*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1, z^-1*x*y^-1*z^-2*x^-1*z*y, y*z^-2*x*z*y*z^-1*\
y^-1*z^-1*x*z^2*y*x^-1*z^-1*x*y^-1*z^-2*x^-1*z^-1*x*z*y*z^-1*y^-1*z^-2*x^-1*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1*z, x*z*y^-1*z^-1*x^-1*z^2*y ]\n[ 1, y, y^2, x*y, x*y^2, x*y^3, y^-1*\
x^-1, y^-1*x^-1*y, y^-1*x^-1*y^2, (x*y)^2, (x*y)^2*y, (x*y)^2*y^2, y*x*y, y*x*y^2, y*x*y^3, x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y, x^-1*y^-1*x^-1*y^2, (y^-1*x^-1)^2, (y^-1*x^-1)^2*y\
, (y^-1*x^-1)^2*y^2, y^-1*(x*y)^2, y^-1*(x*y)^2*y, y^-1*(x*y)^2*y^2, (x*y)^3, (x*y)^3*y, (x*y)^3*y^2, (y*x)^2*y, (y*x)^2*y^2, (y*x)^2*y^3, x*y*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*x^-\
1*y, x*y*x^-1*y^-1*x^-1*y^2, y*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y, y*x^-1*y^-1*x^-1*y^2, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^2*x^-1*y, (x^-1*y^-1)^2*x^-1*y^2, (y^-1*x^-1)^3, (y^-1*\
x^-1)^3*y, (y^-1*x^-1)^3*y^2, x^-1*y^-1*(x*y)^2, x^-1*y^-1*(x*y)^2*y, x^-1*y^-1*(x*y)^2*y^2, (x*y)^4, (x*y)^4*y, (x*y)^4*y^2 ]\n[ [ 1, y, y^2, y^-1*x^-1, (x*y)^2*y^2, (x*y)^2, \
y^-1*x^-1*y, y^-1*x^-1*y^2, (y^-1*x^-1)^2, (x*y)^2*y, x*y*x^-1*y^-1*x^-1, (x*y)^3*y^2, (x*y)^3, y^-1*(x*y)^2*y^2, y^-1*(x*y)^2, (y^-1*x^-1)^2*y, (y^-1*x^-1)^2*y^2, (y^-1*x^-1)^\
3, x*y*x^-1*y^-1*x^-1*y, x*y*x^-1*y^-1*x^-1*y^2, (x*y)^3*y, (y^-1*x^-1)^3*y, (y^-1*x^-1)^3*y^2, y^-1*(x*y)^2*y ], [ 1, x*y^3, x*y, x*y^2, x^-1*y^-1*x^-1, (x*y)^2*y^2, (x*y)^2, \
x^-1*y^-1*x^-1*y, x^-1*y^-1*x^-1*y^2, (x*y)^3*y, (x*y)^2*y, x*y*x^-1*y^-1*x^-1, (x*y)^3*y^2, (x*y)^3, x^-1*y^-1*(x*y)^2, (x*y)^4 ], [ 1, y^2, y, y*x*y^3, y*x*y, y*x*y^2 ] ]\n[ \
\"TESS\", [ 3, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1 ], [ 3, 2 ], [ 3, 3 ], [ 3, 4 ], [ 3, 5 ], [ 3, 6 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 6 ] ] ], [ 3, 1, [ 1, [ 2, 2,\
 4 ] ] ], [ 2, 3, [ 1, [ 3, 3, 5 ] ] ], [ 1, 4, [ 1, [ 4, 7, 16 ] ] ], [ 2, 4, [ 1, [ 5, 12, 15 ] ] ], [ 1, 5, [ 1, [ 6, 10, 13 ] ] ], [ 3, 5, [ 1, [ 7, 8, 17 ] ] ], [ 2, 6, [ \
1, [ 8, 9, 18 ] ] ], [ 1, 5, [ 1, [ 9, 19, 37 ] ] ], [ 3, 6, [ 1, [ 10, 11, 14 ] ] ], [ 4, 5, [ 1, [ 11, 31, 34 ] ] ], [ 2, 6, [ 1, [ 12, 27, 30 ] ] ], [ 1, 4, [ 1, [ 13, 25, 2\
8 ] ] ], [ 4, 6, [ 1, [ 14, 24, 45 ] ] ], [ 5, 4, [ 1, [ 15, 22, 43 ] ] ], [ 3, 6, [ 1, [ 16, 20, 38 ] ] ], [ 2, 4, [ 1, [ 17, 21, 39 ] ] ], [ 1, 3, [ 1, [ 18, 40, 47 ] ] ], [ \
5, 6, [ 1, [ 19, 32, 35 ] ] ], [ 6, 4, [ 1, [ 20, 33, 36 ] ] ], [ 3, 5, [ 1, [ 21, 26, 29 ] ] ], [ 3, 2, [ 1, [ 22, 41, 48 ] ] ], [ 2, 1, [ 1, [ 23, 42, 46 ] ] ], [ 6, 5, [ 1, \
[ 24, 23, 44 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, 1, g2^-1, 1, g2^-1, g1*g2*g4^-1, g4*g2^-1*g1^-1*g3*g2, g1*g2*g4^-1, g4*g2^-1*g1^-1*g3*g2, g1*g2, g1^-1, g3, g1*g2, g1^-1, g2^-1*g3^\
-1, g4, g2^-1*g3^-1*g1*g2*g4^-1*g1^-1, g2^-1*g3^-1 ]\n[ [ [ 1, -1 ], [ 2, -1 ], [ 3, -1 ] ], [ [ 1, 1 ], [ 5, 1 ], [ 4, -1 ] ], [ [ 2, 1 ], [ 6, 1 ], [ 7, -1 ] ], [ [ 3, 1 ], [\
 10, 1 ], [ 8, -1 ] ], [ [ 4, 1 ], [ 11, 1 ], [ 9, -1 ] ], [ [ 5, -1 ], [ 12, 1 ], [ 14, -1 ] ], [ [ 6, -1 ], [ 13, 1 ], [ 15, -1 ] ], [ [ 7, 1 ], [ 19, 1 ], [ 16, -1 ] ], [ [ \
8, 1 ], [ 20, 1 ], [ 17, -1 ] ], [ [ 21, -1 ], [ 18, -1 ], [ 9, 1 ] ], [ [ 10, -1 ], [ 21, 1 ], [ 24, -1 ] ], [ [ 11, -1 ], [ 20, -1 ], [ 19, -1 ] ], [ [ 12, -1 ], [ 22, -1 ], \
[ 16, 1 ] ], [ [ 13, -1 ], [ 23, -1 ], [ 17, 1 ] ], [ [ 15, 1 ], [ 14, 1 ], [ 24, 1 ] ], [ [ 23, 1 ], [ 18, 1 ], [ 22, 1 ] ] ]"
gap> tmg := TessellationModelGraph(cg, true : simplify := 0);;
gap> ExportString(tmg);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ], 2 ]\n[ g1, g2, g3, g4 ] -> [ y*z^-2*x*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1, z^-1*x*y^-1*z^-2*x^-1*z*y, y*z^-2*x*z*y*z^-1*\
y^-1*z^-1*x*z^2*y*x^-1*z^-1*x*y^-1*z^-2*x^-1*z^-1*x*z*y*z^-1*y^-1*z^-2*x^-1*z*y*z^-1*y^-1*z^-1*x*z^2*y*x^-1*z, x*z*y^-1*z^-1*x^-1*z^2*y ]\n[ 1, y, y^2, x*y, x*y^2, x*y^3, y^-1*\
x^-1, y^-1*x^-1*y, y^-1*x^-1*y^2, (x*y)^2, (x*y)^2*y, (x*y)^2*y^2, y*x*y, y*x*y^2, y*x*y^3, x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y, x^-1*y^-1*x^-1*y^2, (y^-1*x^-1)^2, (y^-1*x^-1)^2*y\
, (y^-1*x^-1)^2*y^2, y^-1*(x*y)^2, y^-1*(x*y)^2*y, y^-1*(x*y)^2*y^2, (x*y)^3, (x*y)^3*y, (x*y)^3*y^2, (y*x)^2*y, (y*x)^2*y^2, (y*x)^2*y^3, x*y*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*x^-\
1*y, x*y*x^-1*y^-1*x^-1*y^2, y*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y, y*x^-1*y^-1*x^-1*y^2, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^2*x^-1*y, (x^-1*y^-1)^2*x^-1*y^2, (y^-1*x^-1)^3, (y^-1*\
x^-1)^3*y, (y^-1*x^-1)^3*y^2, x^-1*y^-1*(x*y)^2, x^-1*y^-1*(x*y)^2*y, x^-1*y^-1*(x*y)^2*y^2, (x*y)^4, (x*y)^4*y, (x*y)^4*y^2 ]\n[ [ 1, y, y^2, y^-1*x^-1, (x*y)^2*y^2, (x*y)^2, \
y^-1*x^-1*y, y^-1*x^-1*y^2, (y^-1*x^-1)^2, (x*y)^2*y, x*y*x^-1*y^-1*x^-1, (x*y)^3*y^2, (x*y)^3, y^-1*(x*y)^2*y^2, y^-1*(x*y)^2, (y^-1*x^-1)^2*y, (y^-1*x^-1)^2*y^2, (y^-1*x^-1)^\
3, x*y*x^-1*y^-1*x^-1*y, x*y*x^-1*y^-1*x^-1*y^2, (x*y)^3*y, (y^-1*x^-1)^3*y, (y^-1*x^-1)^3*y^2, y^-1*(x*y)^2*y ], [ 1, x*y^3, x*y, x*y^2, x^-1*y^-1*x^-1, (x*y)^2*y^2, (x*y)^2, \
x^-1*y^-1*x^-1*y, x^-1*y^-1*x^-1*y^2, (x*y)^3*y, (x*y)^2*y, x*y*x^-1*y^-1*x^-1, (x*y)^3*y^2, (x*y)^3, x^-1*y^-1*(x*y)^2, (x*y)^4 ], [ 1, y^2, y, y*x*y^3, y*x*y, y*x*y^2 ] ]\n[ \
\"TESS\", [ 3, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1 ], [ 3, 2 ], [ 3, 3 ], [ 3, 4 ], [ 3, 5 ], [ 3, 6 ] ]\n[ [ 1, 2, [ 1, [ 1, 1, 6 ] ] ], [ 3, 1, [ 1, [ 2, 2,\
 4 ] ] ], [ 2, 3, [ 1, [ 3, 3, 5 ] ] ], [ 1, 4, [ 1, [ 4, 7, 16 ] ] ], [ 2, 4, [ 1, [ 5, 12, 15 ] ] ], [ 1, 5, [ 1, [ 6, 10, 13 ] ] ], [ 3, 5, [ 1, [ 7, 8, 17 ] ] ], [ 2, 6, [ \
1, [ 8, 9, 18 ] ] ], [ 1, 5, [ 1, [ 9, 19, 37 ] ] ], [ 3, 6, [ 1, [ 10, 11, 14 ] ] ], [ 4, 5, [ 1, [ 11, 31, 34 ] ] ], [ 2, 6, [ 1, [ 12, 27, 30 ] ] ], [ 1, 4, [ 1, [ 13, 25, 2\
8 ] ] ], [ 4, 6, [ 1, [ 14, 24, 45 ] ] ], [ 5, 4, [ 1, [ 15, 22, 43 ] ] ], [ 3, 6, [ 1, [ 16, 20, 38 ] ] ], [ 2, 4, [ 1, [ 17, 21, 39 ] ] ], [ 1, 3, [ 1, [ 18, 40, 47 ] ] ], [ \
5, 6, [ 1, [ 19, 32, 35 ] ] ], [ 6, 4, [ 1, [ 20, 33, 36 ] ] ], [ 3, 5, [ 1, [ 21, 26, 29 ] ] ], [ 3, 2, [ 1, [ 22, 41, 48 ] ] ], [ 2, 1, [ 1, [ 23, 42, 46 ] ] ], [ 6, 5, [ 1, \
[ 24, 23, 44 ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, 1, g2^-1, 1, g2^-1, g1*g2*g4^-1, g4*g2^-1*g1^-1*g3*g2, g1*g2*g4^-1, g4*g2^-1*g1^-1*g3*g2, g1*g2, g1^-1, g3, g1*g2, g1^-1, g2^-1*g3^\
-1, g4, g2^-1*g3^-1*g1*g2*g4^-1*g1^-1, g2^-1*g3^-1 ]\n[ [ [ 1, -1 ], [ 2, -1 ], [ 3, -1 ] ], [ [ 1, 1 ], [ 5, 1 ], [ 4, -1 ] ], [ [ 2, 1 ], [ 6, 1 ], [ 7, -1 ] ], [ [ 3, 1 ], [\
 10, 1 ], [ 8, -1 ] ], [ [ 4, 1 ], [ 11, 1 ], [ 9, -1 ] ], [ [ 5, -1 ], [ 12, 1 ], [ 14, -1 ] ], [ [ 6, -1 ], [ 13, 1 ], [ 15, -1 ] ], [ [ 7, 1 ], [ 19, 1 ], [ 16, -1 ] ], [ [ \
8, 1 ], [ 20, 1 ], [ 17, -1 ] ], [ [ 21, -1 ], [ 18, -1 ], [ 9, 1 ] ], [ [ 10, -1 ], [ 21, 1 ], [ 24, -1 ] ], [ [ 11, -1 ], [ 20, -1 ], [ 19, -1 ] ], [ [ 12, -1 ], [ 22, -1 ], \
[ 16, 1 ] ], [ [ 13, -1 ], [ 23, -1 ], [ 17, 1 ] ], [ [ 15, 1 ], [ 14, 1 ], [ 24, 1 ] ], [ [ 23, 1 ], [ 18, 1 ], [ 22, 1 ] ] ]"


gap> STOP_TEST("TGCellModelGraph.tst");