gap> START_TEST("HyperCells: TGSuperCellModelGraph.tst");

# Triangle group (2,8,8)
gap> sign := [ 2, 8, 8 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 6 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 5);;
gap> model := TessellationModelGraph(cg, true : simplify := 0);;
gap> sc := TGCellSymmetric(tg, TGQuotient([ 3, 11 ]), 3);;
gap> scmodel := TGSuperCellModelGraph(model, sc : simplify := 0);
TGSuperCellModelGraph( primitive cell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^3*z^-1 ] ), supercell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^-8 ] ), cell embedding = TGCellEmbedding( primiti\
ve cell = TGCellTranslationGroup( < g1, g2, g3, g4 | g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1 > ), supercell = TGCellTranslationGroup( < g1, g2, g3, g4, g5, g6 | g6*g4*g2*g1*g3*g5*g3^-1*g2^-1*g6^-1*g5^-1*g1^-1*g4^-1 > ), transversal = \
[ <identity ...>, (x^-1*y^-1)^4*x^-1 ], embedding = [ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*g4*g2^-1*g1 ] ), center \
= 3, type = [ "TESS", [ 8, 8 ], [ "VEF", [ [ 3 ], [ 1 ], [ 2 ] ] ] ], vertices = [ [ 3, 1, 1 ], [ 3, 1, 2 ] ], edges = [ [ 1, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ], <identity ...> ], [ 1, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g4^-1*g6*g2 ], \
[ 1, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g2 ], [ 1, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g4^-1*g6*g2*g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4*g1*g5*g2 ], [ 2, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ], g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4 ],\
 [ 2, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g1^-1 ], [ 2, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g3*g5^-1*g1^-1 ], [ 2, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g3*g1^-1 ] ], faces = [ ] )

gap> GetProperTriangleGroup(scmodel);
ProperTriangleGroup(2, 8, 8)
gap> PrimitiveCellRelators(scmodel);
[ x^2, x*y*z, x*z*y, y^3*z^-1 ]
gap> SuperCellRelators(scmodel);
[ x^2, x*y*z, x*z*y, y^-8 ]
gap> CellCenter(scmodel);
3
gap> GetTGPrimitiveCell(scmodel);
TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^3*z^-1 ] )
gap> GetTGSuperCell(scmodel);
TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^-8 ] )
gap> ModelType(scmodel);
[ "TESS", [ 8, 8 ], [ "VEF", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]
gap> CellVertices(scmodel);
[ [ 3, 1, 1 ], [ 3, 1, 2 ] ]
gap> CellVertexPositions(scmodel);
[ <identity ...>, x^-1 ]
gap> CellEdgeTranslations(scmodel);
[ <identity ...>, g4^-1*g6*g2, g2, g4^-1*g6*g2*g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4*g1*g5*g2, g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4, g1^-1, g3*g5^-1*g1^-1, g3*g1^-1 ]

gap> embed := CellEmbedding(scmodel);
TGCellEmbedding( primitive cell = TGCellTranslationGroup( < g1, g2, g3, g4 | g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1 > ), supercell = TGCellTranslationGroup( < g1, g2, g3, g4, g5, g6 | g6*g4*g2*g1*g3*g5*g3^-1*g2^-1*g6^-1*g5^-1*g1^-1*g\
4^-1 > ), transversal = [ <identity ...>, (x^-1*y^-1)^4*x^-1 ], embedding = [ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*\
g4*g2^-1*g1 ] )
gap> PrimitiveCellTranslationGroup(embed);
TGCellTranslationGroup( < g1, g2, g3, g4 | g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1 > )
gap> SuperCellTranslationGroup(embed);
TGCellTranslationGroup( < g1, g2, g3, g4, g5, g6 | g6*g4*g2*g1*g3*g5*g3^-1*g2^-1*g6^-1*g5^-1*g1^-1*g4^-1 > )
gap> AsQuotient(embed);
RightTransversal(Group([ x*y^-1*z^-1, y*x*z, y^-2*z*y^-1, y^-1*z*y^-2 ]),Group([ x*y^-1*z^-1, y*x*z, z*y^-1*z^-1*y, y^2*x*z*y^-1, y^-1*z*y^-1*z^-1*y^2, y^3*x*z*y^-2 ]))
gap> GetRightTransversal(embed);
[ <identity ...>, (x^-1*y^-1)^4*x^-1 ]
gap> TranslationGroupEmbedding(embed);
[ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*g4*g2^-1*g1 ]

gap> str := ExportString(scmodel);
"[ 2, 8, 8 ]\n[ [ x^2, x*y*z, x*z*y, y^3*z^-1 ], [ x^2, x*y*z, x*z*y, y^-8 ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^-1*x^-1*y*z^-1*y*z*y*x^-1, z^-1*x^-1*y*z^-1*y*z*y*x^-1*y*x*z, z*y*(x^-1*z^-1)^2*y^3*x*z, y^-1*z*y^-1*x*z ]\n[ 1, y^-1*x^-\
1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7 ]\n[ [ 1, (y^-1*x^-1)^3, y^-1*x^-1, (y^-1*x^-1)^2 ], [ 1 ], [ 1 ] ]\n[ g1, g2, g3, g4, g5, g6 ] -> [ x*y^-1*z^-1, y*x*z, z*y^-1*z^-1*y, y^\
2*x*z*y^-1, y^-1*z*y^-1*z^-1*y^2, y^3*x*z*y^-2 ]\n[ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*g4*g2^-1*g1 ]\n[ 1, (x^-1*\
y^-1)^4*x^-1 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*\
y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1*x^-1, (y^-1*x^-1)^6, (y^-1*x^-1)^2, (y^-1*x^-1)^5, (y^-1*x^-1)^3, (y^-1*x^-1)^4 ], [ 1, y^-1*x^-1 ], [ 1, x^-1 ] ]\n[ \"TESS\", [ 8, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ \
2 ] ] ] ]\n[ [ 3, 1, 1 ], [ 3, 1, 2 ] ]\n[ 1, x^-1 ]\n[ [ 1, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 1, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 1, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 1, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 2, 1, [ 1, 1\
, [ 1, [ 1, 1, 5 ] ] ] ], [ 2, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 2, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 2, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ] ]\n[ 1, g4^-1*g6*g2, g2, g4^-1*g6*g2*g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4*g1*g5*\
g2, g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4, g1^-1, g3*g5^-1*g1^-1, g3*g1^-1 ]\n[ ]"
gap> scmodel2 := ImportTGSuperCellModelGraphFromString(str, tg);
TGSuperCellModelGraph( primitive cell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^3*z^-1 ] ), supercell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^-8 ] ), cell embedding = TGCellEmbedding( primiti\
ve cell = TGCellTranslationGroup( < g1, g2, g3, g4 | g4*g1*g2^-1*g3*g4^-1*g1^-1*g2*g3^-1 > ), supercell = TGCellTranslationGroup( < g1, g2, g3, g4, g5, g6 | g6*g4*g2*g1*g3*g5*g3^-1*g2^-1*g6^-1*g5^-1*g1^-1*g4^-1 > ), transversal = \
[ <identity ...>, (x^-1*y^-1)^4*x^-1 ], embedding = [ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*g4*g2^-1*g1 ] ), center \
= 3, type = [ "TESS", [ 8, 8 ], [ "VEF", [ [ 3 ], [ 1 ], [ 2 ] ] ] ], vertices = [ [ 3, 1, 1 ], [ 3, 1, 2 ] ], edges = [ [ 1, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ], <identity ...> ], [ 1, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g4^-1*g6*g2 ], \
[ 1, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g2 ], [ 1, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g4^-1*g6*g2*g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4*g1*g5*g2 ], [ 2, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ], g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4 ],\
 [ 2, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g1^-1 ], [ 2, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g3*g5^-1*g1^-1 ], [ 2, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g3*g1^-1 ] ], faces = [ ] )
gap> scmodel = scmodel2;
true

gap> scmodelrand := RandomTGSuperCellModelGraph(model, TGQuotientRelators(tg, TGQuotient([3, 11])) : simplify := 0);
TGSuperCellModelGraph( primitive cell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^3*z^-1 ] ), supercell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^-8 ] ), cell embedding = TGCellEmbedding( primiti\
ve cell = TGCellTranslationGroup( < g1, g2, g3, g4 | g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1 > ), supercell = TGCellTranslationGroup( < g1, g2, g3, g4, g5, g6 | g6*g4*g2*g1*g3*g5*g3^-1*g2^-1*g6^-1*g5^-1*g1^-1*g4^-1 > ), transversal = \
[ <identity ...>, y^3*z^-1 ], embedding = [ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*g4*g2^-1*g1 ] ), center = 3, type \
= [ "TESS", [ 8, 8 ], [ "VEF", [ [ 3 ], [ 1 ], [ 2 ] ] ] ], vertices = [ [ 3, 1, 1 ], [ 3, 1, 2 ] ], edges = [ [ 1, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ], g1^-1*g2^-1*g4^-1*g6^-1*g4 ], [ 1, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g1^-1*g2^-1*g\
4^-1*g2 ], [ 1, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g1^-1*g2^-1*g4^-1*g6^-1*g4*g2 ], [ 1, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g1^-1*g2^-1*g4^-1*g2*g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4*g1*g5*g2 ], [ 2, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] \
], g3*g5^-1*g3^-1 ], [ 2, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g1^-1*g4^-1*g6*g4*g2*g1 ], [ 2, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g3*g5^-1*g1^-1*g4^-1*g6*g4*g2*g1 ], [ 2, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g3*g1^-1*g4^-1*g6*g4*g2*g1 ] ], \
faces = [ ] )
gap> str := ExportString(scmodelrand);
"[ 2, 8, 8 ]\n[ [ x^2, x*y*z, x*z*y, y^3*z^-1 ], [ x^2, x*y*z, x*z*y, y^-8 ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^-1*x^-1*y*z^-1*y*z*y*x^-1, z^-1*x^-1*y*z^-1*y*z*y*x^-1*y*x*z, z*y*(x^-1*z^-1)^2*y^3*x*z, y^-1*z*y^-1*x*z ]\n[ 1, y^-1*x^-\
1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7 ]\n[ [ 1, (y^-1*x^-1)^3, y^-1*x^-1, (y^-1*x^-1)^2 ], [ 1 ], [ 1 ] ]\n[ g1, g2, g3, g4, g5, g6 ] -> [ x*y^-1*z^-1, y*x*z, z*y^-1*z^-1*y, y^\
2*x*z*y^-1, y^-1*z*y^-1*z^-1*y^2, y^3*x*z*y^-2 ]\n[ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*g4*g2^-1*g1 ]\n[ 1, y^3*z^\
-1 ]\n[ 1, x, y, y^-1, z, z^-1, y^2, y*z^-1, y^-2, y^-1*z, y^3, y^2*z^-1, y^-3, y^-2*z, y^4, y^3*z^-1 ]\n[ ]\n[ \"TESS\", [ 8, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1, 1 ], [ 3, 1, 2 ] ]\n[ 1, y^3*z^-1 ]\n[ [ 1, 2, [\
 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 1, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 1, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 1, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 2, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 2, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ],\
 [ 2, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 2, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ] ]\n[ g1^-1*g2^-1*g4^-1*g6^-1*g4, g1^-1*g2^-1*g4^-1*g2, g1^-1*g2^-1*g4^-1*g6^-1*g4*g2, g1^-1*g2^-1*g4^-1*g2*g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4*g\
1*g5*g2, g3*g5^-1*g3^-1, g1^-1*g4^-1*g6*g4*g2*g1, g3*g5^-1*g1^-1*g4^-1*g6*g4*g2*g1, g3*g1^-1*g4^-1*g6*g4*g2*g1 ]\n[ ]"
gap> scmodelrand2 := ImportTGSuperCellModelGraphFromString(str, tg);
TGSuperCellModelGraph( primitive cell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^3*z^-1 ] ), supercell = TGCell( ProperTriangleGroup(2, 8, 8), [ x^2, x*y*z, x*z*y, y^-8 ] ), cell embedding = TGCellEmbedding( primiti\
ve cell = TGCellTranslationGroup( < g1, g2, g3, g4 | g4*g1*g2^-1*g3*g4^-1*g1^-1*g2*g3^-1 > ), supercell = TGCellTranslationGroup( < g1, g2, g3, g4, g5, g6 | g6*g4*g2*g1*g3*g5*g3^-1*g2^-1*g6^-1*g5^-1*g1^-1*g4^-1 > ), transversal = \
[ <identity ...>, y^3*z^-1 ], embedding = [ g1, g2, g3, g4, g5, g6 ] -> [ g1^-1*g4^-1, g1^-1*g2, g3*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g1^-1*g4^-1*g3*g2^-1*g1, g1^-1*g2*g3^-1*g4*g2^-1*g1 ] ), center = 3, type \
= [ "TESS", [ 8, 8 ], [ "VEF", [ [ 3 ], [ 1 ], [ 2 ] ] ] ], vertices = [ [ 3, 1, 1 ], [ 3, 1, 2 ] ], edges = [ [ 1, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ], g1^-1*g2^-1*g4^-1*g6^-1*g4 ], [ 1, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g1^-1*g2^-1*g\
4^-1*g2 ], [ 1, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g1^-1*g2^-1*g4^-1*g6^-1*g4*g2 ], [ 1, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g1^-1*g2^-1*g4^-1*g2*g3*g5^-1*g3^-1*g1^-1*g2^-1*g4^-1*g6^-1*g4*g1*g5*g2 ], [ 2, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] \
], g3*g5^-1*g3^-1 ], [ 2, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ], g1^-1*g4^-1*g6*g4*g2*g1 ], [ 2, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ], g3*g5^-1*g1^-1*g4^-1*g6*g4*g2*g1 ], [ 2, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ], g3*g1^-1*g4^-1*g6*g4*g2*g1 ] ], \
faces = [ ] )
gap> scmodelrand = scmodelrand2;
true

# Additional supercells (symmetric)
gap> ExportString(TGSuperCellModelGraph(model, TGCellSymmetric(tg, TGQuotient([ 5, 13 ]), 3) : simplify := 0));
"[ 2, 8, 8 ]\n[ [ x^2, x*y*z, x*z*y, y^3*z^-1 ], [ x^2, x*y*z, x*y^-2*z^-1*y, x*z*y^-1*z^-2, y^8 ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^-1*x^-1*y*z^-1*y*z*y*x^-1, z^-1*x^-1*y*z^-1*y*z*y*x^-1*y*x*z, z*y*(x^-1*z^-1)^2*y^3*x*z, y^-1*z*y^-\
1*x*z ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7 ]\n[ [ 1, (y^-1*x^-1)^3, y^-1*x^-1, (y^-1*x^-1)^2 ], [ 1 ], [ 1 ] ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> \
[ x*y^-2*z^-1*y, x*z*y^-1*z^-2, y*x*y^-1*z*y, y*x*z^2*y*x^-1, y^2*x*y^-1*z, y*z^-1*x*z^2, y^-1*z^-2*x^-1*z, z*y^-2*z^-1*y^2, z^2*y^-1*z^-2*y, y^3*x*y^-1*z*y^-1 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ g1^-1*g4^-1*g3*g4^\
-1, g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-2, (g1^-1*g2)^2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g4^-1, g1^-1*g2*g4*g1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1, g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4, g4*g3*g4^-1*g1^-1*g2*g3^-1*g4*g1, g3*g1^\
-1*g4^-1*g3*g2^-1*g1, g3*g4^-1*g1^-1*g2*g3^-1*g4*g1*g4^-1, (g1^-1*g2*g3^-1)^2*g4*g1*g2^-1*g1 ]\n[ 1, y*x^-1*y^-1*x^-1, (x^-1*y^-1)^4*x^-1, y^-1*(y^-1*x^-1)^3 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^\
-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-\
1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y*x^-1, y*x^-1*y^-1*x^-1, y*(x^-1*y^-1)^2*x^-1, y*(x^-1*y^-1)^3*x^-1, y*(x^-1*y^-1)^4*x^-1, y*(x^-1*y^-1)^5*x^-1, y*(x^-1*y^-1)^6*x^-1, y*(x^-1*\
y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^6, y^-2*x^-1, y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^2, (y^-\
1*x^-1)^4, y^-1*(y^-1*x^-1)^3 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^3, (y^-1*x^-1)^2 ], [ 1, x^-1, x^-1*y^-1*x^-1, y*x^-1 ] ]\n[ \"TESS\", [ 8, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1, 1 ], [ 3, 1, 2 ], [ 3, 1, 3 ], [ 3, 1,\
 4 ] ]\n[ 1, y*x^-1, x^-1, x^-1*y^-1*x^-1 ]\n[ [ 1, 3, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 1, 4, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 1, 4, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 1, 3, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 2, 4, [ 1, 1, [ 1, [ \
1, 1, 5 ] ] ] ], [ 2, 3, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 2, 3, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 2, 4, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 3, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 3, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 3, 2, [ 1, \
1, [ 1, [ 3, 2, 6 ] ] ] ], [ 3, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 4, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 4, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 4, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 4, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ] ]\n[\
 1, g5^-1*g10*g6, 1, g6, g7^-1*g3^-1*g4, g6*g7^-1*g3^-1*g4*g2*g9*g7*g5^-1*g10*g3*g8*g1^-1, g4, g5^-1*g10*g6*g9*g1^-1*g5^-1*g4*g1*g8^-1*g3^-1*g10^-1*g5*g7^-1*g9^-1*g2^-1*g4^-1*g3*g7*g6^-1*g2*g8*g4, g9*g1^-1*g5^-1*g4*g1*g8^-1*g3^-1*\
g10^-1*g5*g7^-1*g9^-1*g2^-1*g4^-1*g3*g7*g6^-1, 1, g1*g8^-1*g2^-1, g2^-1, g1*g8^-1*g3^-1*g10^-1*g5, g7, g9*g7, g1*g7 ]\n[ ]"
gap> ExportString(TGSuperCellModelGraph(model, TGCellSymmetric(tg, TGQuotient([ 9, 20 ]), 3) : simplify := 0));
"[ 2, 8, 8 ]\n[ [ x^2, x*y*z, x*z*y, y^3*z^-1 ], [ x^2, x*y*z, x*y^-2*z^-1*y, y^8, z^8 ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^-1*x^-1*y*z^-1*y*z*y*x^-1, z^-1*x^-1*y*z^-1*y*z*y*x^-1*y*x*z, z*y*(x^-1*z^-1)^2*y^3*x*z, y^-1*z*y^-1*x*z ]\n[\
 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7 ]\n[ [ 1, (y^-1*x^-1)^3, y^-1*x^-1, (y^-1*x^-1)^2 ], [ 1 ], [ 1 ] ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10, g11, g12, g13,\
 g14, g15, g16, g17, g18 ] -> [ x*y^-2*z^-1*y, y*x*y^-1*z*y, y^2*x*y^-1*z, z*y^-2*z^-1*y^2, z^-1*x*y^-1*z*y*x^-1, x*z*y^-2*z^-2*y, y*x*z*y^-1*z*y*z^-1, y^3*x*y^-1*z*y^-1, y^2*z^-1*x*y^-1*z^2, y*z^-1*x*y^-1*z^2*y, y^-2*(y^-1*z)^2*y\
^-2, y^-1*(y^-1*z^2)^2*y^-1, (z^3*y^-1)^2, z^-1*x*z*y^-1*z*y*z^-1*x^-1, z^-2*x*y^-1*z^2*y*x^-1, (z^-3*y)^2, y*x*z^2*y^-1*z*y*z^-2, y*z^-1*x*z*y^-1*z^2*y*z^-1 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10, g11, g12, g13, g14, g15, g\
16, g17, g18 ] -> [ g1^-1*g4^-1*g3*g4^-1, (g1^-1*g2)^2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g4^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1, g3*g1^-1*g4^-1*g3*g2^-1*g1, g2^-1*g1*g4*g1, g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g4^-1*g1^-1*\
g2*g3^-1*g4*g1*g4^-1, g1^-1*g2*g4*g3^-1, (g1^-1*g2*g3^-1)^2*g4*g1*g2^-1*g1, g1^-1*g2*g4^-1*g3, g1^-1*g2*(g1^-1*g4^-1*g3*g2^-1*g1*g4)^2*g3^-1*g4^-1, g1^-1*g2*g3^-1*g4*g1*g4*g2^-1*g1, g1^-1*g2*g3^-1*g4*g1*g2^-1*g4^-1*g3*g4^-1*g1^-1*\
g2*g3^-1*g4*g1*g2^-1*g1, (g3*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1)^2, g2^-1*g4^-1*g3^2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4^-1*g1^-1*g2*g3^-1*(g4*g1)^2, g4^-2, g1^-1*g2*g3*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1, (g1^-1*g2*g1^-1*g4^-1*\
g3*g2^-1*g1*g4)^2*g3^-2 ]\n[ 1, y*x^-1*y^-1*x^-1, x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^5*x^-1, y^-1*(y^-1*x^-1)^3 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x\
^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-\
1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y\
^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y*x^-1, y*x^-1*y^-1*x^-1, y*(x^-1*y^-1)^2*x^-1, y*(x^-1*y^-1)^3*x^-1, y*(x^-1*y^-1)^4*x^-1, y*(x^-1*y^-1)^5*x^-1, y*(x^-1*y^-1)^6*x^-1, y*(x^-1*y^-1)^7*x^-1, x^-1*y^-1, \
x^-1*y^-2*x^-1, x^-1*y^-1*(y^-1*x^-1)^2, x^-1*y^-1*(y^-1*x^-1)^3, x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y\
^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)\
^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, x*y*x^-1, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^6, y^-2*x^-1, y^-1*(y^-1*x^-1)\
^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^6*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*\
y^-1*(y^-1*x^-1)^7, x*y*(x^-1*y^-1)^4*x^-1, (y^-1*x^-1)^3, x*y*(x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^5*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^3, (y^-1*x^-1)^4, y^-1*(y^-1*x^\
-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x*y*(x^-1*y^-1)^3*x^-1 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, (y^-1*x^-1)^2, (y^-1*x^-1)^6, (y^-1*x^-1)^3, (y^-1*x^-1)^5, (y^-1*x^-1)^4 ], [ 1, x^-1, (x^-1*y^-1)^3*x^-1, x^-1*y^-1, x^-1*y^-1*x^-1, y\
*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1 ] ]\n[ \"TESS\", [ 8, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1, 1 ], [ 3, 1, 2 ], [ 3, 1, 3 ], [ 3, 1, 4 ], [ 3, 1, 5 ], [ 3, 1, 6 ], [ 3, 1, 7 ], [ 3, 1, 8 ] ]\n[ 1, y*x^-1, x^-1\
*y^-1, (x^-1*y^-1)^2*x^-1, x^-1, y*x*y*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^3*x^-1 ]\n[ [ 1, 5, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 1, 8, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 1, 7, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 1, 4, [ 1, 1, [ 1, [ 4,\
 3, 7 ] ] ] ], [ 2, 7, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 2, 5, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 2, 4, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 2, 8, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 3, 8, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 3, 4, [ 1, 1,\
 [ 1, [ 2, 4, 8 ] ] ] ], [ 3, 5, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 3, 7, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 4, 6, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 4, 3, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 4, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 4, \
1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 5, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 5, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 5, 3, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 5, 6, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 6, 4, [ 1, 1, [ 1, [ 1, 1, 5 ] ] \
] ], [ 6, 7, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 6, 8, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 6, 5, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 7, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 7, 6, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 7, 1, [ 1, 1, [ 1, [ 3,\
 2, 6 ] ] ] ], [ 7, 3, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 8, 3, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 8, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 8, 6, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 8, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ] ]\n[ 1, 1, 1, 1,\
 g5, g12^-1*g1^-1, g15, g13*g14^-1*g5*g15^-1*g16*g6^-1*g5^-1*g9^-1*g17*g7^-1*g2*g10^-1*g12^-1*g4^-1*g2^-1*g8^-1*g3*g14*g6*g1^-1*g3^-1*g11^-1*g8*g18*g4*g11*g9*g15, g16*g2^-1, g9^-1, 1, g3^-1, g6*g1^-1*g3^-1*g9, g7*g4*g11*g9, g1*g11\
*g9, g4*g11*g9, g13, 1, g9*g5*g6*g16^-1*g15*g5^-1*g14, 1, g9^-1*g11^-1*g4^-1*g18^-1*g8^-1*g11*g3*g1*g6^-1, g3^-1*g11*g3*g1*g6^-1, g16*g10^-1*g8^-1*g11*g3*g1*g6^-1, g8^-1*g11*g3*g1*g6^-1, g1*g4^-1*g2^-1*g8^-1*g3, g14^-1, g7^-1*g2*g\
10^-1*g12^-1*g4^-1*g2^-1*g8^-1*g3, g17*g7^-1*g2*g10^-1*g12^-1*g4^-1*g2^-1*g8^-1*g3, g9*g5*g6*g16^-1, g16^-1, g6*g16^-1, g1*g16^-1 ]\n[ ]"

# Additional supercells (non-symmetric)
gap> ExportString(RandomTGSuperCellModelGraph(model, TGQuotientRelators(tg, TGQuotient([17, 29])) : simplify := 0));
"[ 2, 8, 8 ]\n[ [ x^2, x*y*z, x*z*y, y^3*z^-1 ], [ x^2, x*y*z, x*z*y^-2*z^-2*y, y^8, (y*z^-1*y^2)^2, z^8 ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^-1*x^-1*y*z^-1*y*z*y*x^-1, z^-1*x^-1*y*z^-1*y*z*y*x^-1*y*x*z, z*y*(x^-1*z^-1)^2*y^3*x*z, y^\
-1*z*y^-1*x*z ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7 ]\n[ [ 1, (y^-1*x^-1)^3, y^-1*x^-1, (y^-1*x^-1)^2 ], [ 1 ], [ 1 ] ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g\
10, g11, g12, g13, g14, g15, g16, g17, g18, g19, g20, g21, g22, g23, g24, g25, g26, g27, g28, g29, g30, g31, g32, g33, g34 ] -> [ x*y^-1*z*y^-1*z^-1*y*z^-1, x*z*y^-2*z^-2*y, y*x*y^-1*z^2*y^2*x^-1, y*x*z*y^-1*z*y*z^-1, y^2*x*z*y^-1\
*z*y*x^-1, y^2*z^-1*x*y^-1*z^2, y*z^-1*x*y^-1*z^2*y, y*z^-1*y*x*z*y^-1*z, (y^-2*z*y^-1)^2, y^-2*z^-2*y*x^-1*z, (y^-1*z*y^-2)^2, y^-1*(z*y^-1*z)^2*y^-1, y^-1*z^-1*y*z^-1*x^-1*y^-1*z, (z*y^-3)^2, z*y^-1*(y^-1*z)^2*z*y^-1, (z*y^-1)^4\
, z^2*y^-2*z^-2*y^2, (z^3*y^-1)^2, z^-1*x*z*y^-1*z*y*z^-1*x^-1, (z^-1*y^3)^2, z^-1*y*(y*z^-1)^2*z^-1*y, z^-2*x*y^-1*z^2*y*x^-1, (z^-3*y)^2, x*y^-1*(y^-1*z)^2*z*y^-2, x*z^2*y^-2*z^-2*y^2*x^-1, y^2*x*(y^-1*z)^2*y^2*x^-1, y^3*x*z*y^-\
1*z*y*x^-1*y^-1, y*z^-1*x*z*y^-1*z^2*y*z^-1, y*z^-2*x*y^-1*z^2*y*x^-1*y^-1, y^-3*z^-2*y*x^-1*z*y, y^-1*z^-1*x*z*y^-1*z*y*z^-2, y^-1*(z^-3*y)^2*y, z^-1*y^2*x*z*y^-1*z*y*x^-1*z, x*y^-3*z^-2*y*x^-1*z*y*x^-1 ]\n[ g1, g2, g3, g4, g5, g\
6, g7, g8, g9, g10, g11, g12, g13, g14, g15, g16, g17, g18, g19, g20, g21, g22, g23, g24, g25, g26, g27, g28, g29, g30, g31, g32, g33, g34 ] -> [ g1^-1*g4^-1*g3*g4^-1*g1^-1*g2*g3^-1*g4*g1*g3^-1, g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4\
*g3^-1*g4^-1*g1^-1*g2*g3^-1*g4*g1*g4^-1, (g1^-1*g2)^2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-2*g4*g1, g1^-1*g2*g4*g3^-1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1*g4*g1, g1^-1*g2*g4^-1*g3, g1^-1*g2*(g1^-1*g4^-1*g3*g2^-1*g1*g4)^2*g3^-1*\
g4^-1, g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g3*g4^-1*g1^-1*g2*g3^-1*g4*g1, g1^-1*g2*(g3^-1*g4*g1)^2*g2^-1*g1, g4*g3^-1*g1^-1*g2, (g4*g2^-1*g1)^2, g4*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g4*g3*g4^-1*g1^\
-1*g2*g3^-1*g4*g1*g2^-1*g1*g4^-1*g1^-1*g2*g3^-1*g4*g1, (g3*g2^-1*g1)^2, g3*g2^-1*g4^-1*g3*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g3*g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g3*g4^-1*g1^-1*g2*g3^\
-1*g4*g2*g1^-1*g4^-1*g3*g2^-1*g1, (g3*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1)^2, g2^-1*g4^-1*g3^2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1, g1^-1*(g4^-1*g3*g2^-1)^2*g1, g1^-1*g4^-1*g3*g2^-1*g1*g4*g3*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1*g4^\
-1, g4^-1*g1^-1*g2*g3^-1*(g4*g1)^2, g4^-2, g1^-1*g4^-1*g3*g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g2^-1*g1, g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g2^-1*g1*g3^-1*g4*g1, g1^-1*g2*g4^-1*g1^-1*g2*g3^-1*g4*g1*g4*g3^-1*g4*g1, g1^-\
1*g2*g3^-1*g4*(g2^-1*g1)^2, (g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4)^2*g3^-2, g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g1^-1*g2*g3^-1*g4*(g1*g2^-1)^2*g1, g1^-1*g2*g3^-1*g4*g1*g4^-1*g1^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1*g4^-1, g4\
*g3*g4^-1*g1^-1*g2*g3^-1*g4*g1*g2^-1*g1*g3*g1^-1*g4^-1*g3*g2^-1*g1*g4*g3^-1, g4*g3^2*g4^-1, g1^-1*g4^-1*g3*g2^-1*g1*g3*g4^-1*g1^-1*g2*g3^-1*g4*g2, (g1^-1*g4^-1*g3)^2*g2^-1*g1*g4*g3^-1*(g4*g1)^2 ]\n[ 1, y*x*z, z^-1*x*y^-1, y^2*z^-1\
*y, x*y^-1*z^-1, y^-1*z^-1*x, y*z^-3, (x*y^-1*z^-1)^2, y^3*z^-1, x*y^-2*z^-1*y, x*z*y^-1*z^-2, x*y^-2*z^2, y^-1*z^3, y*z^-1*y^2, y^-2*z^2*y^-1*z^-1, y^-3*z ]\n[ 1, x, y^-1*z^-1, x*y^-1*z^-1, y*x*y^-1, z^-1*x*y^-1, y*x*z, z^-1*x*z,\
 y^-1*z^-1*x, x*y^-1*z^-1*x, x*y^-2*z^-1*y, y^-2*z^-1*y, y^-1*z^-1*x*y^-1*z^-1, (x*y^-1*z^-1)^2, z*y^-1*z^-2, x*z*y^-1*z^-2, y, z^-1, y*x, z^-1*x, y^-1*z^-1*y*x, y^2*x*y^-1, y^-1*z^-1*y, x*y^-1*z^-1*y, y^-1*z^-2, x*y^-1*z^-2, y*x*\
y^-1*z^-1, z^-1*x*y^-1*z^-1, y*x*y^-1*z^-1*x, z^-1*x*y^-1*z^-1*x, y*z^-1*x*z, z^-2*x*z, y^-1, x*y^-1, z, x*z, y^-2*z^-1, x*y^-2*z^-1, y^-2*z^-1*x, y*x*y^-2, y^-1*z^-1*x*y^-1, x*y^-1*z^-1*x*y^-1, z*y^-1*z^-1, x*z*y^-1*z^-1, y*x*z^2\
, z^-1*x*z^2, y^-1*z^-1*x*z, x*y^-1*z^-1*x*z, y^2, z^-1*y, y*z^-1, z^-2, y^2*x, z^-1*y*x, y^-1*z^-1*y^2, x*y^-1*z^-1*y^2, y*x*y^-1*z^-1*y, z^-1*x*y^-1*z^-1*y, y*z^-1*x, z^-2*x, y^-1*z^-3, x*y^-1*z^-3, y*x*y^-1*z^-2, y^-1*z^-3*x, y\
^-2, x*y^-2, y^-3*z^-1, x*y^-3*z^-1, y^-1*z, x*y^-1*z, z*y^-1, x*z*y^-1, z^2, x*z^2, y*x*y^-2*z, y^-2*z^-1*x*z, y*x*z^2*y^-1, y^-1*z^-1*x*z^2, z^2*y^-1*z^-1, x*z^2*y^-1*z^-1, y^3, z^-1*y^2, y^3*x, z^-1*y^2*x, y^2*z^-1, z^-1*y*z^-1\
, z^-2*y, y*z^-1*y, y*z^-2, z^-3, y^-2*z^2*y^-1, x*y^-2*z^2*y^-1, y^-2*z^3, x*y^-2*z^3, y*z^-2*x, z^-3*x, y^-3, x*y^-3, y^-2*z, x*y^-2*z, z*y^-1*z, y^-1*z*y^-1, z*y^-2, y^-1*z^2, y^3*z^-2, y^-1*z^2*y^-1*z^-1, z^2*y^-1, x*z^2*y^-1,\
 z^3, x*z^3, y*x*y^-2*z^2, y^-2*z^-1*x*z^2, y^4, y^-3*z, y^3*z^-1, y^-1*z^2*y^-1, y*z^-1*y^2, y^2*z^-2, y^-2*z^2, x*y^-2*z^2, y*z^-2*y, y^-1*z^3, (y*z^-1)^2, y^2*z^-1*y, y*z^-3, z^4, y^-2*z^2*y^-1*z^-1, x*y^-2*z^2*y^-1*z^-1 ]\n[ ]\
\n[ \"TESS\", [ 8, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1, 1 ], [ 3, 1, 2 ], [ 3, 1, 3 ], [ 3, 1, 4 ], [ 3, 1, 5 ], [ 3, 1, 6 ], [ 3, 1, 7 ], [ 3, 1, 8 ], [ 3, 1, 9 ], [ 3, 1, 10 ], [ 3, 1, 11 ], [ 3, 1, 12 ], [ 3, \
1, 13 ], [ 3, 1, 14 ], [ 3, 1, 15 ], [ 3, 1, 16 ] ]\n[ 1, y*x*z, z^-1*x*y^-1, y^2*z^-1*y, x*y^-1*z^-1, y^-1*z^-1*x, y*z^-3, (x*y^-1*z^-1)^2, y^3*z^-1, x*y^-2*z^-1*y, x*z*y^-1*z^-2, x*y^-2*z^2, y^-1*z^3, y*z^-1*y^2, y^-2*z^2*y^-1*z\
^-1, y^-3*z ]\n[ [ 1, 7, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 1, 13, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 1, 14, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 1, 4, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 2, 14, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 2, 15, [\
 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 2, 16, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 2, 13, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 3, 12, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 3, 4, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 3, 7, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ]\
 ], [ 3, 9, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 4, 11, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 4, 3, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 4, 6, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 4, 1, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 5, 13, [ 1, 1, [ 1, [ 1\
, 1, 5 ] ] ] ], [ 5, 16, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 5, 15, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 5, 14, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 6, 9, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 6, 7, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 6, 4, [ 1\
, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 6, 12, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 7, 1, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 7, 6, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 7, 3, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 7, 11, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ],\
 [ 8, 16, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 8, 9, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 8, 12, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 8, 15, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 9, 6, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 9, 8, [ 1, 1, [ 1, [ 2, \
4, 8 ] ] ] ], [ 9, 10, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 9, 3, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 10, 15, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 10, 12, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 10, 9, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 10, 16, \
[ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 11, 4, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 11, 14, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 11, 13, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 11, 7, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 12, 3, [ 1, 1, [ 1, [ 1, 1, 5 \
] ] ] ], [ 12, 10, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 12, 8, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 12, 6, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 13, 5, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 13, 1, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 13, 11, [ 1, \
1, [ 1, [ 3, 2, 6 ] ] ] ], [ 13, 2, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 14, 2, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 14, 11, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 14, 1, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 14, 5, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] \
], [ 15, 10, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 15, 2, [ 1, 1, [ 1, [ 2, 4, 8 ] ] ] ], [ 15, 5, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 15, 8, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ], [ 16, 8, [ 1, 1, [ 1, [ 1, 1, 5 ] ] ] ], [ 16, 5, [ 1, 1, [ 1,\
 [ 2, 4, 8 ] ] ] ], [ 16, 2, [ 1, 1, [ 1, [ 3, 2, 6 ] ] ] ], [ 16, 10, [ 1, 1, [ 1, [ 4, 3, 7 ] ] ] ] ]\n[ g18, 1, g9*g8, g11*g6, g9*g8, g32*g10, g20*g30*g31*g18*g29*g27^-1*g20^-1*g34*g5^-1*g14^-1*g15*g7*g30^-1*g9*g3*g26^-1*g5*g2*\
g21^-1*g33*g19*g25*g3^-1*g29^-1*g15^-1*g1^-1*g22^-1*g6^-1*g11^-1*g12*g16^-1*g28^-1*g12^-1*g2^-1*g19^-1*g8^-1*g9^-1*g17^-1*g31^-1*g13*g21*g23^-1*g22*g34^-1*g24*g6*g10^-1*g11*g26*g1*g16*g8*g13^-1*g14*g27*g4*g17*g32^-1*g7^-1*g28*g4^-\
1*g24^-1*g25^-1*g18^-1*g23*g32*g10, g23*g32*g10, g6^-1*g24^-1*g3^-1, g11, g18, g14, g28^-1*g12^-1, g4*g16*g12^-1, g1*g16*g12^-1, g16*g12^-1, g23, g13^-1, g32*g17^-1*g4^-1*g27^-1*g14^-1, g9*g8*g13^-1, g14*g5, g18*g15^-1*g1^-1, g11*\
g6*g22, g6^-1*g24^-1*g3^-1*g29^-1*g15^-1*g1^-1, 1, g18^-1, g24^-1*g25^-1*g18^-1, g28^-1*g12^-1*g2^-1*g18^-1, g20*g30, g14*g27*g29^-1*g18^-1*g31^-1, g6^-1*g24^-1*g3^-1*g29^-1*g18^-1*g31^-1, g32*g17^-1*g4^-1*g29^-1*g18^-1*g31^-1, g1\
, g31*g18*g29*g27^-1*g20^-1*g34*g5^-1*g14^-1, g11*g26*g3^-1*g9^-1*g30*g7^-1*g15^-1, g4*g28^-1*g7*g32*g17^-1*g4^-1*g27^-1*g14^-1*g13*g8^-1*g16^-1*g1^-1*g26^-1*g11^-1*g10*g6^-1*g24^-1*g34*g22^-1*g23*g21^-1*g13^-1*g31*g17*g9*g8*g19*g\
2*g12*g28*g16*g12^-1*g11*g6*g22*g1*g15*g29*g3*g25^-1*g19^-1*g33^-1*g21*g2^-1*g5^-1*g26*g3^-1*g9^-1*g30*g7^-1*g15^-1, g32*g17^-1*g4^-1*g27^-1*g14^-1*g13*g8^-1*g16^-1*g1^-1*g26^-1*g11^-1, g6^-1*g24^-1*g25^-1*g19^-1*g33^-1*g21*g2^-1*\
g5^-1*g11^-1, g14*g11^-1, g21*g2^-1*g5^-1*g11^-1, g12*g16^-1, g9*g28, g23*g7^-1*g28, g18*g28, g6, g11*g26*g24*g6, g31*g18*g29*g27^-1*g20^-1*g24*g6, g24*g6, g13*g21*g23^-1, g23^-1, g28^-1*g12^-1*g23^-1, g10^-1*g23^-1, g10^-1, g28^-\
1*g12^-1*g2^-1*g19^-1*g8^-1*g9^-1, g17, g31*g17, g11*g5*g2*g21^-1*g33*g19*g25*g3^-1*g29^-1*g15^-1*g1^-1*g22^-1*g6^-1*g11^-1*g12*g16^-1*g28^-1*g12^-1*g2^-1*g19^-1*g8^-1*g9^-1*g17^-1*g31^-1*g13*g21*g23^-1*g22*g34^-1*g24*g6*g10^-1*g1\
1*g26*g1*g16*g8*g13^-1*g14*g27*g4*g17*g32^-1, g10^-1*g11*g26*g1*g16*g8*g13^-1*g14*g27*g4*g17*g32^-1, g13*g21*g23^-1*g22*g34^-1*g24*g6*g10^-1*g11*g26*g1*g16*g8*g13^-1*g14*g27*g4*g17*g32^-1, g31*g18*g29*g27^-1*g20^-1*g24*g6*g10^-1*g\
11*g26*g1*g16*g8*g13^-1*g14*g27*g4*g17*g32^-1, g31*g18*g29*g27^-1*g20^-1, g30^-1*g20^-1, g10^-1*g20^-1, g11*g26*g3^-1*g9^-1*g20^-1 ]\n[ ]"

# NNN-{8,3}-tess
gap> sign := [ 2, 3, 8 ];;
gap> tg := ProperTriangleGroup(sign);;
gap> q := TGQuotient( [ 2, 1 ] );;
gap> cg := TGCellGraph(tg, q, 3 : simplify := 3);;
gap> model := TessellationModelGraph(cg, false : simplify := 0);;
gap> AddOrientedNNNEdgesToTessellationModelGraph(model);
gap> sc := TGCellSymmetric(tg, TGQuotient([ 5, 1 ]), 3);;
gap> scmodel := TGSuperCellModelGraph(model, sc : simplify := 1);;
gap> ExportString(scmodel);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ], [ x^2, y^3, x*y*z, z^8, z^3*y*z^-1*x*z*y^-1*x*y^-1*z^-2*x ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^2*y^-1*z^-1*x^-1*z^2*y^-1, z*y^-1*z^-1*x*z^2*y*x^-1, y^-1*z^-1*x*z^2*y*x^-1*z,\
 y^-1*z^-2*x*z*y*z^-1*x^-1*y*z^-2*x*z*y*z^-2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*\
x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-\
1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^\
-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-\
1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, (y^-1*x^-1*y^-1)^2\
*x^-1*y^-1*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y\
^-1*x^-1)^5, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^6 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y\
^-1)^4*x^-1, (y^-1*x^-1)^3, x*y*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (y^-1*x^-1)^5, x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^4 ], [ 1, x^-1, (x^-1*y^-1)^3*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1 \
] ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ z*y^-1*z^-3*x*z^2*y*z^-2*x^-1, z^2*y^-1*z^-2*x*z^3*y*z^-1*x^-1, z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*z^-1, z^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y, z^-2*x*z*y^-1*z^-3*x^-1*z^2*y, z^-2*x*z^2*y\
^-1*z^-2*x^-1*z^2*y^-1, z^-3*x*z*y^-1*z^-3*x^-1*z*y^-1, x*y^-1*z^-2*x*z^3*y*z^-1*x^-1*z*y^-1, x*z*y^-1*z^-2*x*z^3*y*z^-1*x^-1*y^-1, y^-1*z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*x^-1*y^-1 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ g\
2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g1, g2*g3^-1*g4*g1, g3^-1*g4*g1*g2^-1, g2^-1*g4^-1, g3^-1*g2*g1^-1*g4^-1, g3^-1*g1, g3^-1*g2*g1^-1*g4^-1*(g3*g2^-1*g1)^2, g2^-1*g3*g2^-1*g1, g1^-1*g4^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1, g3*g1^-1*g4^-1*g3*g2\
^-1*g1 ]\n[ 1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x\
^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x\
^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-\
1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2\
*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1\
*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1\
*y^-1)^2*x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*(y^-1*x^-1\
*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(x*y)^2*x^-1,\
 y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (x\
*y)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^2*y*x^-1, (y*x)^2*y*\
x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^2*y*(x^-1*y^-1)^7*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)\
^2*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-\
1*y^-1)^2, y*(x^-1*y^-1)^2*y^-1*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y*x^-1*\
y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*\
x^-1, (x^-1*y^-1)^3*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x\
^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*x^-1, x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*y^-1*(\
x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^3*x^-1, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-\
1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1\
*x^-1, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*x^-1, y^-1*x*y*(x^-1*y^-1)^2, y^-1*x*y*(x^-1*y^-1\
)^2*y^-1*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x*y*(x^-\
1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^3, y*(x^-1*y^-1)^3*y^-1*x^-1, y*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y\
^-1)^2*x^-1, y*(x^-1*y^-1)^3*(y^-1*x^-1)^6, y*(x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x\
^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*\
y^-1*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*\
x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*x*y*x^-1*y^-1*(x*y)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^3*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2\
*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-\
1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, y^-1*(y^-1*x^-1)^3, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, (y^-1*x^-1)^4, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1*y^-1)^2*x^-1\
, y^-1*(x*y)^2*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2\
*(y^-1*x^-1)^7, y^-1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, y^-1*\
(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*x*y*(x^-1*y^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*\
x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(\
y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1,\
 (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x^-1\
*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1\
*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, ((y^-1*x^-1)^2*y^\
-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-\
1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^\
-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^2, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^\
-1)^7*x^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, (x^-1*y^-1)^2*y^-1*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (y^-1*x^-1)^4, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-\
1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^3*y^-1*x^-1, x^-\
1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1,\
 (x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-\
1)^2*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^7*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5\
*x^-1 ], [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, \
(y*x)^2*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1*y^-1*x^-1, (y*x)^2*y*x^-1, (x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^3*y*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-\
1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1 ] ]\n[ \"TESS\", [ 8, 3 ], [ \"VEF\", [ [ 2 ], [ 1 ], [ 3 ] ] ] ]\n[ [ 2, 1, 1 ], [ 2, 2, 1 ], [ 2, 3, 1 ], [ 2, 4, 1 ], [ 2, 5, 1 ], [ 2, 6, 1 ], [ 2, 7, \
1 ], [ 2, 8, 1 ], [ 2, 9, 1 ], [ 2, 10, 1 ], [ 2, 11, 1 ], [ 2, 12, 1 ], [ 2, 13, 1 ], [ 2, 14, 1 ], [ 2, 15, 1 ], [ 2, 16, 1 ], [ 2, 1, 2 ], [ 2, 2, 2 ], [ 2, 3, 2 ], [ 2, 4, 2 ], [ 2, 5, 2 ], [ 2, 6, 2 ], [ 2, 7, 2 ], [ 2, 8, 2 \
], [ 2, 9, 2 ], [ 2, 10, 2 ], [ 2, 11, 2 ], [ 2, 12, 2 ], [ 2, 13, 2 ], [ 2, 14, 2 ], [ 2, 15, 2 ], [ 2, 16, 2 ], [ 2, 1, 3 ], [ 2, 2, 3 ], [ 2, 3, 3 ], [ 2, 4, 3 ], [ 2, 5, 3 ], [ 2, 6, 3 ], [ 2, 7, 3 ], [ 2, 8, 3 ], [ 2, 9, 3 ],\
 [ 2, 10, 3 ], [ 2, 11, 3 ], [ 2, 12, 3 ], [ 2, 13, 3 ], [ 2, 14, 3 ], [ 2, 15, 3 ], [ 2, 16, 3 ], [ 2, 1, 4 ], [ 2, 2, 4 ], [ 2, 3, 4 ], [ 2, 4, 4 ], [ 2, 5, 4 ], [ 2, 6, 4 ], [ 2, 7, 4 ], [ 2, 8, 4 ], [ 2, 9, 4 ], [ 2, 10, 4 ], \
[ 2, 11, 4 ], [ 2, 12, 4 ], [ 2, 13, 4 ], [ 2, 14, 4 ], [ 2, 15, 4 ], [ 2, 16, 4 ] ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^4*x^-1, (\
y^-1*x^-1)^3, x*y*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (y^-1*x^-1)^5, x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^4, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, x^-1\
*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^3*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, x*y*x*y*(x^-1\
*y^-1)^7*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^3*x^-1*y^-1*x^-1, (x^-1*y^-1)^2*y^-1*x^-1, (x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y\
^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*x^\
-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*(x^-1*y^-1)^2, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^\
-1)^4, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, x^-1*y^-1*x^-\
1*y^-1*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^2, (x^-1*y^-1)^3*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x*y*x*y*(x^-1*y^-1)^6*x^-1, (x*y)^2*x^-1, (x^-1*y^-1)^3, (x*y)^2*(x^-1*\
y^-1)^2*x^-1, (x*y)^3*x^-1 ]\n[ [ 1, 2, [ 1, 2, [ 1, [ 1, 1, 9 ] ] ] ], [ 3, 1, [ 3, 1, [ 1, [ 2, 8, 16 ] ] ] ], [ 1, 4, [ 1, 4, [ 1, [ 3, 17, 32 ] ] ] ], [ 2, 5, [ 2, 5, [ 1, [ 4, 2, 10 ] ] ] ], [ 2, 6, [ 2, 6, [ 1, [ 5, 18, 25 ]\
 ] ] ], [ 7, 3, [ 7, 3, [ 1, [ 6, 7, 15 ] ] ] ], [ 3, 8, [ 3, 8, [ 1, [ 7, 24, 31 ] ] ] ], [ 4, 57, [ 4, 9, [ 1, [ 8, 33, 45 ] ] ] ], [ 5, 10, [ 5, 10, [ 1, [ 9, 3, 11 ] ] ] ], [ 11, 20, [ 11, 4, [ 1, [ 10, 36, 48 ] ] ] ], [ 5, 12\
, [ 5, 12, [ 1, [ 11, 19, 26 ] ] ] ], [ 13, 54, [ 13, 6, [ 1, [ 12, 37, 41 ] ] ] ], [ 14, 7, [ 14, 7, [ 1, [ 13, 6, 14 ] ] ] ], [ 6, 31, [ 6, 15, [ 1, [ 14, 34, 46 ] ] ] ], [ 7, 15, [ 7, 15, [ 1, [ 15, 23, 30 ] ] ] ], [ 8, 29, [ 8\
, 13, [ 1, [ 16, 40, 44 ] ] ] ], [ 14, 9, [ 14, 9, [ 1, [ 17, 22, 29 ] ] ] ], [ 10, 16, [ 10, 16, [ 1, [ 18, 4, 12 ] ] ] ], [ 12, 56, [ 12, 8, [ 1, [ 19, 35, 47 ] ] ] ], [ 9, 28, [ 9, 12, [ 1, [ 20, 38, 42 ] ] ] ], [ 10, 11, [ 10,\
 11, [ 1, [ 21, 20, 27 ] ] ] ], [ 16, 13, [ 16, 13, [ 1, [ 22, 21, 28 ] ] ] ], [ 16, 14, [ 16, 14, [ 1, [ 23, 5, 13 ] ] ] ], [ 15, 59, [ 15, 11, [ 1, [ 24, 39, 43 ] ] ] ], [ 1, 5, [ 1, 5, [ 2, [ 1, 1, 4 ] ] ] ], [ 2, 10, [ 2, 10, \
[ 2, [ 1, 4, 9 ] ] ] ], [ 5, 16, [ 5, 16, [ 2, [ 1, 9, 18 ] ] ] ], [ 10, 14, [ 10, 14, [ 2, [ 1, 18, 23 ] ] ] ], [ 16, 7, [ 16, 7, [ 2, [ 1, 23, 13 ] ] ] ], [ 14, 3, [ 14, 3, [ 2, [ 1, 13, 6 ] ] ] ], [ 7, 1, [ 7, 1, [ 2, [ 1, 6, 2\
 ] ] ] ], [ 3, 2, [ 3, 2, [ 2, [ 1, 2, 1 ] ] ] ], [ 2, 4, [ 2, 4, [ 2, [ 2, 1, 3 ] ] ] ], [ 1, 57, [ 1, 9, [ 2, [ 2, 3, 8 ] ] ] ], [ 4, 62, [ 4, 14, [ 2, [ 2, 8, 17 ] ] ] ], [ 9, 16, [ 9, 16, [ 2, [ 2, 17, 23 ] ] ] ], [ 14, 13, [ \
14, 13, [ 2, [ 2, 23, 22 ] ] ] ], [ 16, 54, [ 16, 6, [ 2, [ 2, 22, 12 ] ] ] ], [ 13, 50, [ 13, 2, [ 2, [ 2, 12, 5 ] ] ] ], [ 6, 1, [ 6, 1, [ 2, [ 2, 5, 1 ] ] ] ], [ 16, 11, [ 16, 11, [ 2, [ 3, 18, 21 ] ] ] ], [ 10, 20, [ 10, 4, [ \
2, [ 3, 21, 10 ] ] ] ], [ 11, 17, [ 11, 1, [ 2, [ 3, 10, 3 ] ] ] ], [ 4, 3, [ 4, 3, [ 2, [ 3, 3, 2 ] ] ] ], [ 1, 8, [ 1, 8, [ 2, [ 3, 2, 7 ] ] ] ], [ 3, 29, [ 3, 13, [ 2, [ 3, 7, 16 ] ] ] ], [ 8, 32, [ 8, 16, [ 2, [ 3, 16, 22 ] ] \
] ], [ 13, 10, [ 13, 10, [ 2, [ 3, 22, 18 ] ] ] ], [ 5, 6, [ 5, 6, [ 2, [ 4, 4, 5 ] ] ] ], [ 2, 31, [ 2, 15, [ 2, [ 4, 5, 14 ] ] ] ], [ 6, 23, [ 6, 7, [ 2, [ 4, 14, 15 ] ] ] ], [ 15, 14, [ 15, 14, [ 2, [ 4, 15, 13 ] ] ] ], [ 7, 9,\
 [ 7, 9, [ 2, [ 4, 13, 17 ] ] ] ], [ 14, 28, [ 14, 12, [ 2, [ 4, 17, 20 ] ] ] ], [ 9, 21, [ 9, 5, [ 2, [ 4, 20, 11 ] ] ] ], [ 12, 2, [ 12, 2, [ 2, [ 4, 11, 4 ] ] ] ], [ 10, 12, [ 10, 12, [ 2, [ 5, 9, 11 ] ] ] ], [ 5, 56, [ 5, 8, [\
 2, [ 5, 11, 19 ] ] ] ], [ 12, 51, [ 12, 3, [ 2, [ 5, 19, 7 ] ] ] ], [ 8, 7, [ 8, 7, [ 2, [ 5, 7, 6 ] ] ] ], [ 3, 15, [ 3, 15, [ 2, [ 5, 6, 15 ] ] ] ], [ 7, 59, [ 7, 11, [ 2, [ 5, 15, 24 ] ] ] ], [ 15, 58, [ 15, 10, [ 2, [ 5, 24, \
21 ] ] ] ], [ 11, 5, [ 11, 5, [ 2, [ 5, 21, 9 ] ] ] ], [ 6, 40, [ 6, 8, [ 2, [ 6, 12, 16 ] ] ] ], [ 13, 44, [ 13, 12, [ 2, [ 6, 16, 19 ] ] ] ], [ 8, 41, [ 8, 9, [ 2, [ 6, 19, 20 ] ] ] ], [ 12, 36, [ 12, 4, [ 2, [ 6, 20, 8 ] ] ] ],\
 [ 9, 43, [ 9, 11, [ 2, [ 6, 8, 10 ] ] ] ], [ 4, 47, [ 4, 15, [ 2, [ 6, 10, 24 ] ] ] ], [ 11, 38, [ 11, 6, [ 2, [ 6, 24, 14 ] ] ] ], [ 15, 45, [ 15, 13, [ 2, [ 6, 14, 12 ] ] ] ], [ 17, 18, [ 1, 2, [ 1, [ 1, 1, 9 ] ] ] ], [ 19, 17,\
 [ 3, 1, [ 1, [ 2, 8, 16 ] ] ] ], [ 17, 20, [ 1, 4, [ 1, [ 3, 17, 32 ] ] ] ], [ 18, 21, [ 2, 5, [ 1, [ 4, 2, 10 ] ] ] ], [ 18, 22, [ 2, 6, [ 1, [ 5, 18, 25 ] ] ] ], [ 23, 19, [ 7, 3, [ 1, [ 6, 7, 15 ] ] ] ], [ 19, 24, [ 3, 8, [ 1,\
 [ 7, 24, 31 ] ] ] ], [ 20, 41, [ 4, 9, [ 1, [ 8, 33, 45 ] ] ] ], [ 21, 26, [ 5, 10, [ 1, [ 9, 3, 11 ] ] ] ], [ 27, 4, [ 11, 4, [ 1, [ 10, 36, 48 ] ] ] ], [ 21, 28, [ 5, 12, [ 1, [ 11, 19, 26 ] ] ] ], [ 29, 38, [ 13, 6, [ 1, [ 12,\
 37, 41 ] ] ] ], [ 30, 23, [ 14, 7, [ 1, [ 13, 6, 14 ] ] ] ], [ 22, 15, [ 6, 15, [ 1, [ 14, 34, 46 ] ] ] ], [ 23, 31, [ 7, 15, [ 1, [ 15, 23, 30 ] ] ] ], [ 24, 13, [ 8, 13, [ 1, [ 16, 40, 44 ] ] ] ], [ 30, 25, [ 14, 9, [ 1, [ 17, \
22, 29 ] ] ] ], [ 26, 32, [ 10, 16, [ 1, [ 18, 4, 12 ] ] ] ], [ 28, 40, [ 12, 8, [ 1, [ 19, 35, 47 ] ] ] ], [ 25, 12, [ 9, 12, [ 1, [ 20, 38, 42 ] ] ] ], [ 26, 27, [ 10, 11, [ 1, [ 21, 20, 27 ] ] ] ], [ 32, 29, [ 16, 13, [ 1, [ 22\
, 21, 28 ] ] ] ], [ 32, 30, [ 16, 14, [ 1, [ 23, 5, 13 ] ] ] ], [ 31, 43, [ 15, 11, [ 1, [ 24, 39, 43 ] ] ] ], [ 17, 21, [ 1, 5, [ 2, [ 1, 1, 4 ] ] ] ], [ 18, 26, [ 2, 10, [ 2, [ 1, 4, 9 ] ] ] ], [ 21, 32, [ 5, 16, [ 2, [ 1, 9, 18\
 ] ] ] ], [ 26, 30, [ 10, 14, [ 2, [ 1, 18, 23 ] ] ] ], [ 32, 23, [ 16, 7, [ 2, [ 1, 23, 13 ] ] ] ], [ 30, 19, [ 14, 3, [ 2, [ 1, 13, 6 ] ] ] ], [ 23, 17, [ 7, 1, [ 2, [ 1, 6, 2 ] ] ] ], [ 19, 18, [ 3, 2, [ 2, [ 1, 2, 1 ] ] ] ], [\
 18, 20, [ 2, 4, [ 2, [ 2, 1, 3 ] ] ] ], [ 17, 41, [ 1, 9, [ 2, [ 2, 3, 8 ] ] ] ], [ 20, 46, [ 4, 14, [ 2, [ 2, 8, 17 ] ] ] ], [ 25, 32, [ 9, 16, [ 2, [ 2, 17, 23 ] ] ] ], [ 30, 29, [ 14, 13, [ 2, [ 2, 23, 22 ] ] ] ], [ 32, 38, [ \
16, 6, [ 2, [ 2, 22, 12 ] ] ] ], [ 29, 34, [ 13, 2, [ 2, [ 2, 12, 5 ] ] ] ], [ 22, 17, [ 6, 1, [ 2, [ 2, 5, 1 ] ] ] ], [ 32, 27, [ 16, 11, [ 2, [ 3, 18, 21 ] ] ] ], [ 26, 4, [ 10, 4, [ 2, [ 3, 21, 10 ] ] ] ], [ 27, 1, [ 11, 1, [ 2\
, [ 3, 10, 3 ] ] ] ], [ 20, 19, [ 4, 3, [ 2, [ 3, 3, 2 ] ] ] ], [ 17, 24, [ 1, 8, [ 2, [ 3, 2, 7 ] ] ] ], [ 19, 13, [ 3, 13, [ 2, [ 3, 7, 16 ] ] ] ], [ 24, 16, [ 8, 16, [ 2, [ 3, 16, 22 ] ] ] ], [ 29, 26, [ 13, 10, [ 2, [ 3, 22, 1\
8 ] ] ] ], [ 21, 22, [ 5, 6, [ 2, [ 4, 4, 5 ] ] ] ], [ 18, 15, [ 2, 15, [ 2, [ 4, 5, 14 ] ] ] ], [ 22, 7, [ 6, 7, [ 2, [ 4, 14, 15 ] ] ] ], [ 31, 30, [ 15, 14, [ 2, [ 4, 15, 13 ] ] ] ], [ 23, 25, [ 7, 9, [ 2, [ 4, 13, 17 ] ] ] ], \
[ 30, 12, [ 14, 12, [ 2, [ 4, 17, 20 ] ] ] ], [ 25, 5, [ 9, 5, [ 2, [ 4, 20, 11 ] ] ] ], [ 28, 18, [ 12, 2, [ 2, [ 4, 11, 4 ] ] ] ], [ 26, 28, [ 10, 12, [ 2, [ 5, 9, 11 ] ] ] ], [ 21, 40, [ 5, 8, [ 2, [ 5, 11, 19 ] ] ] ], [ 28, 35\
, [ 12, 3, [ 2, [ 5, 19, 7 ] ] ] ], [ 24, 23, [ 8, 7, [ 2, [ 5, 7, 6 ] ] ] ], [ 19, 31, [ 3, 15, [ 2, [ 5, 6, 15 ] ] ] ], [ 23, 43, [ 7, 11, [ 2, [ 5, 15, 24 ] ] ] ], [ 31, 42, [ 15, 10, [ 2, [ 5, 24, 21 ] ] ] ], [ 27, 21, [ 11, 5\
, [ 2, [ 5, 21, 9 ] ] ] ], [ 22, 56, [ 6, 8, [ 2, [ 6, 12, 16 ] ] ] ], [ 29, 60, [ 13, 12, [ 2, [ 6, 16, 19 ] ] ] ], [ 24, 57, [ 8, 9, [ 2, [ 6, 19, 20 ] ] ] ], [ 28, 52, [ 12, 4, [ 2, [ 6, 20, 8 ] ] ] ], [ 25, 59, [ 9, 11, [ 2, [\
 6, 8, 10 ] ] ] ], [ 20, 63, [ 4, 15, [ 2, [ 6, 10, 24 ] ] ] ], [ 27, 54, [ 11, 6, [ 2, [ 6, 24, 14 ] ] ] ], [ 31, 61, [ 15, 13, [ 2, [ 6, 14, 12 ] ] ] ], [ 33, 34, [ 1, 2, [ 1, [ 1, 1, 9 ] ] ] ], [ 35, 33, [ 3, 1, [ 1, [ 2, 8, 16\
 ] ] ] ], [ 33, 36, [ 1, 4, [ 1, [ 3, 17, 32 ] ] ] ], [ 34, 37, [ 2, 5, [ 1, [ 4, 2, 10 ] ] ] ], [ 34, 38, [ 2, 6, [ 1, [ 5, 18, 25 ] ] ] ], [ 39, 35, [ 7, 3, [ 1, [ 6, 7, 15 ] ] ] ], [ 35, 40, [ 3, 8, [ 1, [ 7, 24, 31 ] ] ] ], [ \
36, 25, [ 4, 9, [ 1, [ 8, 33, 45 ] ] ] ], [ 37, 42, [ 5, 10, [ 1, [ 9, 3, 11 ] ] ] ], [ 43, 52, [ 11, 4, [ 1, [ 10, 36, 48 ] ] ] ], [ 37, 44, [ 5, 12, [ 1, [ 11, 19, 26 ] ] ] ], [ 45, 22, [ 13, 6, [ 1, [ 12, 37, 41 ] ] ] ], [ 46, \
39, [ 14, 7, [ 1, [ 13, 6, 14 ] ] ] ], [ 38, 63, [ 6, 15, [ 1, [ 14, 34, 46 ] ] ] ], [ 39, 47, [ 7, 15, [ 1, [ 15, 23, 30 ] ] ] ], [ 40, 61, [ 8, 13, [ 1, [ 16, 40, 44 ] ] ] ], [ 46, 41, [ 14, 9, [ 1, [ 17, 22, 29 ] ] ] ], [ 42, 4\
8, [ 10, 16, [ 1, [ 18, 4, 12 ] ] ] ], [ 44, 24, [ 12, 8, [ 1, [ 19, 35, 47 ] ] ] ], [ 41, 60, [ 9, 12, [ 1, [ 20, 38, 42 ] ] ] ], [ 42, 43, [ 10, 11, [ 1, [ 21, 20, 27 ] ] ] ], [ 48, 45, [ 16, 13, [ 1, [ 22, 21, 28 ] ] ] ], [ 48,\
 46, [ 16, 14, [ 1, [ 23, 5, 13 ] ] ] ], [ 47, 27, [ 15, 11, [ 1, [ 24, 39, 43 ] ] ] ], [ 33, 37, [ 1, 5, [ 2, [ 1, 1, 4 ] ] ] ], [ 34, 42, [ 2, 10, [ 2, [ 1, 4, 9 ] ] ] ], [ 37, 48, [ 5, 16, [ 2, [ 1, 9, 18 ] ] ] ], [ 42, 46, [ 1\
0, 14, [ 2, [ 1, 18, 23 ] ] ] ], [ 48, 39, [ 16, 7, [ 2, [ 1, 23, 13 ] ] ] ], [ 46, 35, [ 14, 3, [ 2, [ 1, 13, 6 ] ] ] ], [ 39, 33, [ 7, 1, [ 2, [ 1, 6, 2 ] ] ] ], [ 35, 34, [ 3, 2, [ 2, [ 1, 2, 1 ] ] ] ], [ 34, 36, [ 2, 4, [ 2, [\
 2, 1, 3 ] ] ] ], [ 33, 25, [ 1, 9, [ 2, [ 2, 3, 8 ] ] ] ], [ 36, 30, [ 4, 14, [ 2, [ 2, 8, 17 ] ] ] ], [ 41, 48, [ 9, 16, [ 2, [ 2, 17, 23 ] ] ] ], [ 46, 45, [ 14, 13, [ 2, [ 2, 23, 22 ] ] ] ], [ 48, 22, [ 16, 6, [ 2, [ 2, 22, 12\
 ] ] ] ], [ 45, 18, [ 13, 2, [ 2, [ 2, 12, 5 ] ] ] ], [ 38, 33, [ 6, 1, [ 2, [ 2, 5, 1 ] ] ] ], [ 48, 43, [ 16, 11, [ 2, [ 3, 18, 21 ] ] ] ], [ 42, 52, [ 10, 4, [ 2, [ 3, 21, 10 ] ] ] ], [ 43, 49, [ 11, 1, [ 2, [ 3, 10, 3 ] ] ] ],\
 [ 36, 35, [ 4, 3, [ 2, [ 3, 3, 2 ] ] ] ], [ 33, 40, [ 1, 8, [ 2, [ 3, 2, 7 ] ] ] ], [ 35, 61, [ 3, 13, [ 2, [ 3, 7, 16 ] ] ] ], [ 40, 64, [ 8, 16, [ 2, [ 3, 16, 22 ] ] ] ], [ 45, 42, [ 13, 10, [ 2, [ 3, 22, 18 ] ] ] ], [ 37, 38, \
[ 5, 6, [ 2, [ 4, 4, 5 ] ] ] ], [ 34, 63, [ 2, 15, [ 2, [ 4, 5, 14 ] ] ] ], [ 38, 55, [ 6, 7, [ 2, [ 4, 14, 15 ] ] ] ], [ 47, 46, [ 15, 14, [ 2, [ 4, 15, 13 ] ] ] ], [ 39, 41, [ 7, 9, [ 2, [ 4, 13, 17 ] ] ] ], [ 46, 60, [ 14, 12, \
[ 2, [ 4, 17, 20 ] ] ] ], [ 41, 53, [ 9, 5, [ 2, [ 4, 20, 11 ] ] ] ], [ 44, 34, [ 12, 2, [ 2, [ 4, 11, 4 ] ] ] ], [ 42, 44, [ 10, 12, [ 2, [ 5, 9, 11 ] ] ] ], [ 37, 24, [ 5, 8, [ 2, [ 5, 11, 19 ] ] ] ], [ 44, 19, [ 12, 3, [ 2, [ 5\
, 19, 7 ] ] ] ], [ 40, 39, [ 8, 7, [ 2, [ 5, 7, 6 ] ] ] ], [ 35, 47, [ 3, 15, [ 2, [ 5, 6, 15 ] ] ] ], [ 39, 27, [ 7, 11, [ 2, [ 5, 15, 24 ] ] ] ], [ 47, 26, [ 15, 10, [ 2, [ 5, 24, 21 ] ] ] ], [ 43, 37, [ 11, 5, [ 2, [ 5, 21, 9 ]\
 ] ] ], [ 38, 8, [ 6, 8, [ 2, [ 6, 12, 16 ] ] ] ], [ 45, 12, [ 13, 12, [ 2, [ 6, 16, 19 ] ] ] ], [ 40, 9, [ 8, 9, [ 2, [ 6, 19, 20 ] ] ] ], [ 44, 4, [ 12, 4, [ 2, [ 6, 20, 8 ] ] ] ], [ 41, 11, [ 9, 11, [ 2, [ 6, 8, 10 ] ] ] ], [ 3\
6, 15, [ 4, 15, [ 2, [ 6, 10, 24 ] ] ] ], [ 43, 6, [ 11, 6, [ 2, [ 6, 24, 14 ] ] ] ], [ 47, 13, [ 15, 13, [ 2, [ 6, 14, 12 ] ] ] ], [ 49, 50, [ 1, 2, [ 1, [ 1, 1, 9 ] ] ] ], [ 51, 49, [ 3, 1, [ 1, [ 2, 8, 16 ] ] ] ], [ 49, 52, [ 1\
, 4, [ 1, [ 3, 17, 32 ] ] ] ], [ 50, 53, [ 2, 5, [ 1, [ 4, 2, 10 ] ] ] ], [ 50, 54, [ 2, 6, [ 1, [ 5, 18, 25 ] ] ] ], [ 55, 51, [ 7, 3, [ 1, [ 6, 7, 15 ] ] ] ], [ 51, 56, [ 3, 8, [ 1, [ 7, 24, 31 ] ] ] ], [ 52, 9, [ 4, 9, [ 1, [ 8\
, 33, 45 ] ] ] ], [ 53, 58, [ 5, 10, [ 1, [ 9, 3, 11 ] ] ] ], [ 59, 36, [ 11, 4, [ 1, [ 10, 36, 48 ] ] ] ], [ 53, 60, [ 5, 12, [ 1, [ 11, 19, 26 ] ] ] ], [ 61, 6, [ 13, 6, [ 1, [ 12, 37, 41 ] ] ] ], [ 62, 55, [ 14, 7, [ 1, [ 13, 6\
, 14 ] ] ] ], [ 54, 47, [ 6, 15, [ 1, [ 14, 34, 46 ] ] ] ], [ 55, 63, [ 7, 15, [ 1, [ 15, 23, 30 ] ] ] ], [ 56, 45, [ 8, 13, [ 1, [ 16, 40, 44 ] ] ] ], [ 62, 57, [ 14, 9, [ 1, [ 17, 22, 29 ] ] ] ], [ 58, 64, [ 10, 16, [ 1, [ 18, 4\
, 12 ] ] ] ], [ 60, 8, [ 12, 8, [ 1, [ 19, 35, 47 ] ] ] ], [ 57, 44, [ 9, 12, [ 1, [ 20, 38, 42 ] ] ] ], [ 58, 59, [ 10, 11, [ 1, [ 21, 20, 27 ] ] ] ], [ 64, 61, [ 16, 13, [ 1, [ 22, 21, 28 ] ] ] ], [ 64, 62, [ 16, 14, [ 1, [ 23, \
5, 13 ] ] ] ], [ 63, 11, [ 15, 11, [ 1, [ 24, 39, 43 ] ] ] ], [ 49, 53, [ 1, 5, [ 2, [ 1, 1, 4 ] ] ] ], [ 50, 58, [ 2, 10, [ 2, [ 1, 4, 9 ] ] ] ], [ 53, 64, [ 5, 16, [ 2, [ 1, 9, 18 ] ] ] ], [ 58, 62, [ 10, 14, [ 2, [ 1, 18, 23 ] \
] ] ], [ 64, 55, [ 16, 7, [ 2, [ 1, 23, 13 ] ] ] ], [ 62, 51, [ 14, 3, [ 2, [ 1, 13, 6 ] ] ] ], [ 55, 49, [ 7, 1, [ 2, [ 1, 6, 2 ] ] ] ], [ 51, 50, [ 3, 2, [ 2, [ 1, 2, 1 ] ] ] ], [ 50, 52, [ 2, 4, [ 2, [ 2, 1, 3 ] ] ] ], [ 49, 9,\
 [ 1, 9, [ 2, [ 2, 3, 8 ] ] ] ], [ 52, 14, [ 4, 14, [ 2, [ 2, 8, 17 ] ] ] ], [ 57, 64, [ 9, 16, [ 2, [ 2, 17, 23 ] ] ] ], [ 62, 61, [ 14, 13, [ 2, [ 2, 23, 22 ] ] ] ], [ 64, 6, [ 16, 6, [ 2, [ 2, 22, 12 ] ] ] ], [ 61, 2, [ 13, 2, \
[ 2, [ 2, 12, 5 ] ] ] ], [ 54, 49, [ 6, 1, [ 2, [ 2, 5, 1 ] ] ] ], [ 64, 59, [ 16, 11, [ 2, [ 3, 18, 21 ] ] ] ], [ 58, 36, [ 10, 4, [ 2, [ 3, 21, 10 ] ] ] ], [ 59, 33, [ 11, 1, [ 2, [ 3, 10, 3 ] ] ] ], [ 52, 51, [ 4, 3, [ 2, [ 3, \
3, 2 ] ] ] ], [ 49, 56, [ 1, 8, [ 2, [ 3, 2, 7 ] ] ] ], [ 51, 45, [ 3, 13, [ 2, [ 3, 7, 16 ] ] ] ], [ 56, 48, [ 8, 16, [ 2, [ 3, 16, 22 ] ] ] ], [ 61, 58, [ 13, 10, [ 2, [ 3, 22, 18 ] ] ] ], [ 53, 54, [ 5, 6, [ 2, [ 4, 4, 5 ] ] ] \
], [ 50, 47, [ 2, 15, [ 2, [ 4, 5, 14 ] ] ] ], [ 54, 39, [ 6, 7, [ 2, [ 4, 14, 15 ] ] ] ], [ 63, 62, [ 15, 14, [ 2, [ 4, 15, 13 ] ] ] ], [ 55, 57, [ 7, 9, [ 2, [ 4, 13, 17 ] ] ] ], [ 62, 44, [ 14, 12, [ 2, [ 4, 17, 20 ] ] ] ], [ 5\
7, 37, [ 9, 5, [ 2, [ 4, 20, 11 ] ] ] ], [ 60, 50, [ 12, 2, [ 2, [ 4, 11, 4 ] ] ] ], [ 58, 60, [ 10, 12, [ 2, [ 5, 9, 11 ] ] ] ], [ 53, 8, [ 5, 8, [ 2, [ 5, 11, 19 ] ] ] ], [ 60, 3, [ 12, 3, [ 2, [ 5, 19, 7 ] ] ] ], [ 56, 55, [ 8,\
 7, [ 2, [ 5, 7, 6 ] ] ] ], [ 51, 63, [ 3, 15, [ 2, [ 5, 6, 15 ] ] ] ], [ 55, 11, [ 7, 11, [ 2, [ 5, 15, 24 ] ] ] ], [ 63, 10, [ 15, 10, [ 2, [ 5, 24, 21 ] ] ] ], [ 59, 53, [ 11, 5, [ 2, [ 5, 21, 9 ] ] ] ], [ 54, 24, [ 6, 8, [ 2, \
[ 6, 12, 16 ] ] ] ], [ 61, 28, [ 13, 12, [ 2, [ 6, 16, 19 ] ] ] ], [ 56, 25, [ 8, 9, [ 2, [ 6, 19, 20 ] ] ] ], [ 60, 20, [ 12, 4, [ 2, [ 6, 20, 8 ] ] ] ], [ 57, 27, [ 9, 11, [ 2, [ 6, 8, 10 ] ] ] ], [ 52, 31, [ 4, 15, [ 2, [ 6, 10\
, 24 ] ] ] ], [ 59, 22, [ 11, 6, [ 2, [ 6, 24, 14 ] ] ] ], [ 63, 29, [ 15, 13, [ 2, [ 6, 14, 12 ] ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1\
, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g2, g7^-1, g5, g3^-1, g2^-1, g7, g5^-1, g3, g2*g9*g4^-1*g8*g7^-1, 1, 1, 1, 1, g7*g8^-1, 1, 1, g9^-1*g2^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g4, 1, g2*g9*\
g4^-1*g8*g7^-1, g9^-1*g2^-1, g9^-1*g2^-1, g4, g4, g7*g8^-1, g7*g8^-1, g2*g9*g4^-1*g8*g7^-1, g7*g8^-1*g4*g9^-1*g2^-1, 1, g5^-1, g4^-1, g4^-1, 1, g5, g7*g8^-1*g4*g9^-1*g2^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g2*g9, 1,\
 g2^-1, g8*g7^-1, g8*g7^-1, 1, g2, g2*g9, g3, 1, g7^-1, 1, g3^-1, 1, g7, 1, g5*g4^-1, g4*g5^-1*g6*g8^-1*g2^-1*g7*g10^-1*g1*g6^-1*g3*g2*g9*g4^-1*g8*g7^-1*g5*g10*g9^-1, g3^-1, g7*g6^-1, g5^-1, g9, g2, g3, g2*g8*g7^-1, g2, g7^-1, g3^\
-1, g10^-1, g5, g7, g2^-1, g5, g3^-1*g6*g1^-1*g10*g7^-1, g7, g5^-1, g2^-1, g3, g5^-1*g7*g8^-1*g4*g9^-1*g2^-1, g7^-1, g7*g6^-1*g5*g4^-1, g2*g8*g6^-1, g3^-1*g6*g1^-1*g10*g7^-1*g2*g8*g7^-1, g5^-1*g7*g8^-1*g4*g9^-1*g2^-1*g3^-1*g6*g1^-\
1*g10*g7^-1, g10^-1*g5^-1*g7*g8^-1*g4*g9^-1*g2^-1, g9*g10^-1, g4*g5^-1*g6*g8^-1*g2^-1*g7*g10^-1*g1*g6^-1*g3*g2*g9*g4^-1*g8*g7^-1*g5*g10, g6*g8^-1*g2^-1*g7*g10^-1*g1*g6^-1*g3*g2*g9*g4^-1*g8*g7^-1*g5*g10*g9^-1, g3^-1*g4*g5^-1, 1, g3\
, g2*g9*g4^-1*g8*g7^-1, g3*g2*g9*g4^-1*g8*g7^-1*g5, 1, g3^-1, g4, g2^-1*g7*g10^-1*g1*g6^-1*g3, 1, g2, g1^-1, g2*g9*g10^-1*g5^-1*g7*g8^-1*g4*g9^-1*g2^-1*g3^-1*g6*g1^-1*g10*g7^-1*g2*g8*g6^-1*g5*g4^-1, 1, g2^-1, g7*g10^-1*g1*g6^-1, g\
5^-1*g6*g7^-1, 1, g5, g10*g7^-1, g5*g10, 1, g5^-1, g6, g8^-1*g2^-1, 1, g7, g9^-1*g2^-1, g7*g9^-1, 1, g7^-1, g7*g8^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g7*g10^-1*g1*g6^-1, 1, g10*g7^-1, 1, 1, 1, 1, 1, 1, 1, 1, g6, 1, 1, 1, 1, g1^-1, 1, 1\
, 1, 1, 1, 1, g10*g7^-1, g10*g7^-1, g1^-1, g1^-1, g6, g6, g7*g10^-1*g1*g6^-1, g7*g10^-1*g1*g6^-1, 1, 1, 1, 1, 1, 1, 1, 1, g1, 1, g3, g6*g1^-1*g10*g7^-1, g6*g1^-1*g10*g7^-1, 1, g3^-1, g1, g7*g10^-1, 1, g7^-1, g6^-1, g6^-1, 1, g7, g\
7*g10^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g2, 1, g5, 1, g2^-1, 1, g5^-1 ]\n[ ]"
gap> model := TessellationModelGraph(cg, true : simplify := 0);;
gap> sc := TGCellSymmetric(tg, TGQuotient([ 5, 1 ]), 3);;
gap> scmodel := TGSuperCellModelGraph(model, sc : simplify := 1);;
gap> ExportString(scmodel);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ], [ x^2, y^3, x*y*z, z^8, z^3*y*z^-1*x*z*y^-1*x*y^-1*z^-2*x ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^2*y^-1*z^-1*x^-1*z^2*y^-1, z*y^-1*z^-1*x*z^2*y*x^-1, y^-1*z^-1*x*z^2*y*x^-1*z,\
 y^-1*z^-2*x*z*y*z^-1*x^-1*y*z^-2*x*z*y*z^-2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*\
x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-\
1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^\
-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-\
1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, (y^-1*x^-1*y^-1)^2\
*x^-1*y^-1*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y\
^-1*x^-1)^5, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^6 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y\
^-1)^4*x^-1, (y^-1*x^-1)^3, x*y*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (y^-1*x^-1)^5, x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^4 ], [ 1, x^-1, (x^-1*y^-1)^3*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1 \
] ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ z*y^-1*z^-3*x*z^2*y*z^-2*x^-1, z^2*y^-1*z^-2*x*z^3*y*z^-1*x^-1, z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*z^-1, z^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y, z^-2*x*z*y^-1*z^-3*x^-1*z^2*y, z^-2*x*z^2*y\
^-1*z^-2*x^-1*z^2*y^-1, z^-3*x*z*y^-1*z^-3*x^-1*z*y^-1, x*y^-1*z^-2*x*z^3*y*z^-1*x^-1*z*y^-1, x*z*y^-1*z^-2*x*z^3*y*z^-1*x^-1*y^-1, y^-1*z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*x^-1*y^-1 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ g\
2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g1, g2*g3^-1*g4*g1, g3^-1*g4*g1*g2^-1, g2^-1*g4^-1, g3^-1*g2*g1^-1*g4^-1, g3^-1*g1, g3^-1*g2*g1^-1*g4^-1*(g3*g2^-1*g1)^2, g2^-1*g3*g2^-1*g1, g1^-1*g4^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1, g3*g1^-1*g4^-1*g3*g2\
^-1*g1 ]\n[ 1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x\
^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x\
^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-\
1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2\
*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1\
*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1\
*y^-1)^2*x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*(y^-1*x^-1\
*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(x*y)^2*x^-1,\
 y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (x\
*y)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^2*y*x^-1, (y*x)^2*y*\
x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^2*y*(x^-1*y^-1)^7*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)\
^2*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-\
1*y^-1)^2, y*(x^-1*y^-1)^2*y^-1*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y*x^-1*\
y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*\
x^-1, (x^-1*y^-1)^3*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x\
^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*x^-1, x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*y^-1*(\
x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^3*x^-1, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-\
1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1\
*x^-1, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*x^-1, y^-1*x*y*(x^-1*y^-1)^2, y^-1*x*y*(x^-1*y^-1\
)^2*y^-1*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x*y*(x^-\
1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^3, y*(x^-1*y^-1)^3*y^-1*x^-1, y*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y\
^-1)^2*x^-1, y*(x^-1*y^-1)^3*(y^-1*x^-1)^6, y*(x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x\
^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*\
y^-1*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*\
x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*x*y*x^-1*y^-1*(x*y)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^3*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2\
*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-\
1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, y^-1*(y^-1*x^-1)^3, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, (y^-1*x^-1)^4, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1*y^-1)^2*x^-1\
, y^-1*(x*y)^2*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2\
*(y^-1*x^-1)^7, y^-1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, y^-1*\
(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*x*y*(x^-1*y^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*\
x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(\
y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1,\
 (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x^-1\
*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1\
*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, ((y^-1*x^-1)^2*y^\
-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-\
1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^\
-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^2, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^\
-1)^7*x^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, (x^-1*y^-1)^2*y^-1*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (y^-1*x^-1)^4, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-\
1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^3*y^-1*x^-1, x^-\
1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1,\
 (x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-\
1)^2*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^7*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5\
*x^-1 ], [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, \
(y*x)^2*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1*y^-1*x^-1, (y*x)^2*y*x^-1, (x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^3*y*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-\
1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1 ] ]\n[ \"TESS\", [ 3, 8 ], [ \"VEF\", [ [ 3 ], [ 1 ], [ 2 ] ] ] ]\n[ [ 3, 1, 1 ], [ 3, 2, 1 ], [ 3, 3, 1 ], [ 3, 4, 1 ], [ 3, 5, 1 ], [ 3, 6, 1 ], [ 3, 1, \
2 ], [ 3, 2, 2 ], [ 3, 3, 2 ], [ 3, 4, 2 ], [ 3, 5, 2 ], [ 3, 6, 2 ], [ 3, 1, 3 ], [ 3, 2, 3 ], [ 3, 3, 3 ], [ 3, 4, 3 ], [ 3, 5, 3 ], [ 3, 6, 3 ], [ 3, 1, 4 ], [ 3, 2, 4 ], [ 3, 3, 4 ], [ 3, 4, 4 ], [ 3, 5, 4 ], [ 3, 6, 4 ] ]\n[ \
1, x^-1, (x^-1*y^-1)^3*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^7*x^-1, (x^-1*y^-1)^5*x^-1, (y*x)^2*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y\
*x^-1*y^-1*(x*y)^2*x^-1, (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*x^-1, (x^-1*y^-1)^4*x^-1, (y*x)^2*y*x^-1, (y*x)^2*y*(\
x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1 ]\n[ [ 1, 2, [ 1, 2, [ 1, [ 1, 1, 9 ] ] ] ], [ 1, 9, [ 1, 3, [ 1, [ 2, 8, 16 ] ] ] ], [ 2, 9, [ 2, 3, [ 1, [ 3, 17, 32 ] ] ] ], [ 1, 4, [ 1, 4, [ 1, [ 4, 2, 10 ] ] ] \
], [ 4, 2, [ 4, 2, [ 1, [ 5, 18, 25 ] ] ] ], [ 1, 23, [ 1, 5, [ 1, [ 6, 7, 15 ] ] ] ], [ 3, 17, [ 3, 5, [ 1, [ 7, 24, 31 ] ] ] ], [ 2, 24, [ 2, 6, [ 1, [ 8, 33, 45 ] ] ] ], [ 1, 5, [ 1, 5, [ 1, [ 9, 3, 11 ] ] ] ], [ 3, 18, [ 3, 6,\
 [ 1, [ 10, 36, 48 ] ] ] ], [ 5, 4, [ 5, 4, [ 1, [ 11, 19, 26 ] ] ] ], [ 2, 6, [ 2, 6, [ 1, [ 12, 37, 41 ] ] ] ], [ 1, 10, [ 1, 4, [ 1, [ 13, 6, 14 ] ] ] ], [ 4, 6, [ 4, 6, [ 1, [ 14, 34, 46 ] ] ] ], [ 5, 16, [ 5, 4, [ 1, [ 15, 23\
, 30 ] ] ] ], [ 3, 24, [ 3, 6, [ 1, [ 16, 40, 44 ] ] ] ], [ 4, 14, [ 4, 2, [ 1, [ 17, 22, 29 ] ] ] ], [ 1, 3, [ 1, 3, [ 1, [ 18, 4, 12 ] ] ] ], [ 5, 12, [ 5, 6, [ 1, [ 19, 35, 47 ] ] ] ], [ 4, 12, [ 4, 6, [ 1, [ 20, 38, 42 ] ] ] ]\
, [ 3, 5, [ 3, 5, [ 1, [ 21, 20, 27 ] ] ] ], [ 2, 21, [ 2, 3, [ 1, [ 22, 21, 28 ] ] ] ], [ 1, 20, [ 1, 2, [ 1, [ 23, 5, 13 ] ] ] ], [ 5, 18, [ 5, 6, [ 1, [ 24, 39, 43 ] ] ] ], [ 7, 8, [ 1, 2, [ 1, [ 1, 1, 9 ] ] ] ], [ 7, 3, [ 1, 3\
, [ 1, [ 2, 8, 16 ] ] ] ], [ 8, 3, [ 2, 3, [ 1, [ 3, 17, 32 ] ] ] ], [ 7, 10, [ 1, 4, [ 1, [ 4, 2, 10 ] ] ] ], [ 10, 8, [ 4, 2, [ 1, [ 5, 18, 25 ] ] ] ], [ 7, 17, [ 1, 5, [ 1, [ 6, 7, 15 ] ] ] ], [ 9, 23, [ 3, 5, [ 1, [ 7, 24, 31 \
] ] ] ], [ 8, 18, [ 2, 6, [ 1, [ 8, 33, 45 ] ] ] ], [ 7, 11, [ 1, 5, [ 1, [ 9, 3, 11 ] ] ] ], [ 9, 24, [ 3, 6, [ 1, [ 10, 36, 48 ] ] ] ], [ 11, 10, [ 5, 4, [ 1, [ 11, 19, 26 ] ] ] ], [ 8, 12, [ 2, 6, [ 1, [ 12, 37, 41 ] ] ] ], [ 7\
, 4, [ 1, 4, [ 1, [ 13, 6, 14 ] ] ] ], [ 10, 12, [ 4, 6, [ 1, [ 14, 34, 46 ] ] ] ], [ 11, 22, [ 5, 4, [ 1, [ 15, 23, 30 ] ] ] ], [ 9, 18, [ 3, 6, [ 1, [ 16, 40, 44 ] ] ] ], [ 10, 20, [ 4, 2, [ 1, [ 17, 22, 29 ] ] ] ], [ 7, 9, [ 1,\
 3, [ 1, [ 18, 4, 12 ] ] ] ], [ 11, 6, [ 5, 6, [ 1, [ 19, 35, 47 ] ] ] ], [ 10, 6, [ 4, 6, [ 1, [ 20, 38, 42 ] ] ] ], [ 9, 11, [ 3, 5, [ 1, [ 21, 20, 27 ] ] ] ], [ 8, 15, [ 2, 3, [ 1, [ 22, 21, 28 ] ] ] ], [ 7, 14, [ 1, 2, [ 1, [ \
23, 5, 13 ] ] ] ], [ 11, 24, [ 5, 6, [ 1, [ 24, 39, 43 ] ] ] ], [ 13, 14, [ 1, 2, [ 1, [ 1, 1, 9 ] ] ] ], [ 13, 21, [ 1, 3, [ 1, [ 2, 8, 16 ] ] ] ], [ 14, 21, [ 2, 3, [ 1, [ 3, 17, 32 ] ] ] ], [ 13, 16, [ 1, 4, [ 1, [ 4, 2, 10 ] ]\
 ] ], [ 16, 14, [ 4, 2, [ 1, [ 5, 18, 25 ] ] ] ], [ 13, 11, [ 1, 5, [ 1, [ 6, 7, 15 ] ] ] ], [ 15, 5, [ 3, 5, [ 1, [ 7, 24, 31 ] ] ] ], [ 14, 12, [ 2, 6, [ 1, [ 8, 33, 45 ] ] ] ], [ 13, 17, [ 1, 5, [ 1, [ 9, 3, 11 ] ] ] ], [ 15, 6\
, [ 3, 6, [ 1, [ 10, 36, 48 ] ] ] ], [ 17, 16, [ 5, 4, [ 1, [ 11, 19, 26 ] ] ] ], [ 14, 18, [ 2, 6, [ 1, [ 12, 37, 41 ] ] ] ], [ 13, 22, [ 1, 4, [ 1, [ 13, 6, 14 ] ] ] ], [ 16, 18, [ 4, 6, [ 1, [ 14, 34, 46 ] ] ] ], [ 17, 4, [ 5, \
4, [ 1, [ 15, 23, 30 ] ] ] ], [ 15, 12, [ 3, 6, [ 1, [ 16, 40, 44 ] ] ] ], [ 16, 2, [ 4, 2, [ 1, [ 17, 22, 29 ] ] ] ], [ 13, 15, [ 1, 3, [ 1, [ 18, 4, 12 ] ] ] ], [ 17, 24, [ 5, 6, [ 1, [ 19, 35, 47 ] ] ] ], [ 16, 24, [ 4, 6, [ 1,\
 [ 20, 38, 42 ] ] ] ], [ 15, 17, [ 3, 5, [ 1, [ 21, 20, 27 ] ] ] ], [ 14, 9, [ 2, 3, [ 1, [ 22, 21, 28 ] ] ] ], [ 13, 8, [ 1, 2, [ 1, [ 23, 5, 13 ] ] ] ], [ 17, 6, [ 5, 6, [ 1, [ 24, 39, 43 ] ] ] ], [ 19, 20, [ 1, 2, [ 1, [ 1, 1, \
9 ] ] ] ], [ 19, 15, [ 1, 3, [ 1, [ 2, 8, 16 ] ] ] ], [ 20, 15, [ 2, 3, [ 1, [ 3, 17, 32 ] ] ] ], [ 19, 22, [ 1, 4, [ 1, [ 4, 2, 10 ] ] ] ], [ 22, 20, [ 4, 2, [ 1, [ 5, 18, 25 ] ] ] ], [ 19, 5, [ 1, 5, [ 1, [ 6, 7, 15 ] ] ] ], [ 2\
1, 11, [ 3, 5, [ 1, [ 7, 24, 31 ] ] ] ], [ 20, 6, [ 2, 6, [ 1, [ 8, 33, 45 ] ] ] ], [ 19, 23, [ 1, 5, [ 1, [ 9, 3, 11 ] ] ] ], [ 21, 12, [ 3, 6, [ 1, [ 10, 36, 48 ] ] ] ], [ 23, 22, [ 5, 4, [ 1, [ 11, 19, 26 ] ] ] ], [ 20, 24, [ 2\
, 6, [ 1, [ 12, 37, 41 ] ] ] ], [ 19, 16, [ 1, 4, [ 1, [ 13, 6, 14 ] ] ] ], [ 22, 24, [ 4, 6, [ 1, [ 14, 34, 46 ] ] ] ], [ 23, 10, [ 5, 4, [ 1, [ 15, 23, 30 ] ] ] ], [ 21, 6, [ 3, 6, [ 1, [ 16, 40, 44 ] ] ] ], [ 22, 8, [ 4, 2, [ 1\
, [ 17, 22, 29 ] ] ] ], [ 19, 21, [ 1, 3, [ 1, [ 18, 4, 12 ] ] ] ], [ 23, 18, [ 5, 6, [ 1, [ 19, 35, 47 ] ] ] ], [ 22, 18, [ 4, 6, [ 1, [ 20, 38, 42 ] ] ] ], [ 21, 23, [ 3, 5, [ 1, [ 21, 20, 27 ] ] ] ], [ 20, 3, [ 2, 3, [ 1, [ 22,\
 21, 28 ] ] ] ], [ 19, 2, [ 1, 2, [ 1, [ 23, 5, 13 ] ] ] ], [ 23, 12, [ 5, 6, [ 1, [ 24, 39, 43 ] ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, g7, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g2*g9*g4^-1, g7*g8^-1, g7*g8^-1*g4*g9^-1*g2^-1, \
g2*g9*g4^-1, 1, g7*g8^-1, 1, g7*g8^-1*g4*g9^-1*g2^-1, g4^-1, g7, g2*g9, g3, 1, g3, g10, g5, 1, g4^-1, g9, g2^-1, 1, g2*g8*g6^-1*g5*g4^-1*g3*g1*g9*g10^-1*g5^-1*g7*g8^-1*g4*g9^-1*g2^-1, 1, g7, g3*g1, 1, g1^-1*g3^-1, g5*g4^-1*g3*g1, \
g4*g5^-1, g9^-1, g3*g2*g9*g4^-1*g8*g7^-1*g5*g10*g9^-1*g1^-1*g3^-1*g4*g5^-1*g6*g8^-1*g2^-1, 1, g7*g6^-1*g5*g4^-1*g3*g1, g2^-1, g6*g7^-1, g5*g4^-1, g10*g9^-1, 1, g8*g7^-1, g3*g2*g9*g4^-1*g8*g7^-1*g5*g10*g9^-1*g1^-1*g3^-1*g4*g5^-1*g6\
*g8^-1*g2^-1, g6^-1, g2*g8*g6^-1*g5*g4^-1*g3*g1, 1, g7*g6^-1, g7*g8^-1*g2^-1, g4^-1, g2*g9*g4^-1*g8*g7^-1*g5*g10*g9^-1, g8*g7^-1, g7*g10^-1*g1, g7*g10^-1*g1, 1, g1, g7*g10^-1, g6, g9^-1, g2^-1, g1, g3*g1, 1, 1, g6, g7*g10^-1, 1, 1\
, g2*g9*g4^-1*g8*g7^-1*g5, 1, g5, g5, g1, 1, 1, g3 ]\n[ ]"
gap> model := KagomeModelGraph(cg : simplify := 0);;
gap> sc := TGCellSymmetric(tg, TGQuotient([ 5, 1 ]), 3);;
gap> scmodel := TGSuperCellModelGraph(model, sc : simplify := 1);;
gap> ExportString(scmodel);
"[ 2, 3, 8 ]\n[ [ x^2, y^3, x*y*z, z*y*x*z*y^-1*z^-1*x*z ], [ x^2, y^3, x*y*z, z^8, z^3*y*z^-1*x*z*y^-1*x*y^-1*z^-2*x ], 3 ]\n[ g1, g2, g3, g4 ] -> [ z^2*y^-1*z^-1*x^-1*z^2*y^-1, z*y^-1*z^-1*x*z^2*y*x^-1, y^-1*z^-1*x*z^2*y*x^-1*z,\
 y^-1*z^-2*x*z*y*z^-1*x^-1*y*z^-2*x*z*y*z^-2 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*\
x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-\
1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^\
-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-\
1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, (y^-1*x^-1*y^-1)^2\
*x^-1*y^-1*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y\
^-1*x^-1)^5, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^6 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y\
^-1)^4*x^-1, (y^-1*x^-1)^3, x*y*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (y^-1*x^-1)^5, x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^4 ], [ 1, x^-1, (x^-1*y^-1)^3*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1 \
] ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ z*y^-1*z^-3*x*z^2*y*z^-2*x^-1, z^2*y^-1*z^-2*x*z^3*y*z^-1*x^-1, z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*z^-1, z^-1*x*z^2*y^-1*z^-2*x^-1*z^3*y, z^-2*x*z*y^-1*z^-3*x^-1*z^2*y, z^-2*x*z^2*y\
^-1*z^-2*x^-1*z^2*y^-1, z^-3*x*z*y^-1*z^-3*x^-1*z*y^-1, x*y^-1*z^-2*x*z^3*y*z^-1*x^-1*z*y^-1, x*z*y^-1*z^-2*x*z^3*y*z^-1*x^-1*y^-1, y^-1*z^-1*x*z*y^-1*z^-3*x^-1*z^2*y*x^-1*y^-1 ]\n[ g1, g2, g3, g4, g5, g6, g7, g8, g9, g10 ] -> [ g\
2*g1^-1*g4^-1*g3*g2^-1*g1*g4*g1, g2*g3^-1*g4*g1, g3^-1*g4*g1*g2^-1, g2^-1*g4^-1, g3^-1*g2*g1^-1*g4^-1, g3^-1*g1, g3^-1*g2*g1^-1*g4^-1*(g3*g2^-1*g1)^2, g2^-1*g3*g2^-1*g1, g1^-1*g4^-1*g2*g1^-1*g4^-1*g3*g2^-1*g1, g3*g1^-1*g4^-1*g3*g2\
^-1*g1 ]\n[ 1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1 ]\n[ 1, y^-1*x^-1, (y^-1*x^-1)^2, (y^-1*x^-1)^3, (y^-1*x^-1)^4, (y^-1*x^-1)^5, (y^-1*x^-1)^6, (y^-1*x^-1)^7, x\
^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^5*x^-1, (x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^7*x^-1, y^-1, y^-2*x^-1, y^-1*(y^-1*x^-1)^2, y^-1*(y^-1*x^-1)^3, y^-1*(y^-1*x^-1)^4, y^-1*(y^-1*x\
^-1)^5, y^-1*(y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, x*y*x^-1, x*y*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^4*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^7*x^-1, y^-1*x^-\
1*y^-1, y^-1*x^-1*y^-2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x*y)^2*x^-1, (x*y)^2\
*x^-1*y^-1*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1, y*x*y*x^-1*y^-1*x^-1, y*x*y*(x^-1\
*y^-1)^2*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, y*x*y*(x^-1*y^-1)^4*x^-1, y*x*y*(x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^7*x^-1, (x^-1*y^-1)^2, (x^-1*y^-1)^2*y^-1*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*(y^-1*x^-1\
*y^-1)^2*x^-1*y^-1*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^2*y^-1, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*(y^-1*x^-1\
*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(x*y)^2*x^-1,\
 y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (x\
*y)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^2*y*x^-1, (y*x)^2*y*\
x^-1*y^-1*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*(x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^2*y*(x^-1*y^-1)^7*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-1*y^-1)\
^2*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-\
1*y^-1)^2, y*(x^-1*y^-1)^2*y^-1*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y*x^-1*\
y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (x^-1*y^-1)^3*y^-1*x^-1, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y^-1)^2*\
x^-1, (x^-1*y^-1)^3*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, ((y^-1*x\
^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*x^-1, x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x^-1*y^-1*(\
x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^3*x^-1, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-\
1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, (y*x)^3*y*x^-1, (y*x)^3*y*x^-1*y^-1\
*x^-1, (y*x)^3*y*(x^-1*y^-1)^2*x^-1, (y*x)^3*y*(x^-1*y^-1)^3*x^-1, (y*x)^3*y*(x^-1*y^-1)^4*x^-1, (y*x)^3*y*(x^-1*y^-1)^5*x^-1, (y*x)^3*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*(x^-1*y^-1)^7*x^-1, y^-1*x*y*(x^-1*y^-1)^2, y^-1*x*y*(x^-1*y^-1\
)^2*y^-1*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x*y*(x^-\
1*y^-1)^2*(y^-1*x^-1)^7, y*(x^-1*y^-1)^3, y*(x^-1*y^-1)^3*y^-1*x^-1, y*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y*x^-1*((y^-1*x^-1)^2*y^-1)^2*(x^-1*y\
^-1)^2*x^-1, y*(x^-1*y^-1)^3*(y^-1*x^-1)^6, y*(x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x*y*x\
^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*\
y^-1*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*\
x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y*x*y*x^-1*y^-1*(x*y)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^3*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1 ]\n[ [ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2\
*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, x*y*x*y*(x^-1*y^-1)^7*x^-1, y^-1*(y^-1*x^-1)^2, (x*y)^2*x^-1, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-\
1)^2*y^-1, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, y^-1*(y^-1*x^-1)^3, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, (y^-1*x^-1)^4, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1*y^-1)^2*x^-1\
, y^-1*(x*y)^2*x^-1, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^2*y^-2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2\
*(y^-1*x^-1)^7, y^-1*(x*y)^3*(x^-1*y^-1)^2*x^-1, y^-1*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^6*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, y^-1*\
(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*x*y*(x^-1*y^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, y^-1*(x*y)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*\
x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3*y^-2*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(\
y^-1*x^-1)^5, x*y*x*y*(x^-1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*(x*y)^3*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1,\
 (x*y)^3*(x^-1*y^-1)^2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x^-1\
*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1\
*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, ((y^-1*x^-1)^2*y^\
-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x*y)^3*(x^-1*y^-1)^4*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-\
1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^\
-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1 ], [ 1, y^-1*x^-1, (y^-1*x^-1)^7, x*y*(x^-1*y^-1)^7*x^-1, (y^-1*x^-1)^2, x*y*x^-1, (y^-1*x^-1)^6, x*y*(x^-1*y^-1)^6*x^-1, (x^-1*y^-1)^2, (y^-1*x^-1)^3, x*y*x*y*(x^-1*y^\
-1)^7*x^-1, x*y*x^-1*y^-1*x^-1, (x*y)^2*x^-1, (y^-1*x^-1)^5, (x^-1*y^-1)^2*y^-1*x^-1, x*y*(x^-1*y^-1)^5*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, (x^-1*y^-1)^3, (y^-1*x^-1)^4, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, x*y*(x^-\
1*y^-1)^2*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, x*y*(x^-1*y^-1)^4*x^-1, (x^-1*y^-1)^3*y^-1*x^-1, x^-\
1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^7, x*y*(x^-1*y^-1)^2*y^-1*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^6*x^-1,\
 (x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1, (x*y)^3*x^-1*y^-1*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-\
1)^2*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x^-1*y^-1)^3*(y^-1*x^-1)^6, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^4, x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^5, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^7*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^5*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)\
^2*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, x*y*x^-1*y^-1*(x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^4*x^-1, x*y*x^-1*y^-1*(x*y)^2*(x^-1*y^-1)^5\
*x^-1 ], [ 1, x^-1, (x^-1*y^-1)^7*x^-1, x^-1*y^-1*x^-1, (x^-1*y^-1)^6*x^-1, y*x*y*(x^-1*y^-1)^3*x^-1, (x^-1*y^-1)^2*x^-1, y*x*y*x^-1, (x^-1*y^-1)^5*x^-1, y*x*y*(x^-1*y^-1)^2*x^-1, (y*x)^2*y*(x^-1*y^-1)^2*x^-1, (x^-1*y^-1)^3*x^-1, \
(y*x)^2*y*(x^-1*y^-1)^7*x^-1, y*x*y*x^-1*y^-1*x^-1, (y*x)^2*y*x^-1, (x^-1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^3*x^-1, (y*x)^2*y*x^-1*y^-1*x^-1, (y*x)^3*y*x^-1, (y*x)^2*y*(x^-1*y^-1)^6*x^-1, (y*x)^3*y*x^-1*y^-1*x^-1, (y*x)^2*y*(x^-\
1*y^-1)^4*x^-1, (y*x)^2*y*(x^-1*y^-1)^5*x^-1, y*x*y*x^-1*y^-1*(x*y)^2*x^-1 ] ]\n[ \"KAGOME\", 8, [ \"VEF\", [ [ 1 ], [ 2 ], [ 2, 3 ] ] ] ]\n[ [ 1, 1, 1 ], [ 1, 2, 1 ], [ 1, 3, 1 ], [ 1, 4, 1 ], [ 1, 5, 1 ], [ 1, 6, 1 ], [ 1, 7, 1 \
], [ 1, 8, 1 ], [ 1, 9, 1 ], [ 1, 10, 1 ], [ 1, 11, 1 ], [ 1, 12, 1 ], [ 1, 13, 1 ], [ 1, 14, 1 ], [ 1, 15, 1 ], [ 1, 16, 1 ], [ 1, 17, 1 ], [ 1, 18, 1 ], [ 1, 19, 1 ], [ 1, 20, 1 ], [ 1, 21, 1 ], [ 1, 22, 1 ], [ 1, 23, 1 ], [ 1, \
24, 1 ], [ 1, 1, 2 ], [ 1, 2, 2 ], [ 1, 3, 2 ], [ 1, 4, 2 ], [ 1, 5, 2 ], [ 1, 6, 2 ], [ 1, 7, 2 ], [ 1, 8, 2 ], [ 1, 9, 2 ], [ 1, 10, 2 ], [ 1, 11, 2 ], [ 1, 12, 2 ], [ 1, 13, 2 ], [ 1, 14, 2 ], [ 1, 15, 2 ], [ 1, 16, 2 ], [ 1, 1\
7, 2 ], [ 1, 18, 2 ], [ 1, 19, 2 ], [ 1, 20, 2 ], [ 1, 21, 2 ], [ 1, 22, 2 ], [ 1, 23, 2 ], [ 1, 24, 2 ], [ 1, 1, 3 ], [ 1, 2, 3 ], [ 1, 3, 3 ], [ 1, 4, 3 ], [ 1, 5, 3 ], [ 1, 6, 3 ], [ 1, 7, 3 ], [ 1, 8, 3 ], [ 1, 9, 3 ], [ 1, 10\
, 3 ], [ 1, 11, 3 ], [ 1, 12, 3 ], [ 1, 13, 3 ], [ 1, 14, 3 ], [ 1, 15, 3 ], [ 1, 16, 3 ], [ 1, 17, 3 ], [ 1, 18, 3 ], [ 1, 19, 3 ], [ 1, 20, 3 ], [ 1, 21, 3 ], [ 1, 22, 3 ], [ 1, 23, 3 ], [ 1, 24, 3 ], [ 1, 1, 4 ], [ 1, 2, 4 ], [\
 1, 3, 4 ], [ 1, 4, 4 ], [ 1, 5, 4 ], [ 1, 6, 4 ], [ 1, 7, 4 ], [ 1, 8, 4 ], [ 1, 9, 4 ], [ 1, 10, 4 ], [ 1, 11, 4 ], [ 1, 12, 4 ], [ 1, 13, 4 ], [ 1, 14, 4 ], [ 1, 15, 4 ], [ 1, 16, 4 ], [ 1, 17, 4 ], [ 1, 18, 4 ], [ 1, 19, 4 ], \
[ 1, 20, 4 ], [ 1, 21, 4 ], [ 1, 22, 4 ], [ 1, 23, 4 ], [ 1, 24, 4 ] ]\n[ 1, (y^-1*x^-1)^7, y^-1, y^-1*x^-1, y^-2*x^-1, (y^-1*x^-1)^6, y^-1*(y^-1*x^-1)^7, y^-1*x^-1*y^-1, (y^-1*x^-1)^2, (y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(y^-\
1*x^-1)^2, y^-1*x^-1*y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^5, y^-1*x^-1*y^-2*x^-1, y^-1*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(y^-1*x^-1)^5, (y^-1*x^-1)^3, (y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*(y^-1*x^-1)^5, y^-1*(y^-1*x^\
-1)^3, y^-1*(y^-1*x^-1)^4, (y^-1*x^-1)^4, y^-1*x^-1*y^-1*(y^-1*x^-1)^6, y^-1*(x*y)^3*(x^-1*y^-1)^5*x^-1, y^-1*x^-1*((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1\
)^5*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^3*x^-1, (x*y)^3*(x^-1*y^-1)^3*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^7*x^-1, x*y*x*y*(x^-1*y^-1)^7*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1*y^-1*x^-1, x*y*(\
x^-1*y^-1)^2*(y^-1*x^-1)^7, (y^-1*x^-1)^3*y^-2*x^-1, x*y*x*y*(x^-1*y^-1)^5*x^-1, (y^-1*x^-1)^2*y^-2*x^-1, (x*y)^2*(x^-1*y^-1)^3*x^-1, (x*y)^3*x^-1*y^-1*x^-1, ((y^-1*x^-1)^3*y^-1)^2*(x^-1*y^-1)^3*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)\
^5, (x*y)^2*x^-1*y^-1*x^-1, (x*y)^3*(x^-1*y^-1)^7*x^-1, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^7, y^-1*(x*y)^3*x^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*(x^-1*y^-\
1)^2*(y^-1*x^-1)^6, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^7, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^5, y^-1*(x*y)^2*x\
^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^4*x^-1, y^-1*x*y*(x^-1*y^-1)^2, y^-1*(x*y)^2*(x^-1*y^-1)^5*x^-1, y^-1*x^-1*y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*(x*y)^2*(x^-1*y^-1)^2*x^-1, \
y^-1*x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, y^-1*(x*y)^2*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^3*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^6*x^-1, y^-1*x*y*\
(x^-1*y^-1)^2*y^-1*x^-1, y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*y^-1*x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1*y^-1*x^-1, y^-1*(x*y)^2*(x^-1*y^-1)^7*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^4*x^-1, (x*y)^3*(x^-\
1*y^-1)^4*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^6*x^-1, ((y^-1*x^-1)^2*y^-1)^2*x^-1*y^-1*x^-1, y^-1*x^-1*y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, y^-1*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, x*y*x*y*(x^-1*y^-1)^4*x^-1, ((y^-1*x^-1)^3*y^-1)^2*x^-1*y^-1*x\
^-1*y^-1*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^6, (x*y)^3*(x^-1*y^-1)^6*x^-1, (x*y)^2*x^-1, y^-1*(x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*(x^-1*y^-1)^2*(y^-1*x^-1)^4, (x*y)^3*(x^-1*y^-1)^2*x^-1, x*y*x^-1*(y^-1*x^-1*y^-1)^2*x^-1, (y^-1*x^-1)^\
2*y^-1, y^-1*(x*y)^3*x^-1, x*y*x*y*(x^-1*y^-1)^6*x^-1, x*y*(x^-1*y^-1)^2, y^-1*x^-1*y^-1*x^-1*y^-1*(y^-1*x^-1)^6, (x*y)^3*x^-1, (y^-1*x^-1)^3*y^-1, (x*y)^2*(x^-1*y^-1)^2*x^-1 ]\n[ [ 1, 2, [ 1, 2, [ 1, [ 1, 1, 16 ] ] ] ], [ 1, 3, [\
 1, 3, [ 1, [ 1, 1, 17 ] ] ] ], [ 2, 3, [ 2, 3, [ 1, [ 1, 16, 17 ] ] ] ], [ 4, 1, [ 4, 1, [ 1, [ 2, 2, 9 ] ] ] ], [ 4, 5, [ 4, 5, [ 1, [ 2, 2, 18 ] ] ] ], [ 1, 5, [ 1, 5, [ 1, [ 2, 9, 18 ] ] ] ], [ 2, 6, [ 2, 6, [ 1, [ 3, 8, 15 ] \
] ] ], [ 2, 7, [ 2, 7, [ 1, [ 3, 8, 24 ] ] ] ], [ 6, 7, [ 6, 7, [ 1, [ 3, 15, 24 ] ] ] ], [ 3, 8, [ 3, 8, [ 1, [ 4, 32, 33 ] ] ] ], [ 3, 34, [ 3, 10, [ 1, [ 4, 32, 48 ] ] ] ], [ 8, 34, [ 8, 10, [ 1, [ 4, 33, 48 ] ] ] ], [ 9, 4, [ \
9, 4, [ 1, [ 5, 3, 10 ] ] ] ], [ 9, 11, [ 9, 11, [ 1, [ 5, 3, 19 ] ] ] ], [ 4, 11, [ 4, 11, [ 1, [ 5, 10, 19 ] ] ] ], [ 5, 14, [ 5, 14, [ 1, [ 6, 25, 34 ] ] ] ], [ 5, 84, [ 5, 12, [ 1, [ 6, 25, 41 ] ] ] ], [ 14, 84, [ 14, 12, [ 1,\
 [ 6, 34, 41 ] ] ] ], [ 6, 13, [ 6, 13, [ 1, [ 7, 7, 14 ] ] ] ], [ 6, 15, [ 6, 15, [ 1, [ 7, 7, 23 ] ] ] ], [ 13, 15, [ 13, 15, [ 1, [ 7, 14, 23 ] ] ] ], [ 7, 16, [ 7, 16, [ 1, [ 8, 31, 40 ] ] ] ], [ 7, 91, [ 7, 19, [ 1, [ 8, 31, \
47 ] ] ] ], [ 16, 91, [ 16, 19, [ 1, [ 8, 40, 47 ] ] ] ], [ 17, 20, [ 17, 20, [ 1, [ 9, 29, 38 ] ] ] ], [ 17, 80, [ 17, 8, [ 1, [ 9, 29, 45 ] ] ] ], [ 20, 80, [ 20, 8, [ 1, [ 9, 38, 45 ] ] ] ], [ 18, 9, [ 18, 9, [ 1, [ 10, 4, 11 ]\
 ] ] ], [ 18, 21, [ 18, 21, [ 1, [ 10, 4, 20 ] ] ] ], [ 9, 21, [ 9, 21, [ 1, [ 10, 11, 20 ] ] ] ], [ 21, 10, [ 21, 10, [ 1, [ 11, 27, 36 ] ] ] ], [ 21, 96, [ 21, 24, [ 1, [ 11, 27, 43 ] ] ] ], [ 10, 96, [ 10, 24, [ 1, [ 11, 36, 43\
 ] ] ] ], [ 11, 19, [ 11, 19, [ 1, [ 12, 26, 35 ] ] ] ], [ 11, 44, [ 11, 20, [ 1, [ 12, 26, 42 ] ] ] ], [ 19, 44, [ 19, 20, [ 1, [ 12, 35, 42 ] ] ] ], [ 22, 12, [ 22, 12, [ 1, [ 13, 28, 37 ] ] ] ], [ 22, 40, [ 22, 16, [ 1, [ 13, 2\
8, 44 ] ] ] ], [ 12, 40, [ 12, 16, [ 1, [ 13, 37, 44 ] ] ] ], [ 13, 23, [ 13, 23, [ 1, [ 14, 6, 13 ] ] ] ], [ 13, 17, [ 13, 17, [ 1, [ 14, 6, 22 ] ] ] ], [ 23, 17, [ 23, 17, [ 1, [ 14, 13, 22 ] ] ] ], [ 15, 24, [ 15, 24, [ 1, [ 15\
, 30, 39 ] ] ] ], [ 15, 38, [ 15, 14, [ 1, [ 15, 30, 46 ] ] ] ], [ 24, 38, [ 24, 14, [ 1, [ 15, 39, 46 ] ] ] ], [ 23, 18, [ 23, 18, [ 1, [ 16, 5, 12 ] ] ] ], [ 23, 22, [ 23, 22, [ 1, [ 16, 5, 21 ] ] ] ], [ 18, 22, [ 18, 22, [ 1, [\
 16, 12, 21 ] ] ] ], [ 25, 26, [ 1, 2, [ 1, [ 1, 1, 16 ] ] ] ], [ 25, 27, [ 1, 3, [ 1, [ 1, 1, 17 ] ] ] ], [ 26, 27, [ 2, 3, [ 1, [ 1, 16, 17 ] ] ] ], [ 28, 25, [ 4, 1, [ 1, [ 2, 2, 9 ] ] ] ], [ 28, 29, [ 4, 5, [ 1, [ 2, 2, 18 ] ]\
 ] ], [ 25, 29, [ 1, 5, [ 1, [ 2, 9, 18 ] ] ] ], [ 26, 30, [ 2, 6, [ 1, [ 3, 8, 15 ] ] ] ], [ 26, 31, [ 2, 7, [ 1, [ 3, 8, 24 ] ] ] ], [ 30, 31, [ 6, 7, [ 1, [ 3, 15, 24 ] ] ] ], [ 27, 32, [ 3, 8, [ 1, [ 4, 32, 33 ] ] ] ], [ 27, 1\
0, [ 3, 10, [ 1, [ 4, 32, 48 ] ] ] ], [ 32, 10, [ 8, 10, [ 1, [ 4, 33, 48 ] ] ] ], [ 33, 28, [ 9, 4, [ 1, [ 5, 3, 10 ] ] ] ], [ 33, 35, [ 9, 11, [ 1, [ 5, 3, 19 ] ] ] ], [ 28, 35, [ 4, 11, [ 1, [ 5, 10, 19 ] ] ] ], [ 29, 38, [ 5, \
14, [ 1, [ 6, 25, 34 ] ] ] ], [ 29, 60, [ 5, 12, [ 1, [ 6, 25, 41 ] ] ] ], [ 38, 60, [ 14, 12, [ 1, [ 6, 34, 41 ] ] ] ], [ 30, 37, [ 6, 13, [ 1, [ 7, 7, 14 ] ] ] ], [ 30, 39, [ 6, 15, [ 1, [ 7, 7, 23 ] ] ] ], [ 37, 39, [ 13, 15, [\
 1, [ 7, 14, 23 ] ] ] ], [ 31, 40, [ 7, 16, [ 1, [ 8, 31, 40 ] ] ] ], [ 31, 67, [ 7, 19, [ 1, [ 8, 31, 47 ] ] ] ], [ 40, 67, [ 16, 19, [ 1, [ 8, 40, 47 ] ] ] ], [ 41, 44, [ 17, 20, [ 1, [ 9, 29, 38 ] ] ] ], [ 41, 56, [ 17, 8, [ 1,\
 [ 9, 29, 45 ] ] ] ], [ 44, 56, [ 20, 8, [ 1, [ 9, 38, 45 ] ] ] ], [ 42, 33, [ 18, 9, [ 1, [ 10, 4, 11 ] ] ] ], [ 42, 45, [ 18, 21, [ 1, [ 10, 4, 20 ] ] ] ], [ 33, 45, [ 9, 21, [ 1, [ 10, 11, 20 ] ] ] ], [ 45, 34, [ 21, 10, [ 1, [\
 11, 27, 36 ] ] ] ], [ 45, 72, [ 21, 24, [ 1, [ 11, 27, 43 ] ] ] ], [ 34, 72, [ 10, 24, [ 1, [ 11, 36, 43 ] ] ] ], [ 35, 43, [ 11, 19, [ 1, [ 12, 26, 35 ] ] ] ], [ 35, 20, [ 11, 20, [ 1, [ 12, 26, 42 ] ] ] ], [ 43, 20, [ 19, 20, [\
 1, [ 12, 35, 42 ] ] ] ], [ 46, 36, [ 22, 12, [ 1, [ 13, 28, 37 ] ] ] ], [ 46, 16, [ 22, 16, [ 1, [ 13, 28, 44 ] ] ] ], [ 36, 16, [ 12, 16, [ 1, [ 13, 37, 44 ] ] ] ], [ 37, 47, [ 13, 23, [ 1, [ 14, 6, 13 ] ] ] ], [ 37, 41, [ 13, 1\
7, [ 1, [ 14, 6, 22 ] ] ] ], [ 47, 41, [ 23, 17, [ 1, [ 14, 13, 22 ] ] ] ], [ 39, 48, [ 15, 24, [ 1, [ 15, 30, 39 ] ] ] ], [ 39, 14, [ 15, 14, [ 1, [ 15, 30, 46 ] ] ] ], [ 48, 14, [ 24, 14, [ 1, [ 15, 39, 46 ] ] ] ], [ 47, 42, [ 2\
3, 18, [ 1, [ 16, 5, 12 ] ] ] ], [ 47, 46, [ 23, 22, [ 1, [ 16, 5, 21 ] ] ] ], [ 42, 46, [ 18, 22, [ 1, [ 16, 12, 21 ] ] ] ], [ 49, 50, [ 1, 2, [ 1, [ 1, 1, 16 ] ] ] ], [ 49, 51, [ 1, 3, [ 1, [ 1, 1, 17 ] ] ] ], [ 50, 51, [ 2, 3, \
[ 1, [ 1, 16, 17 ] ] ] ], [ 52, 49, [ 4, 1, [ 1, [ 2, 2, 9 ] ] ] ], [ 52, 53, [ 4, 5, [ 1, [ 2, 2, 18 ] ] ] ], [ 49, 53, [ 1, 5, [ 1, [ 2, 9, 18 ] ] ] ], [ 50, 54, [ 2, 6, [ 1, [ 3, 8, 15 ] ] ] ], [ 50, 55, [ 2, 7, [ 1, [ 3, 8, 24\
 ] ] ] ], [ 54, 55, [ 6, 7, [ 1, [ 3, 15, 24 ] ] ] ], [ 51, 56, [ 3, 8, [ 1, [ 4, 32, 33 ] ] ] ], [ 51, 82, [ 3, 10, [ 1, [ 4, 32, 48 ] ] ] ], [ 56, 82, [ 8, 10, [ 1, [ 4, 33, 48 ] ] ] ], [ 57, 52, [ 9, 4, [ 1, [ 5, 3, 10 ] ] ] ],\
 [ 57, 59, [ 9, 11, [ 1, [ 5, 3, 19 ] ] ] ], [ 52, 59, [ 4, 11, [ 1, [ 5, 10, 19 ] ] ] ], [ 53, 62, [ 5, 14, [ 1, [ 6, 25, 34 ] ] ] ], [ 53, 36, [ 5, 12, [ 1, [ 6, 25, 41 ] ] ] ], [ 62, 36, [ 14, 12, [ 1, [ 6, 34, 41 ] ] ] ], [ 54\
, 61, [ 6, 13, [ 1, [ 7, 7, 14 ] ] ] ], [ 54, 63, [ 6, 15, [ 1, [ 7, 7, 23 ] ] ] ], [ 61, 63, [ 13, 15, [ 1, [ 7, 14, 23 ] ] ] ], [ 55, 64, [ 7, 16, [ 1, [ 8, 31, 40 ] ] ] ], [ 55, 43, [ 7, 19, [ 1, [ 8, 31, 47 ] ] ] ], [ 64, 43, \
[ 16, 19, [ 1, [ 8, 40, 47 ] ] ] ], [ 65, 68, [ 17, 20, [ 1, [ 9, 29, 38 ] ] ] ], [ 65, 32, [ 17, 8, [ 1, [ 9, 29, 45 ] ] ] ], [ 68, 32, [ 20, 8, [ 1, [ 9, 38, 45 ] ] ] ], [ 66, 57, [ 18, 9, [ 1, [ 10, 4, 11 ] ] ] ], [ 66, 69, [ 1\
8, 21, [ 1, [ 10, 4, 20 ] ] ] ], [ 57, 69, [ 9, 21, [ 1, [ 10, 11, 20 ] ] ] ], [ 69, 58, [ 21, 10, [ 1, [ 11, 27, 36 ] ] ] ], [ 69, 48, [ 21, 24, [ 1, [ 11, 27, 43 ] ] ] ], [ 58, 48, [ 10, 24, [ 1, [ 11, 36, 43 ] ] ] ], [ 59, 67, \
[ 11, 19, [ 1, [ 12, 26, 35 ] ] ] ], [ 59, 92, [ 11, 20, [ 1, [ 12, 26, 42 ] ] ] ], [ 67, 92, [ 19, 20, [ 1, [ 12, 35, 42 ] ] ] ], [ 70, 60, [ 22, 12, [ 1, [ 13, 28, 37 ] ] ] ], [ 70, 88, [ 22, 16, [ 1, [ 13, 28, 44 ] ] ] ], [ 60,\
 88, [ 12, 16, [ 1, [ 13, 37, 44 ] ] ] ], [ 61, 71, [ 13, 23, [ 1, [ 14, 6, 13 ] ] ] ], [ 61, 65, [ 13, 17, [ 1, [ 14, 6, 22 ] ] ] ], [ 71, 65, [ 23, 17, [ 1, [ 14, 13, 22 ] ] ] ], [ 63, 72, [ 15, 24, [ 1, [ 15, 30, 39 ] ] ] ], [ \
63, 86, [ 15, 14, [ 1, [ 15, 30, 46 ] ] ] ], [ 72, 86, [ 24, 14, [ 1, [ 15, 39, 46 ] ] ] ], [ 71, 66, [ 23, 18, [ 1, [ 16, 5, 12 ] ] ] ], [ 71, 70, [ 23, 22, [ 1, [ 16, 5, 21 ] ] ] ], [ 66, 70, [ 18, 22, [ 1, [ 16, 12, 21 ] ] ] ],\
 [ 73, 74, [ 1, 2, [ 1, [ 1, 1, 16 ] ] ] ], [ 73, 75, [ 1, 3, [ 1, [ 1, 1, 17 ] ] ] ], [ 74, 75, [ 2, 3, [ 1, [ 1, 16, 17 ] ] ] ], [ 76, 73, [ 4, 1, [ 1, [ 2, 2, 9 ] ] ] ], [ 76, 77, [ 4, 5, [ 1, [ 2, 2, 18 ] ] ] ], [ 73, 77, [ 1,\
 5, [ 1, [ 2, 9, 18 ] ] ] ], [ 74, 78, [ 2, 6, [ 1, [ 3, 8, 15 ] ] ] ], [ 74, 79, [ 2, 7, [ 1, [ 3, 8, 24 ] ] ] ], [ 78, 79, [ 6, 7, [ 1, [ 3, 15, 24 ] ] ] ], [ 75, 80, [ 3, 8, [ 1, [ 4, 32, 33 ] ] ] ], [ 75, 58, [ 3, 10, [ 1, [ 4\
, 32, 48 ] ] ] ], [ 80, 58, [ 8, 10, [ 1, [ 4, 33, 48 ] ] ] ], [ 81, 76, [ 9, 4, [ 1, [ 5, 3, 10 ] ] ] ], [ 81, 83, [ 9, 11, [ 1, [ 5, 3, 19 ] ] ] ], [ 76, 83, [ 4, 11, [ 1, [ 5, 10, 19 ] ] ] ], [ 77, 86, [ 5, 14, [ 1, [ 6, 25, 34\
 ] ] ] ], [ 77, 12, [ 5, 12, [ 1, [ 6, 25, 41 ] ] ] ], [ 86, 12, [ 14, 12, [ 1, [ 6, 34, 41 ] ] ] ], [ 78, 85, [ 6, 13, [ 1, [ 7, 7, 14 ] ] ] ], [ 78, 87, [ 6, 15, [ 1, [ 7, 7, 23 ] ] ] ], [ 85, 87, [ 13, 15, [ 1, [ 7, 14, 23 ] ] \
] ], [ 79, 88, [ 7, 16, [ 1, [ 8, 31, 40 ] ] ] ], [ 79, 19, [ 7, 19, [ 1, [ 8, 31, 47 ] ] ] ], [ 88, 19, [ 16, 19, [ 1, [ 8, 40, 47 ] ] ] ], [ 89, 92, [ 17, 20, [ 1, [ 9, 29, 38 ] ] ] ], [ 89, 8, [ 17, 8, [ 1, [ 9, 29, 45 ] ] ] ],\
 [ 92, 8, [ 20, 8, [ 1, [ 9, 38, 45 ] ] ] ], [ 90, 81, [ 18, 9, [ 1, [ 10, 4, 11 ] ] ] ], [ 90, 93, [ 18, 21, [ 1, [ 10, 4, 20 ] ] ] ], [ 81, 93, [ 9, 21, [ 1, [ 10, 11, 20 ] ] ] ], [ 93, 82, [ 21, 10, [ 1, [ 11, 27, 36 ] ] ] ], [\
 93, 24, [ 21, 24, [ 1, [ 11, 27, 43 ] ] ] ], [ 82, 24, [ 10, 24, [ 1, [ 11, 36, 43 ] ] ] ], [ 83, 91, [ 11, 19, [ 1, [ 12, 26, 35 ] ] ] ], [ 83, 68, [ 11, 20, [ 1, [ 12, 26, 42 ] ] ] ], [ 91, 68, [ 19, 20, [ 1, [ 12, 35, 42 ] ] ]\
 ], [ 94, 84, [ 22, 12, [ 1, [ 13, 28, 37 ] ] ] ], [ 94, 64, [ 22, 16, [ 1, [ 13, 28, 44 ] ] ] ], [ 84, 64, [ 12, 16, [ 1, [ 13, 37, 44 ] ] ] ], [ 85, 95, [ 13, 23, [ 1, [ 14, 6, 13 ] ] ] ], [ 85, 89, [ 13, 17, [ 1, [ 14, 6, 22 ] \
] ] ], [ 95, 89, [ 23, 17, [ 1, [ 14, 13, 22 ] ] ] ], [ 87, 96, [ 15, 24, [ 1, [ 15, 30, 39 ] ] ] ], [ 87, 62, [ 15, 14, [ 1, [ 15, 30, 46 ] ] ] ], [ 96, 62, [ 24, 14, [ 1, [ 15, 39, 46 ] ] ] ], [ 95, 90, [ 23, 18, [ 1, [ 16, 5, 1\
2 ] ] ] ], [ 95, 94, [ 23, 22, [ 1, [ 16, 5, 21 ] ] ] ], [ 90, 94, [ 18, 22, [ 1, [ 16, 12, 21 ] ] ] ] ]\n[ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,\
 1, 1, 1, 1, 1, 1, 1, g7*g8^-1*g4*g9^-1*g2^-1, g7*g8^-1*g4*g9^-1*g2^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g2*g9, g2*g9, 1, 1, 1, 1, g8*g7^-1, g8*g7^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g4^-1, \
g4^-1, 1, g3^-1*g4, g3^-1*g4, 1, g5^-1*g6, g5^-1*g6, 1, g2*g9*g10^-1*g5^-1*g7*g8^-1*g4*g9^-1*g2^-1*g3^-1*g6*g1^-1*g10*g7^-1*g2*g8*g6^-1*g5*g4^-1*g3, g2*g9*g10^-1*g5^-1*g7*g8^-1*g4*g9^-1*g2^-1*g3^-1*g6*g1^-1*g10*g7^-1*g2*g8*g6^-1*g\
5*g4^-1*g3, 1, g3, 1, g3^-1, g8^-1, g8^-1, 1, g5, 1, g5^-1, g7*g9^-1*g2^-1, g7*g9^-1*g2^-1, 1, g2^-1, 1, g2, g5^-1, 1, g5, g2^-1*g7*g10^-1*g1*g6^-1, g2^-1*g7*g10^-1*g1*g6^-1, 1, g2, 1, g2^-1, g7, 1, g7^-1, g3^-1, 1, g3, g5*g10*g7^\
-1, g5*g10*g7^-1, 1, g7^-1, 1, g7, g3*g2*g9*g4^-1*g8*g7^-1, g3*g2*g9*g4^-1*g8*g7^-1, 1, 1, 1, 1, g7*g10^-1, g7*g10^-1, 1, g6*g1^-1*g10*g7^-1, g6*g1^-1*g10*g7^-1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, g1, g1, 1, \
1, 1, 1, 1, 1, 1, 1, 1, 1, g6^-1, g6^-1, 1, 1, 1, 1, 1, 1, 1 ]\n[ ]"

gap> STOP_TEST("TGSuperCellModelGraph.tst");
